"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 2000, \"word_counts\": \"{\\\"rnbqkbnr\\\": 1279, \\\"1ppp2p1\\\": 5, \\\"p3p3\\\": 31, \\\"5p2\\\": 253, \\\"6pp\\\": 33, \\\"4p3\\\": 288, \\\"pppp1pb1\\\": 1, \\\"rnbqk1nr\\\": 128, \\\"w\\\": 884, \\\"kqkq\\\": 1384, \\\"0\\\": 1123, \\\"6\\\": 265, \\\"e3e4\\\": 5, \\\"r1bqkbnr\\\": 449, \\\"ppppp2p\\\": 32, \\\"n5p1\\\": 17, \\\"5p1p\\\": 50, \\\"5n2\\\": 108, \\\"ppppp1p1\\\": 32, \\\"rnbqkb1r\\\": 432, \\\"2\\\": 527, \\\"4\\\": 312, \\\"h4h5\\\": 3, \\\"pppppppp\\\": 292, \\\"8\\\": 2057, \\\"2p5\\\": 266, \\\"pp1ppppp\\\": 115, \\\"b\\\": 1116, \\\"1\\\": 614, \\\"d7d5\\\": 161, \\\"2p2pp1\\\": 12, \\\"3p4\\\": 302, \\\"pp2p2p\\\": 6, \\\"2p1p3\\\": 36, \\\"3p2pq\\\": 2, \\\"pp3p1p\\\": 7, \\\"rnb1kbnr\\\": 183, \\\"c8h3\\\": 5, \\\"n7\\\": 107, \\\"7n\\\": 115, \\\"ppppp1pp\\\": 104, \\\"1p6\\\": 246, \\\"p1pppppp\\\": 111, \\\"c2c4\\\": 16, \\\"rn1qkbnr\\\": 158, \\\"p2bp1pp\\\": 1, \\\"1p1p1p2\\\": 9, \\\"1p5n\\\": 9, \\\"p1p1pppp\\\": 34, \\\"rnbqkbr1\\\": 55, \\\"qkq\\\": 82, \\\"7\\\": 264, \\\"g8f6\\\": 53, \\\"pp1p1ppp\\\": 35, \\\"6p1\\\": 230, \\\"b6n\\\": 5, \\\"pppppp1p\\\": 97, \\\"r1bqkb1r\\\": 141, \\\"b2a3\\\": 3, \\\"pp2pppp\\\": 29, \\\"q2p4\\\": 3, \\\"n5pn\\\": 4, \\\"p1ppppbp\\\": 4, \\\"r1bqk2r\\\": 17, \\\"3\\\": 349, \\\"5\\\": 281, \\\"a5b4\\\": 6, \\\"p1pp2pp\\\": 16, \\\"4pp1n\\\": 2, \\\"2p1q1p1\\\": 1, \\\"5n1p\\\": 13, \\\"pp1ppp2\\\": 13, \\\"rnb1kbr1\\\": 10, \\\"c7c6\\\": 14, \\\"rnbqk2r\\\": 48, \\\"pppp1pbp\\\": 2, \\\"4p1p1\\\": 49, \\\"2p1p1p1\\\": 10, \\\"pp1p4\\\": 12, \\\"b8c6\\\": 24, \\\"e2e4\\\": 119, \\\"r1bqk1nr\\\": 40, \\\"p1pn2pp\\\": 1, \\\"bp1b1p2\\\": 1, \\\"r3pn1p\\\": 1, \\\"1ppp1pp1\\\": 5, \\\"1nbqk2r\\\": 3, \\\"kkq\\\": 70, \\\"a6c8\\\": 1, \\\"p1pp1pp1\\\": 10, \\\"np6\\\": 25, \\\"4p2p\\\": 55, \\\"pp6\\\": 54, \\\"7p\\\": 219, \\\"2pppppr\\\": 1, \\\"rnbqkbn1\\\": 44, \\\"b4b5\\\": 8, \\\"p1pp3p\\\": 3, \\\"1p3p2\\\": 51, \\\"p3p1n1\\\": 1, \\\"1ppp2pp\\\": 12, \\\"f3g4\\\": 3, \\\"rnbq1bnr\\\": 69, \\\"1ppkpppp\\\": 1, \\\"p2p4\\\": 33, \\\"3p1bp1\\\": 2, \\\"ppp1pp1p\\\": 35, \\\"kq\\\": 238, \\\"n4p2\\\": 21, \\\"a2a3\\\": 5, \\\"p7\\\": 243, \\\"1ppppppp\\\": 96, \\\"1ppk1p2\\\": 1, \\\"p2pp2p\\\": 9, \\\"p2p1ppp\\\": 14, \\\"1pp1p3\\\": 11, \\\"g5f4\\\": 12, \\\"1p2q1pp\\\": 1, \\\"p4p2\\\": 43, \\\"2ppp3\\\": 12, \\\"2pp1p2\\\": 8, \\\"e4d5\\\": 5, \\\"2pp2p1\\\": 8, \\\"n3qn2\\\": 1, \\\"pb2pppp\\\": 1, \\\"r1b1kb1r\\\": 18, \\\"c1b2\\\": 26, \\\"pppp1p2\\\": 12, \\\"d2d4\\\": 130, \\\"2p1ppp1\\\": 8, \\\"1p1p2bp\\\": 2, \\\"2np4\\\": 9, \\\"ppp1p1pp\\\": 30, \\\"2rqkbnr\\\": 2, \\\"f7f6\\\": 2, \\\"rnb1k1nr\\\": 40, \\\"p1pp1ppp\\\": 41, \\\"1p1bp3\\\": 1, \\\"2p4q\\\": 2, \\\"p3pn2\\\": 6, \\\"1p1pkppp\\\": 1, \\\"rnbq1b1r\\\": 27, \\\"h4c4\\\": 1, \\\"rnbqkb2\\\": 10, \\\"1p1p1ppr\\\": 1, \\\"p1p4p\\\": 9, \\\"1p1pp1p1\\\": 7, \\\"b7\\\": 10, \\\"p1pkpp1p\\\": 2, \\\"rn1q1bnr\\\": 17, \\\"q\\\": 16, \\\"b4c5\\\": 4, \\\"p1p1n2p\\\": 2, \\\"pp1pp1p1\\\": 11, \\\"r1b1kbnr\\\": 59, \\\"f3e4\\\": 2, \\\"1pq1pppp\\\": 1, \\\"3p3n\\\": 11, \\\"1pp2n1b\\\": 1, \\\"p2p3p\\\": 9, \\\"kqq\\\": 68, \\\"g7g6\\\": 15, \\\"e4e5\\\": 9, \\\"ppppppp1\\\": 93, \\\"2pppppp\\\": 36, \\\"e7e5\\\": 191, \\\"pp1pp2p\\\": 15, \\\"5pp1\\\": 42, \\\"1p4p1\\\": 39, \\\"7b\\\": 18, \\\"p1pppp1p\\\": 48, \\\"g4f5\\\": 14, \\\"ppp1pppp\\\": 130, \\\"n2p4\\\": 16, \\\"1ppp1ppp\\\": 34, \\\"b2b3\\\": 2, \\\"pp1ppk1p\\\": 1, \\\"2pp4\\\": 38, \\\"4pppp\\\": 9, \\\"d4c5\\\": 6, \\\"p1p1pp1p\\\": 21, \\\"1p1p2p1\\\": 10, \\\"2n2p1n\\\": 2, \\\"pppp2pp\\\": 19, \\\"2p1q3\\\": 3, \\\"2b5\\\": 13, \\\"1p1ppqp1\\\": 1, \\\"p1p2p1p\\\": 5, \\\"f3f7\\\": 1, \\\"r2qkbnr\\\": 64, \\\"2n5\\\": 99, \\\"3bp2b\\\": 1, \\\"pppp1pp1\\\": 34, \\\"g1h3\\\": 6, \\\"pppk2p1\\\": 1, \\\"4p2n\\\": 16, \\\"3p1p1p\\\": 9, \\\"3p3p\\\": 55, \\\"p5p1\\\": 46, \\\"rpp1pp2\\\": 1, \\\"1nbqkbnr\\\": 55, \\\"k\\\": 34, \\\"f1g2\\\": 25, \\\"1bp1p2p\\\": 1, \\\"2np3r\\\": 1, \\\"1pp1p1p1\\\": 9, \\\"r1bqkbn1\\\": 16, \\\"f4g5\\\": 7, \\\"1pp3pr\\\": 1, \\\"p1npp2p\\\": 1, \\\"pp1p1bp1\\\": 1, \\\"2p2p2\\\": 38, \\\"e6e5\\\": 7, \\\"3pb2p\\\": 1, \\\"n2p1np1\\\": 1, \\\"ppp2p1p\\\": 15, \\\"p2qp1p1\\\": 1, \\\"b6p\\\": 3, \\\"rnbq1k1r\\\": 2, \\\"b5a4\\\": 4, \\\"pp4pp\\\": 3, \\\"2p1pp1n\\\": 2, \\\"pppkpppp\\\": 3, \\\"d2e1\\\": 2, \\\"r1bkqbnr\\\": 1, \\\"pp1pnppp\\\": 3, \\\"2p1p1n1\\\": 1, \\\"p2p2p1\\\": 7, \\\"4k3\\\": 2, \\\"1pp1pp1p\\\": 8, \\\"d4e5\\\": 10, \\\"p4n2\\\": 16, \\\"c7c5\\\": 22, \\\"1p1p3p\\\": 11, \\\"p4pp1\\\": 12, \\\"rpppnppp\\\": 1, \\\"1nbqkb1r\\\": 30, \\\"f5e4\\\": 12, \\\"p2pppp1\\\": 11, \\\"1p5p\\\": 44, \\\"5n1b\\\": 3, \\\"pppp1p1p\\\": 47, \\\"g4g5\\\": 14, \\\"p3pp2\\\": 11, \\\"1pn5\\\": 17, \\\"2p3p1\\\": 49, \\\"p2p1p1p\\\": 5, \\\"ppp3p1\\\": 5, \\\"3ppp1p\\\": 3, \\\"pppp1ppp\\\": 135, \\\"4p1n1\\\": 4, \\\"1p1p2n1\\\": 5, \\\"f8b4\\\": 7, \\\"2p2p1p\\\": 9, \\\"nn6\\\": 1, \\\"ppqpp1p1\\\": 1, \\\"b3a1\\\": 4, \\\"3p1pp1\\\": 13, \\\"ppp1p2p\\\": 15, \\\"c8g4\\\": 5, \\\"pppp1k1p\\\": 3, \\\"1p1b1ppp\\\": 1, \\\"3n4\\\": 12, \\\"1pp1p1pp\\\": 18, \\\"p6p\\\": 29, \\\"1p1p4\\\": 37, \\\"f8g7\\\": 25, \\\"rnbk1bnr\\\": 12, \\\"p1pqpppp\\\": 4, \\\"n1pppppr\\\": 1, \\\"a7a5\\\": 1, \\\"p1p2kpp\\\": 1, \\\"1pbp1p2\\\": 1, \\\"3pq2p\\\": 2, \\\"f3f4\\\": 1, \\\"1p2pp2\\\": 13, \\\"r1p4p\\\": 1, \\\"5p1n\\\": 15, \\\"ppq1p1pp\\\": 1, \\\"r1bk1b1r\\\": 1, \\\"1pp1pppp\\\": 37, \\\"3p2p1\\\": 54, \\\"ppp1pp2\\\": 14, \\\"ppp1pk1p\\\": 3, \\\"5npn\\\": 1, \\\"e7f6\\\": 1, \\\"1pq5\\\": 2, \\\"p1pp4\\\": 14, \\\"pp3n2\\\": 3, \\\"1b1ppppp\\\": 6, \\\"rn1qkb1r\\\": 59, \\\"2ppppp1\\\": 10, \\\"ppn5\\\": 3, \\\"1p2pp1p\\\": 6, \\\"2n1pn2\\\": 3, \\\"h5g4\\\": 11, \\\"p3pppq\\\": 1, \\\"2p2n2\\\": 15, \\\"p1p3b1\\\": 2, \\\"1p1ppp1p\\\": 16, \\\"h8h7\\\": 4, \\\"2p3pq\\\": 2, \\\"2pqp3\\\": 1, \\\"pp1p2pp\\\": 15, \\\"b1a3\\\": 4, \\\"pp1ppp1p\\\": 30, \\\"2p3n1\\\": 5, \\\"1q6\\\": 7, \\\"1rbqkb1r\\\": 12, \\\"pbp1p1pp\\\": 1, \\\"n3p3\\\": 18, \\\"pbppkppp\\\": 1, \\\"r2q1bnr\\\": 6, \\\"a7a6\\\": 6, \\\"p3p1p1\\\": 12, \\\"1n6\\\": 13, \\\"b1p5\\\": 4, \\\"p3ppbp\\\": 1, \\\"rn1qk1nr\\\": 14, \\\"c3b4\\\": 6, \\\"r2qkb1r\\\": 12, \\\"n1p1b2n\\\": 1, \\\"3pp3\\\": 37, \\\"1bpn1ppp\\\": 1, \\\"a6c7\\\": 1, \\\"1b1b4\\\": 1, \\\"1p1ppp1n\\\": 1, \\\"p1p3pp\\\": 13, \\\"ppppppbp\\\": 4, \\\"5npb\\\": 1, \\\"h6g7\\\": 3, \\\"p1ppppp1\\\": 25, \\\"e7e6\\\": 35, \\\"n6n\\\": 18, \\\"1p3pp1\\\": 4, \\\"1pp1p2p\\\": 6, \\\"c8b7\\\": 27, \\\"pp2qp1p\\\": 1, \\\"3p1p1n\\\": 4, \\\"p1p5\\\": 38, \\\"rp1pp1pp\\\": 2, \\\"p3pppp\\\": 13, \\\"2p1pq2\\\": 1, \\\"p2p1p2\\\": 10, \\\"1p2k1pp\\\": 1, \\\"f4f6\\\": 1, \\\"p1ppp2p\\\": 14, \\\"6pn\\\": 17, \\\"a3b5\\\": 6, \\\"g1f3\\\": 44, \\\"1p2n3\\\": 4, \\\"3pppp1\\\": 6, \\\"c5c4\\\": 1, \\\"b5pp\\\": 2, \\\"n3pp2\\\": 5, \\\"1ppp3r\\\": 1, \\\"1p1p1b2\\\": 2, \\\"b1c3\\\": 27, \\\"p1p1ppp1\\\": 7, \\\"1n1p3p\\\": 2, \\\"2q5\\\": 2, \\\"ppp1ppp1\\\": 26, \\\"b5c7\\\": 1, \\\"3p1n2\\\": 19, \\\"ppppkpp1\\\": 3, \\\"4pn2\\\": 13, \\\"1pp5\\\": 40, \\\"3q4\\\": 10, \\\"p2ppppp\\\": 27, \\\"p6n\\\": 18, \\\"p1p1p2p\\\": 5, \\\"1pn3pb\\\": 1, \\\"3pnp1p\\\": 1, \\\"p3n3\\\": 2, \\\"1pppppp1\\\": 25, \\\"c6e5\\\": 3, \\\"2p4p\\\": 34, \\\"pp1pppp1\\\": 28, \\\"2n2n1p\\\": 4, \\\"1p2p1q1\\\": 2, \\\"g4e2\\\": 3, \\\"d7d6\\\": 10, \\\"1ppkppp1\\\": 2, \\\"p3p2p\\\": 10, \\\"ppppqppp\\\": 9, \\\"rnb1kb1r\\\": 58, \\\"e5e6\\\": 1, \\\"1pppp1p1\\\": 13, \\\"p1ppp1p1\\\": 17, \\\"n1p5\\\": 18, \\\"1p2p2p\\\": 7, \\\"p1ppqppp\\\": 1, \\\"pppp3p\\\": 7, \\\"2n1p3\\\": 16, \\\"3p1p2\\\": 41, \\\"pppbn2p\\\": 1, \\\"e6f5\\\": 3, \\\"pppbppp1\\\": 1, \\\"r1q1kb1r\\\": 1, \\\"d6e5\\\": 3, \\\"p1ppp1pp\\\": 31, \\\"2n3p1\\\": 13, \\\"1p1ppp2\\\": 13, \\\"c4e3\\\": 1, \\\"n6p\\\": 17, \\\"2n1bn2\\\": 1, \\\"2n2p2\\\": 14, \\\"ppqpp2p\\\": 1, \\\"h7h5\\\": 8, \\\"p1ppnp2\\\": 1, \\\"2b1q1p1\\\": 1, \\\"1p2p3\\\": 43, \\\"1p2p1p1\\\": 10, \\\"p1pn1p1p\\\": 1, \\\"d7e6\\\": 3, \\\"p1np3b\\\": 2, \\\"p1q1pppp\\\": 1, \\\"rn2kbnr\\\": 33, \\\"h8h6\\\": 2, \\\"p4p1p\\\": 11, \\\"4bb1b\\\": 1, \\\"pppqpppp\\\": 9, \\\"rpp5\\\": 1, \\\"3p1ppp\\\": 7, \\\"d5e4\\\": 8, \\\"n4p1b\\\": 2, \\\"ppppp1pr\\\": 4, \\\"h2h3\\\": 7, \\\"1pp1pp2\\\": 8, \\\"1pppp2p\\\": 12, \\\"pp2p1pp\\\": 12, \\\"1n1p1p2\\\": 2, \\\"d8b6\\\": 3, \\\"np4p1\\\": 2, \\\"p2pp3\\\": 10, \\\"2p2ppp\\\": 8, \\\"3ppnp1\\\": 1, \\\"5b2\\\": 6, \\\"ppp1pkb1\\\": 1, \\\"rnbq2nr\\\": 13, \\\"n3p1p1\\\": 2, \\\"1ppp3p\\\": 5, \\\"1ppkp3\\\": 1, \\\"p4ppp\\\": 3, \\\"p3np1p\\\": 1, \\\"e2f4\\\": 1, \\\"r1bq2nr\\\": 3, \\\"ppp1pkbp\\\": 1, \\\"n1p4n\\\": 2, \\\"pr1ppppp\\\": 1, \\\"2bqkb1r\\\": 5, \\\"1pp1p1b1\\\": 1, \\\"p1np3p\\\": 1, \\\"1pp2pp1\\\": 7, \\\"3p1b2\\\": 11, \\\"1n1p4\\\": 3, \\\"f5c8\\\": 1, \\\"1b2p3\\\": 2, \\\"6q1\\\": 6, \\\"pp2p3\\\": 8, \\\"2pp1ppp\\\": 14, \\\"1p1pqp1p\\\": 1, \\\"p1p2bp1\\\": 1, \\\"rnbq1knr\\\": 7, \\\"f5h3\\\": 2, \\\"ppp1pkpp\\\": 6, \\\"p3p1pn\\\": 1, \\\"1ppp1p1p\\\": 10, \\\"4pq2\\\": 4, \\\"1pp2p1p\\\": 6, \\\"p4qq1\\\": 1, \\\"2bpp3\\\": 1, \\\"r1bnkb1r\\\": 1, \\\"f6g6\\\": 2, \\\"ppp2ppp\\\": 38, \\\"ppppp3\\\": 8, \\\"d6d5\\\": 6, \\\"ppp1bp1p\\\": 3, \\\"3pp1p1\\\": 10, \\\"f5e6\\\": 1, \\\"1q4pn\\\": 2, \\\"p2p2pp\\\": 4, \\\"1p4pn\\\": 4, \\\"ppp1pp1r\\\": 1, \\\"h6g4\\\": 7, \\\"1p1ppppp\\\": 26, \\\"1rbqkbnr\\\": 25, \\\"pp1pp1pp\\\": 34, \\\"1n2ppq1\\\": 1, \\\"rnb2bnr\\\": 7, \\\"g4f4\\\": 1, \\\"b5b4\\\": 7, \\\"rn1qkbn1\\\": 4, \\\"1bpppppr\\\": 4, \\\"7q\\\": 10, \\\"3b4\\\": 5, \\\"pbpp2pp\\\": 2, \\\"rn2k1nr\\\": 5, \\\"pq3p2\\\": 2, \\\"b3d5\\\": 1, \\\"r1bq1bnr\\\": 33, \\\"p1pkp1pp\\\": 2, \\\"3p3r\\\": 3, \\\"pppnq1p1\\\": 1, \\\"r1b1kbn1\\\": 5, \\\"h3d3\\\": 1, \\\"p1pnppp1\\\": 3, \\\"4p1qn\\\": 1, \\\"pppbpppp\\\": 6, \\\"1ppnpppp\\\": 2, \\\"pppppp2\\\": 21, \\\"2pp1pp1\\\": 1, \\\"2n1p2p\\\": 3, \\\"p1pqp1p1\\\": 1, \\\"rnbqk1n1\\\": 5, \\\"p1ppppbr\\\": 1, \\\"6pb\\\": 14, \\\"pp1pn2p\\\": 1, \\\"pp2p1p1\\\": 5, \\\"r1pp1p1r\\\": 1, \\\"1nbqkbn1\\\": 4, \\\"1p1p3q\\\": 2, \\\"p2pp1q1\\\": 1, \\\"1p2b1pp\\\": 2, \\\"2qpnppp\\\": 1, \\\"1p1pb3\\\": 2, \\\"p2npppp\\\": 2, \\\"g2g3\\\": 7, \\\"p2p1pp1\\\": 6, \\\"1p2p2r\\\": 1, \\\"2np1n2\\\": 2, \\\"pppb1ppp\\\": 4, \\\"r2qkbr1\\\": 1, \\\"qq\\\": 13, \\\"pp1p3p\\\": 7, \\\"1qp1p1p1\\\": 2, \\\"2p2p1n\\\": 5, \\\"3bbq2\\\": 1, \\\"p2ppp2\\\": 3, \\\"n1p3p1\\\": 4, \\\"1p1qp1bp\\\": 1, \\\"r1b1k1nr\\\": 14, \\\"3pp1pp\\\": 9, \\\"ppq5\\\": 1, \\\"ppqpppp1\\\": 2, \\\"p1pp1p1p\\\": 16, \\\"2p1pppp\\\": 8, \\\"kqk\\\": 62, \\\"c2c3\\\": 7, \\\"r6p\\\": 2, \\\"a4b5\\\": 12, \\\"1pppp1pp\\\": 21, \\\"rnbq1bnb\\\": 1, \\\"p2pk1pp\\\": 1, \\\"2p3pp\\\": 4, \\\"e6d7\\\": 2, \\\"a2a4\\\": 2, \\\"p1nnpp1p\\\": 1, \\\"d1c2\\\": 3, \\\"2nb4\\\": 2, \\\"6pq\\\": 3, \\\"pp2pp1p\\\": 14, \\\"c5d6\\\": 4, \\\"1p1ppkpp\\\": 1, \\\"r1ppp1pp\\\": 5, \\\"rnb1k2r\\\": 7, \\\"3q3n\\\": 2, \\\"n1b5\\\": 1, \\\"ppppn1p1\\\": 2, \\\"h4g5\\\": 10, \\\"2p4n\\\": 14, \\\"p1pppnpp\\\": 1, \\\"rnbq1b2\\\": 2, \\\"1ppppkpr\\\": 1, \\\"p4n1p\\\": 3, \\\"ppp5\\\": 14, \\\"1q5p\\\": 3, \\\"3ppp2\\\": 12, \\\"pp1pkpp1\\\": 1, \\\"b1p1p3\\\": 1, \\\"3b3p\\\": 3, \\\"rppp1p2\\\": 1, \\\"1nbqk1nr\\\": 7, \\\"a6e2\\\": 2, \\\"pbpppp1p\\\": 4, \\\"1p5b\\\": 5, \\\"2n2npp\\\": 1, \\\"p1pppkp1\\\": 3, \\\"b1b5\\\": 1, \\\"1p3p1p\\\": 8, \\\"r7\\\": 9, \\\"1bpppppp\\\": 1, \\\"4qp2\\\": 1, \\\"p1p2p2\\\": 12, \\\"1pqpp1p1\\\": 1, \\\"g8h6\\\": 6, \\\"2b4p\\\": 2, \\\"c5a3\\\": 1, \\\"1r1qkbnr\\\": 6, \\\"b1n4p\\\": 1, \\\"rq2kbnr\\\": 3, \\\"f1a6\\\": 3, \\\"2bqkbnr\\\": 13, \\\"rppppp1p\\\": 3, \\\"1bppppbp\\\": 1, \\\"pp4b1\\\": 2, \\\"pppnpp1p\\\": 2, \\\"b7h1\\\": 5, \\\"p1pbpppp\\\": 4, \\\"3p3b\\\": 4, \\\"h6c1\\\": 3, \\\"4b3\\\": 6, \\\"e3f4\\\": 2, \\\"n4pp1\\\": 2, \\\"2q3p1\\\": 3, \\\"b4n1p\\\": 1, \\\"c4b5\\\": 5, \\\"2n1pp1p\\\": 1, \\\"b5c4\\\": 17, \\\"p1p1pp2\\\": 8, \\\"1p1p1npp\\\": 1, \\\"2p3pn\\\": 4, \\\"pp1p1pbp\\\": 1, \\\"f2f4\\\": 3, \\\"1ppppk1p\\\": 2, \\\"p1n5\\\": 16, \\\"2ppp2p\\\": 6, \\\"ppn1p1p1\\\": 1, \\\"2p4b\\\": 3, \\\"pp1ppk2\\\": 2, \\\"d2c3\\\": 2, \\\"p1ppkppp\\\": 3, \\\"ppppbppp\\\": 4, \\\"2ppp1p1\\\": 7, \\\"e7h4\\\": 1, \\\"pp5p\\\": 7, \\\"4p1q1\\\": 5, \\\"n2p3n\\\": 4, \\\"1rb1kb1r\\\": 2, \\\"h6g5\\\": 5, \\\"ppp1p3\\\": 2, \\\"4bpp1\\\": 1, \\\"ppqk1ppp\\\": 2, \\\"2n4n\\\": 10, \\\"d5c6\\\": 2, \\\"pp3pp1\\\": 6, \\\"3pp1qp\\\": 2, \\\"1b4pp\\\": 2, \\\"n3pp1r\\\": 1, \\\"ppppb3\\\": 2, \\\"r1bqk1n1\\\": 2, \\\"g5e3\\\": 1, \\\"p1p4n\\\": 3, \\\"c5d4\\\": 5, \\\"2np2pn\\\": 1, \\\"ppp4p\\\": 6, \\\"g4h5\\\": 7, \\\"6n1\\\": 9, \\\"2n2pp1\\\": 4, \\\"1p1pp2p\\\": 5, \\\"b5c6\\\": 2, \\\"1pp2n2\\\": 3, \\\"2b1p3\\\": 6, \\\"1q4p1\\\": 5, \\\"c5b4\\\": 10, \\\"rnb1qbnr\\\": 2, \\\"ppppk1pp\\\": 1, \\\"4pp2\\\": 37, \\\"f1e2\\\": 2, \\\"1p1p1ppp\\\": 6, \\\"p1p1p1q1\\\": 1, \\\"1pppq1pp\\\": 1, \\\"1qppb3\\\": 1, \\\"1p1p1p1p\\\": 10, \\\"p1q1p3\\\": 1, \\\"1b4p1\\\": 1, \\\"1rbqk1nr\\\": 2, \\\"p2pp1pp\\\": 11, \\\"1ppbpkpp\\\": 1, \\\"3bp2p\\\": 1, \\\"pp1p1p1p\\\": 13, \\\"2pb4\\\": 4, \\\"2n1pp2\\\": 1, \\\"pppp4\\\": 9, \\\"g5h4\\\": 4, \\\"p1pp2p1\\\": 3, \\\"1pppk1pp\\\": 1, \\\"a6c5\\\": 2, \\\"2b3q1\\\": 2, \\\"h3g5\\\": 3, \\\"n1p3pb\\\": 1, \\\"q7\\\": 11, \\\"n3ppp1\\\": 2, \\\"ppp2k1p\\\": 1, \\\"f7f5\\\": 3, \\\"p5n1\\\": 3, \\\"p1p3n1\\\": 2, \\\"p2pkppp\\\": 2, \\\"b8a6\\\": 4, \\\"pppn1p1p\\\": 2, \\\"n3p2p\\\": 3, \\\"ppppnpp1\\\": 2, \\\"b7b5\\\": 1, \\\"2n3pn\\\": 3, \\\"rppp2p1\\\": 1, \\\"4n3\\\": 12, \\\"p1p1p3\\\": 6, \\\"1pqp1ppp\\\": 1, \\\"4pb2\\\": 5, \\\"2pp2pr\\\": 1, \\\"rppp2pp\\\": 1, \\\"a3e7\\\": 4, \\\"1pp2ppp\\\": 11, \\\"p1p2pnp\\\": 1, \\\"1p1bp1p1\\\": 1, \\\"1p3pb1\\\": 2, \\\"1ppqpppp\\\": 1, \\\"rn2kb1r\\\": 6, \\\"qp4p1\\\": 1, \\\"p2npp1p\\\": 1, \\\"1ppppp1p\\\": 30, \\\"3p1pn1\\\": 1, \\\"r1bqkbr1\\\": 18, \\\"2n2n2\\\": 17, \\\"f6h5\\\": 3, \\\"ppp1q1p1\\\": 1, \\\"3p2pp\\\": 13, \\\"ppp2p2\\\": 5, \\\"2pp2pp\\\": 9, \\\"pp2np1n\\\": 1, \\\"f6e4\\\": 9, \\\"1b2p1pp\\\": 3, \\\"g5g4\\\": 16, \\\"ppppbpp1\\\": 1, \\\"3p3q\\\": 3, \\\"ppp2pp1\\\": 12, \\\"3pp2p\\\": 6, \\\"d5d4\\\": 4, \\\"1ppppp2\\\": 9, \\\"p4r2\\\": 1, \\\"p3n1p1\\\": 1, \\\"e4f6\\\": 1, \\\"5brn\\\": 1, \\\"rnbqk3\\\": 2, \\\"r2qk1nr\\\": 1, \\\"pppb1nb1\\\": 1, \\\"1rbqk2r\\\": 1, \\\"e8f7\\\": 6, \\\"1p2p1pp\\\": 7, \\\"3p2n1\\\": 4, \\\"p1n1k3\\\": 1, \\\"r1b1qbnr\\\": 2, \\\"p3np2\\\": 1, \\\"p2ppp1p\\\": 12, \\\"1pp3p1\\\": 6, \\\"2pppp1p\\\": 9, \\\"1p2pppp\\\": 15, \\\"1p3np1\\\": 3, \\\"p4pn1\\\": 2, \\\"1bp4p\\\": 1, \\\"1p1pppp1\\\": 8, \\\"a3b4\\\": 3, \\\"f6e5\\\": 2, \\\"3ppb2\\\": 3, \\\"n3b2p\\\": 1, \\\"ppp1p1p1\\\": 14, \\\"f8a3\\\": 3, \\\"ppnppp2\\\": 1, \\\"d5c4\\\": 8, \\\"n2q3p\\\": 1, \\\"1pppnp2\\\": 3, \\\"p1pppk1p\\\": 2, \\\"r1bq1b1r\\\": 7, \\\"e2e3\\\": 17, \\\"3ppq1p\\\": 2, \\\"5b1p\\\": 1, \\\"pppqppp1\\\": 5, \\\"f6b2\\\": 1, \\\"pppppnpp\\\": 3, \\\"3np1p1\\\": 1, \\\"pp1p1pp1\\\": 12, \\\"pq6\\\": 4, \\\"f4h5\\\": 3, \\\"3ppppp\\\": 20, \\\"n2p3q\\\": 1, \\\"h3h1\\\": 2, \\\"1ppnnp1p\\\": 1, \\\"pp1ppbp1\\\": 1, \\\"6np\\\": 5, \\\"rnbq1kr1\\\": 1, \\\"qp2p3\\\": 1, \\\"p1nppppp\\\": 1, \\\"c2a1\\\": 1, \\\"1ppp1pbp\\\": 3, \\\"a8b8\\\": 2, \\\"r1pppppp\\\": 3, \\\"1p5q\\\": 1, \\\"1p2pb2\\\": 1, \\\"h3f2\\\": 4, \\\"1pn2n2\\\": 2, \\\"1pb1p3\\\": 3, \\\"n1p2n2\\\": 2, \\\"3p2pn\\\": 5, \\\"h6f4\\\": 1, \\\"ppppkppp\\\": 4, \\\"e7e8\\\": 3, \\\"ppnp1ppp\\\": 1, \\\"p1pp1kp1\\\": 2, \\\"1p3n2\\\": 13, \\\"4p1pn\\\": 3, \\\"pbppp1pp\\\": 6, \\\"b2a1\\\": 1, \\\"f1b5\\\": 5, \\\"4ppq1\\\": 1, \\\"5ppn\\\": 2, \\\"5bpp\\\": 1, \\\"f6h8\\\": 1, \\\"q1p5\\\": 8, \\\"p1pbpp1n\\\": 1, \\\"p1ppkp1p\\\": 1, \\\"r3p2b\\\": 1, \\\"1pp4p\\\": 3, \\\"a6a3\\\": 1, \\\"ppq2ppp\\\": 2, \\\"2bp4\\\": 5, \\\"1p1p2pp\\\": 5, \\\"4p1b1\\\": 3, \\\"g5d8\\\": 3, \\\"1nb1kb1r\\\": 3, \\\"rpqppp1p\\\": 1, \\\"p4np1\\\": 4, \\\"p1ppbp1p\\\": 2, \\\"f5g3\\\": 1, \\\"2np3n\\\": 5, \\\"c6a5\\\": 1, \\\"r1bq1bn1\\\": 2, \\\"p1pkp1pr\\\": 1, \\\"np3p1p\\\": 1, \\\"1pb3p1\\\": 1, \\\"g5h7\\\": 1, \\\"1pn4n\\\": 3, \\\"p2p3n\\\": 3, \\\"h6g8\\\": 1, \\\"2np1np1\\\": 2, \\\"c3d5\\\": 2, \\\"nppppp1p\\\": 1, \\\"pp4p1\\\": 8, \\\"ppp1nppp\\\": 3, \\\"3pb3\\\": 6, \\\"rnq1kbnr\\\": 6, \\\"r1ppnp1p\\\": 1, \\\"2p2n1p\\\": 3, \\\"p2pqpp1\\\": 1, \\\"pbpppppp\\\": 7, \\\"pqpp1pbp\\\": 1, \\\"3b2p1\\\": 4, \\\"g3f2\\\": 1, \\\"p1qppppp\\\": 4, \\\"f5g4\\\": 9, \\\"2k5\\\": 1, \\\"ppqp1ppp\\\": 2, \\\"c6d7\\\": 1, \\\"pppnpppp\\\": 9, \\\"2p1np2\\\": 1, \\\"1p1k1p1p\\\": 1, \\\"r2pp3\\\": 1, \\\"2p2ppr\\\": 1, \\\"d3c4\\\": 2, \\\"n5pb\\\": 2, \\\"2p1p1pp\\\": 4, \\\"p1ppb1pp\\\": 1, \\\"rnb1qk1r\\\": 1, \\\"c6b4\\\": 6, \\\"1pppp1b1\\\": 1, \\\"1pp1ppp1\\\": 11, \\\"p1ppp3\\\": 5, \\\"c3a4\\\": 2, \\\"r3kbnr\\\": 8, \\\"2bppp2\\\": 1, \\\"pppp1kpp\\\": 6, \\\"rnb3nr\\\": 2, \\\"h8h5\\\": 1, \\\"p1p2ppp\\\": 11, \\\"1p1pp2n\\\": 1, \\\"1n4q1\\\": 1, \\\"b4p2\\\": 5, \\\"rpppp1p1\\\": 1, \\\"g5g3\\\": 1, \\\"r1bnkbnr\\\": 1, \\\"3q1p2\\\": 1, \\\"a5a6\\\": 1, \\\"p1n2pp1\\\": 2, \\\"1p2pn2\\\": 7, \\\"p1qp2pr\\\": 1, \\\"rnb1kb2\\\": 1, \\\"5np1\\\": 10, \\\"rqp5\\\": 1, \\\"1nbk1bnr\\\": 1, \\\"f5f4\\\": 1, \\\"2npp3\\\": 2, \\\"p1pq1ppp\\\": 1, \\\"a6b4\\\": 11, \\\"2n4p\\\": 15, \\\"d1h5\\\": 10, \\\"g6h7\\\": 2, \\\"rbb1kbnr\\\": 1, \\\"pp2ppp1\\\": 9, \\\"1qpp4\\\": 4, \\\"b5b2\\\": 1, \\\"p1pppk2\\\": 2, \\\"n1p3pp\\\": 2, \\\"7r\\\": 7, \\\"pp1npppp\\\": 3, \\\"2pp1b1q\\\": 1, \\\"rnb1qrk1\\\": 1, \\\"5bpn\\\": 1, \\\"1ppp4\\\": 10, \\\"6bp\\\": 4, \\\"p3ppp1\\\": 2, \\\"rn1qk1r1\\\": 1, \\\"bp4pn\\\": 2, \\\"3n2p1\\\": 2, \\\"ppp1p1pr\\\": 2, \\\"5p1b\\\": 4, \\\"p5b1\\\": 2, \\\"p2ppppr\\\": 1, \\\"npp5\\\": 3, \\\"3ppn2\\\": 3, \\\"1pn1p3\\\": 1, \\\"p1pppkpp\\\": 3, \\\"h7h6\\\": 5, \\\"2n1pnp1\\\": 1, \\\"pb3n2\\\": 1, \\\"ppq3pp\\\": 1, \\\"b4c6\\\": 2, \\\"ppnp3p\\\": 1, \\\"4ppp1\\\": 1, \\\"d8c7\\\": 2, \\\"f4e5\\\": 7, \\\"1pp3pp\\\": 4, \\\"p2n4\\\": 3, \\\"1ppn1p2\\\": 1, \\\"rn1k1b1r\\\": 1, \\\"pp1b1ppp\\\": 1, \\\"1q3n2\\\": 1, \\\"pnppp3\\\": 1, \\\"a5b6\\\": 1, \\\"n3b3\\\": 3, \\\"1p1bpq2\\\": 1, \\\"p1pnp1pp\\\": 1, \\\"2ppn1pp\\\": 2, \\\"1b2bp2\\\": 1, \\\"p2bpppp\\\": 2, \\\"pppbnpbp\\\": 1, \\\"rn1qk2r\\\": 2, \\\"pnp1pp2\\\": 1, \\\"1p1pk1pp\\\": 1, \\\"n2p1p2\\\": 2, \\\"2p1p1bp\\\": 1, \\\"1pp1b1pp\\\": 1, \\\"1ppp1kpp\\\": 4, \\\"3r3p\\\": 1, \\\"pp1n4\\\": 2, \\\"qk\\\": 6, \\\"d4b5\\\": 1, \\\"p3bppp\\\": 1, \\\"2b1kbnr\\\": 1, \\\"r1qppp1p\\\": 1, \\\"2ppp1pr\\\": 2, \\\"pn6\\\": 2, \\\"p1pqpp1p\\\": 1, \\\"b2h8\\\": 6, \\\"1np1p3\\\": 1, \\\"pp1pqpp1\\\": 2, \\\"1rb1kbnr\\\": 4, \\\"f8e7\\\": 2, \\\"pppkp1pp\\\": 4, \\\"pq5n\\\": 1, \\\"pp1q1pbp\\\": 1, \\\"g2a8\\\": 2, \\\"pppp2p1\\\": 9, \\\"4pp1p\\\": 5, \\\"pbppp1p1\\\": 1, \\\"d8h4\\\": 6, \\\"q4p2\\\": 1, \\\"1n2p1pp\\\": 1, \\\"a6a4\\\": 1, \\\"bpp5\\\": 2, \\\"p1qppnp1\\\": 1, \\\"a3c1\\\": 2, \\\"r1bk1bnr\\\": 5, \\\"1ppnpp2\\\": 2, \\\"p2q4\\\": 1, \\\"2b2ppn\\\": 1, \\\"pbppp2p\\\": 1, \\\"b2c3\\\": 1, \\\"r1bq1knr\\\": 3, \\\"f4e3\\\": 4, \\\"rnb2b1r\\\": 2, \\\"2pp3n\\\": 2, \\\"pqp5\\\": 1, \\\"rp1pppp1\\\": 2, \\\"1nb1kbnr\\\": 3, \\\"np2p3\\\": 3, \\\"p2b1pp1\\\": 1, \\\"a5b7\\\": 1, \\\"3bp3\\\": 3, \\\"1p1kppp1\\\": 1, \\\"p3p1pp\\\": 5, \\\"1ppp1p2\\\": 3, \\\"p1pnpp1p\\\": 1, \\\"rppp1ppp\\\": 2, \\\"1nbqkbr1\\\": 2, \\\"d4c6\\\": 3, \\\"ppp1bpp1\\\": 1, \\\"pppqpp1r\\\": 1, \\\"r1b1kb2\\\": 1, \\\"5nk1\\\": 1, \\\"pp1pp3\\\": 6, \\\"1q3p1p\\\": 2, \\\"p2n3p\\\": 1, \\\"r1ppppp1\\\": 2, \\\"1rp1pp2\\\": 1, \\\"q6b\\\": 1, \\\"d4c3\\\": 1, \\\"1n2p3\\\": 2, \\\"c1d2\\\": 3, \\\"5ppp\\\": 7, \\\"2n3n1\\\": 1, \\\"n4n2\\\": 11, \\\"n3pn2\\\": 2, \\\"f3e5\\\": 4, \\\"1b1p4\\\": 2, \\\"2n1bp2\\\": 1, \\\"1p1pn3\\\": 2, \\\"pp3q2\\\": 2, \\\"f8d6\\\": 2, \\\"1rppp1p1\\\": 1, \\\"p4p1n\\\": 5, \\\"rppp3p\\\": 1, \\\"kk\\\": 8, \\\"h3f4\\\": 3, \\\"rppppppp\\\": 4, \\\"p5pp\\\": 12, \\\"rppp1k2\\\": 1, \\\"1nbq1bnr\\\": 4, \\\"1p1pp1pp\\\": 12, \\\"b5p1\\\": 2, \\\"3pp1b1\\\": 1, \\\"d1d3\\\": 2, \\\"1qn2n2\\\": 1, \\\"p1pp1ppr\\\": 3, \\\"2ppbn2\\\": 2, \\\"1p3pn1\\\": 1, \\\"1qp1p3\\\": 3, \\\"b4n2\\\": 2, \\\"g5f6\\\": 2, \\\"np1p4\\\": 1, \\\"qn6\\\": 1, \\\"c6b5\\\": 4, \\\"2p4r\\\": 4, \\\"p3n2p\\\": 2, \\\"n2b4\\\": 1, \\\"p3p2q\\\": 3, \\\"np5p\\\": 2, \\\"rnb1kr2\\\": 1, \\\"ppppqpbp\\\": 1, \\\"p1q5\\\": 2, \\\"2n3pp\\\": 3, \\\"npp1pppp\\\": 1, \\\"1q3p2\\\": 1, \\\"p2ppkp1\\\": 1, \\\"e4c3\\\": 2, \\\"2pbpp2\\\": 1, \\\"g6f7\\\": 1, \\\"1rbq1bnr\\\": 3, \\\"2n1kp1p\\\": 1, \\\"4p2q\\\": 4, \\\"n2p1n2\\\": 4, \\\"ppp3pp\\\": 5, \\\"pp2b1pp\\\": 1, \\\"2nb3n\\\": 1, \\\"1pp2p2\\\": 6, \\\"c5b6\\\": 3, \\\"ppppnp1p\\\": 2, \\\"1qp2n2\\\": 1, \\\"pb1ppppp\\\": 1, \\\"1pppp3\\\": 4, \\\"p5pn\\\": 5, \\\"1ppp1kp1\\\": 1, \\\"6bn\\\": 1, \\\"pp2pp2\\\": 4, \\\"h5g3\\\": 1, \\\"ppb1p3\\\": 2, \\\"1b6\\\": 7, \\\"2pp1p1n\\\": 1, \\\"pp1np1pp\\\": 2, \\\"b4e7\\\": 2, \\\"1n3p2\\\": 4, \\\"a6b5\\\": 2, \\\"n2pp3\\\": 1, \\\"e8e7\\\": 1, \\\"p2pnk1p\\\": 1, \\\"pnppp1p1\\\": 1, \\\"rp1ppp1p\\\": 3, \\\"2p1n1p1\\\": 2, \\\"p2ppp1r\\\": 2, \\\"e4g5\\\": 2, \\\"2ppppbp\\\": 1, \\\"pp2pppr\\\": 2, \\\"2pp1n1p\\\": 1, \\\"1qp2np1\\\": 1, \\\"b1n2n2\\\": 2, \\\"p2ppkpp\\\": 3, \\\"1n1qkbnr\\\": 5, \\\"1bpppppq\\\": 1, \\\"1p1bnpp1\\\": 1, \\\"1pp1n3\\\": 1, \\\"pp2pq2\\\": 1, \\\"1b1p1ppp\\\": 2, \\\"p1q2p2\\\": 1, \\\"rpppp3\\\": 1, \\\"c3e5\\\": 1, \\\"2n1p1p1\\\": 3, \\\"ppppk2p\\\": 1, \\\"c4a3\\\": 2, \\\"2pp1n2\\\": 1, \\\"1pppqppp\\\": 2, \\\"4q2b\\\": 1, \\\"r2k1b1r\\\": 1, \\\"1bp1p3\\\": 2, \\\"pp1pkppp\\\": 4, \\\"r1bq1b2\\\": 1, \\\"pppkp1pr\\\": 1, \\\"n2p3b\\\": 1, \\\"2pqp2p\\\": 2, \\\"pp1k1ppp\\\": 2, \\\"2p1pq1n\\\": 1, \\\"1p1pp3\\\": 15, \\\"h4e4\\\": 2, \\\"1p1r1n2\\\": 1, \\\"p5np\\\": 2, \\\"r3kb1r\\\": 2, \\\"f6d5\\\": 1, \\\"1ppq1ppp\\\": 1, \\\"rpp1pp1p\\\": 2, \\\"1n1qkb1r\\\": 2, \\\"r2qkbn1\\\": 4, \\\"g4h2\\\": 1, \\\"2p1b3\\\": 2, \\\"d4d5\\\": 6, \\\"pp1bpp1p\\\": 1, \\\"2ppp1pp\\\": 8, \\\"b3\\\": 1, \\\"a4b3\\\": 2, \\\"1b3p2\\\": 1, \\\"rnbnkb1r\\\": 1, \\\"4bp1n\\\": 1, \\\"p2p1b1p\\\": 1, \\\"1p4pp\\\": 6, \\\"2n2q2\\\": 1, \\\"2ppp1bp\\\": 1, \\\"pppp1k2\\\": 2, \\\"1pp1n2p\\\": 1, \\\"p6b\\\": 5, \\\"1pbpp1pp\\\": 2, \\\"1p2np2\\\": 3, \\\"3bp2n\\\": 1, \\\"1n5p\\\": 4, \\\"b7b6\\\": 1, \\\"2p1pp2\\\": 8, \\\"p1n4p\\\": 2, \\\"pppp2b1\\\": 1, \\\"c8a6\\\": 2, \\\"1p3p1n\\\": 2, \\\"1bppppp1\\\": 2, \\\"2np1p2\\\": 5, \\\"5pb1\\\": 3, \\\"n2p2p1\\\": 2, \\\"pppqp2p\\\": 1, \\\"r1bk2nr\\\": 1, \\\"2pqpppp\\\": 1, \\\"b2b4\\\": 2, \\\"rnq1k1nr\\\": 1, \\\"h3g2\\\": 5, \\\"p1pbp1p1\\\": 1, \\\"d7g4\\\": 3, \\\"p1p1p1p1\\\": 7, \\\"p1ppnkpp\\\": 1, \\\"1pp1b2p\\\": 1, \\\"3ppp1n\\\": 1, \\\"rnbk1b1r\\\": 5, \\\"bp5p\\\": 1, \\\"1ppppp1r\\\": 1, \\\"p3p2n\\\": 5, \\\"p1b5\\\": 2, \\\"r1bqk1r1\\\": 1, \\\"n3p2n\\\": 2, \\\"1p4b1\\\": 3, \\\"2pp1p1p\\\": 4, \\\"n1p1p1p1\\\": 1, \\\"n4p1p\\\": 3, \\\"pppp1qpp\\\": 1, \\\"2k2p1n\\\": 1, \\\"f7d5\\\": 1, \\\"r4p1p\\\": 1, \\\"p2q1p2\\\": 1, \\\"e5f4\\\": 8, \\\"2bp2p1\\\": 1, \\\"1p1b4\\\": 2, \\\"1p1pn1pp\\\": 1, \\\"pp1pppbp\\\": 2, \\\"ppqppp1p\\\": 2, \\\"h6f8\\\": 4, \\\"2p1k2p\\\": 1, \\\"3pn3\\\": 2, \\\"1p3ppp\\\": 6, \\\"d8e8\\\": 2, \\\"pp1ppkp1\\\": 1, \\\"n1p2p1p\\\": 2, \\\"2n2p1p\\\": 6, \\\"p1nb3p\\\": 1, \\\"2qp1pp1\\\": 1, \\\"c2d3\\\": 1, \\\"pbpp1ppp\\\": 1, \\\"5q2\\\": 4, \\\"1b5p\\\": 2, \\\"4pp1r\\\": 2, \\\"3b1n2\\\": 1, \\\"b7a8\\\": 1, \\\"np2p1p1\\\": 2, \\\"rnbqkr2\\\": 1, \\\"2ppq3\\\": 1, \\\"e3d4\\\": 2, \\\"pp2p1pn\\\": 1, \\\"pppbp2p\\\": 1, \\\"n2p1pp1\\\": 1, \\\"ppp3b1\\\": 1, \\\"p1ppqpp1\\\": 1, \\\"1pq1ppp1\\\": 2, \\\"p1n4n\\\": 2, \\\"3p1b1p\\\": 1, \\\"c6b8\\\": 1, \\\"pppppkpp\\\": 7, \\\"d2d3\\\": 6, \\\"q2p1p2\\\": 1, \\\"pn5p\\\": 4, \\\"ppq1pppp\\\": 2, \\\"2n1n2p\\\": 1, \\\"e3f1\\\": 1, \\\"p2p1n2\\\": 3, \\\"a6a5\\\": 1, \\\"p2pbp2\\\": 1, \\\"c4d5\\\": 10, \\\"1r1pppp1\\\": 1, \\\"1pp1qp1p\\\": 1, \\\"h6h8\\\": 1, \\\"1p1p1pp1\\\": 3, \\\"e5e4\\\": 5, \\\"r2ppp1p\\\": 1, \\\"p1p3pn\\\": 3, \\\"n1pb3p\\\": 1, \\\"pp1p1p2\\\": 5, \\\"d3e2\\\": 1, \\\"pppp1kp1\\\": 4, \\\"pp1ppkb1\\\": 1, \\\"f8c5\\\": 3, \\\"ppp2qp1\\\": 1, \\\"5pbp\\\": 2, \\\"1pn2p1r\\\": 1, \\\"3p2pr\\\": 1, \\\"pb2pp1n\\\": 1, \\\"b5e2\\\": 2, \\\"2p1pnpp\\\": 1, \\\"p1np4\\\": 2, \\\"p1ppbppp\\\": 3, \\\"1p1q2pp\\\": 1, \\\"p1pppp2\\\": 8, \\\"3qp2n\\\": 1, \\\"a4a5\\\": 1, \\\"pp1ppkpp\\\": 3, \\\"pppnpk1p\\\": 1, \\\"p2pbp1p\\\": 2, \\\"p2pp1pr\\\": 1, \\\"1p2p2n\\\": 2, \\\"pbpp1kpp\\\": 1, \\\"rn2qb1r\\\": 1, \\\"4p1pp\\\": 4, \\\"3pnb2\\\": 1, \\\"a8a6\\\": 1, \\\"1nbq1knr\\\": 1, \\\"rppp1pbp\\\": 1, \\\"1pnp4\\\": 5, \\\"d1d2\\\": 1, \\\"pppnppp1\\\": 2, \\\"b1d2\\\": 1, \\\"1p1n1b2\\\": 1, \\\"d5c3\\\": 1, \\\"1pn3p1\\\": 3, \\\"pppppp1n\\\": 1, \\\"1p5r\\\": 1, \\\"2n1p2n\\\": 3, \\\"h6f5\\\": 1, \\\"ppp1n1pp\\\": 1, \\\"n1p2p2\\\": 2, \\\"h3g4\\\": 5, \\\"2bppn2\\\": 1, \\\"p1p1qpp1\\\": 1, \\\"f4e2\\\": 1, \\\"1bp5\\\": 1, \\\"p2pnppp\\\": 1, \\\"rp1kpnpp\\\": 1, \\\"1nb2b1r\\\": 1, \\\"3pbp2\\\": 1, \\\"3p1p1b\\\": 1, \\\"1ppkp2p\\\": 1, \\\"3p1np1\\\": 1, \\\"pbp3p1\\\": 1, \\\"3b1p2\\\": 3, \\\"p1pppnp1\\\": 1, \\\"f2d3\\\": 1, \\\"p1n1pp2\\\": 2, \\\"pp1kpp1r\\\": 1, \\\"rnbq1bn1\\\": 5, \\\"b3p3\\\": 4, \\\"np2p1q1\\\": 1, \\\"rpppp2p\\\": 1, \\\"6b1\\\": 10, \\\"d1g4\\\": 3, \\\"3q2b1\\\": 1, \\\"1qpbp2p\\\": 1, \\\"1rb1k1nr\\\": 1, \\\"q3p1n1\\\": 1, \\\"pp1pn1pp\\\": 2, \\\"p3pnpp\\\": 1, \\\"n1pb4\\\": 1, \\\"qp1p1p2\\\": 1, \\\"2pp3b\\\": 1, \\\"q2p3n\\\": 1, \\\"3p2pb\\\": 3, \\\"h3c8\\\": 1, \\\"bp2p3\\\": 3, \\\"p2pbppp\\\": 1, \\\"rn1k2nr\\\": 1, \\\"np3pp1\\\": 1, \\\"p1ppb2p\\\": 1, \\\"ppp2p1r\\\": 1, \\\"2pppp2\\\": 5, \\\"r1bq3r\\\": 1, \\\"p1n2p2\\\": 5, \\\"c5g1\\\": 1, \\\"1pqppp1p\\\": 1, \\\"1p1ppk1p\\\": 3, \\\"n4p1n\\\": 1, \\\"h6f7\\\": 1, \\\"pp3bp1\\\": 1, \\\"2p1p2p\\\": 9, \\\"1pp1pnp1\\\": 2, \\\"2pbp3\\\": 1, \\\"p3pp1p\\\": 5, \\\"1p1pb1p1\\\": 1, \\\"2p1pp1p\\\": 8, \\\"pp2pppb\\\": 1, \\\"rp2pppp\\\": 1, \\\"p2q1p1b\\\": 1, \\\"h5g7\\\": 1, \\\"ppppqpp1\\\": 2, \\\"5k2\\\": 1, \\\"1ppppkpp\\\": 2, \\\"pp3p2\\\": 7, \\\"2pn2pp\\\": 1, \\\"1ppbpppp\\\": 2, \\\"r1nqkb1r\\\": 1, \\\"4ppb1\\\": 1, \\\"n4q2\\\": 1, \\\"r1b2bnr\\\": 2, \\\"g4f3\\\": 3, \\\"ppppq1pp\\\": 1, \\\"3k1p2\\\": 1, \\\"e7d6\\\": 1, \\\"q5pp\\\": 2, \\\"2ppppbq\\\": 1, \\\"h2g2\\\": 1, \\\"2qppppp\\\": 1, \\\"pppk1ppp\\\": 4, \\\"ppqppppp\\\": 3, \\\"c7f4\\\": 1, \\\"4b2p\\\": 2, \\\"g2h3\\\": 1, \\\"p3nppp\\\": 1, \\\"1p1pp2b\\\": 1, \\\"h6e3\\\": 2, \\\"p1pq1pp1\\\": 1, \\\"r1n2p1p\\\": 1, \\\"a3a1\\\": 3, \\\"1p2q3\\\": 1, \\\"1q1p3n\\\": 1, \\\"np2pppp\\\": 2, \\\"p2kpp2\\\": 1, \\\"d6c5\\\": 1, \\\"r1bqkb2\\\": 5, \\\"pppp1ppr\\\": 3, \\\"1b2p2p\\\": 2, \\\"c4e5\\\": 2, \\\"6pr\\\": 1, \\\"4pnp1\\\": 4, \\\"p1pkppp1\\\": 2, \\\"rnq2bnr\\\": 2, \\\"c6d4\\\": 2, \\\"r1p3p1\\\": 1, \\\"ppp2pnp\\\": 1, \\\"p2pppb1\\\": 1, \\\"d3d4\\\": 5, \\\"rp1pp2p\\\": 1, \\\"2qp1b2\\\": 1, \\\"3b1pp1\\\": 2, \\\"1p1bpp2\\\": 1, \\\"p1qp2pp\\\": 1, \\\"2pb1p2\\\": 1, \\\"e5d6\\\": 1, \\\"rnb1kbn1\\\": 2, \\\"p3pppr\\\": 2, \\\"qpp4p\\\": 1, \\\"pb1p3p\\\": 1, \\\"4b1p1\\\": 1, \\\"pp1ppppr\\\": 5, \\\"g4f6\\\": 1, \\\"ppnpp1p1\\\": 1, \\\"d4f5\\\": 1, \\\"3q3p\\\": 3, \\\"pp1kppp1\\\": 1, \\\"1pnp2p1\\\": 2, \\\"p2p3r\\\": 1, \\\"pppkpp1p\\\": 1, \\\"p1p1p1pp\\\": 6, \\\"pppppkb1\\\": 1, \\\"ppppb1pp\\\": 2, \\\"qp6\\\": 4, \\\"q1p3pp\\\": 1, \\\"r1pppp1p\\\": 6, \\\"b4a5\\\": 2, \\\"1bqp1p2\\\": 1, \\\"4kp1p\\\": 1, \\\"p1p3p1\\\": 7, \\\"h6h5\\\": 4, \\\"1q1p4\\\": 2, \\\"2p1n3\\\": 1, \\\"p1p1n3\\\": 2, \\\"n2bpp1p\\\": 1, \\\"f1d3\\\": 1, \\\"1n4p1\\\": 2, \\\"2pqpp1p\\\": 2, \\\"d8f6\\\": 3, \\\"h1h4\\\": 1, \\\"a4c3\\\": 1, \\\"pp1pbppp\\\": 2, \\\"ppppnppp\\\": 1, \\\"ppppbp1p\\\": 1, \\\"2nbp3\\\": 1, \\\"d1a4\\\": 2, \\\"1ppppppr\\\": 1, \\\"p1pn1ppp\\\": 1, \\\"1p1n1p2\\\": 3, \\\"p2b2k1\\\": 1, \\\"d5f6\\\": 1, \\\"np1q4\\\": 1, \\\"pppqkppp\\\": 1, \\\"pppbp3\\\": 1, \\\"1bpp1ppp\\\": 1, \\\"1pppppbp\\\": 2, \\\"p3b3\\\": 2, \\\"e6b3\\\": 1, \\\"pp5q\\\": 1, \\\"1bpp2pp\\\": 1, \\\"6nq\\\": 1, \\\"h5g5\\\": 1, \\\"r6n\\\": 2, \\\"n2qpp2\\\": 1, \\\"pb6\\\": 4, \\\"3n3q\\\": 1, \\\"rpppp1bp\\\": 1, \\\"h4d4\\\": 1, \\\"1n1p1b2\\\": 1, \\\"bp3np1\\\": 1, \\\"2rqkb1r\\\": 1, \\\"p1pp1n2\\\": 2, \\\"pppq1pbp\\\": 1, \\\"4p2b\\\": 3, \\\"2pnpp1p\\\": 3, \\\"1b3pp1\\\": 1, \\\"pp1ppnbp\\\": 1, \\\"c5e4\\\": 2, \\\"ppppqp1p\\\": 3, \\\"3pp1bp\\\": 1, \\\"c8e6\\\": 3, \\\"ppppn2p\\\": 1, \\\"4pppb\\\": 1, \\\"2n4b\\\": 1, \\\"f6g5\\\": 6, \\\"1p1p3r\\\": 1, \\\"1pp1pn2\\\": 1, \\\"3b1np1\\\": 1, \\\"rnbq3r\\\": 3, \\\"e4f5\\\": 1, \\\"pp3ppp\\\": 3, \\\"pbp1p1p1\\\": 1, \\\"2b1p1p1\\\": 1, \\\"2p3q1\\\": 2, \\\"g3g2\\\": 1, \\\"n2p3p\\\": 3, \\\"2q2p2\\\": 1, \\\"1pq3pp\\\": 1, \\\"r4pp1\\\": 1, \\\"1pb5\\\": 2, \\\"2n1pq2\\\": 1, \\\"c4f7\\\": 1, \\\"ppppp1bp\\\": 2, \\\"pppnp1p1\\\": 1, \\\"c1g5\\\": 2, \\\"2ppnppp\\\": 1, \\\"1p1n4\\\": 2, \\\"p1p1ppb1\\\": 1, \\\"g2h1\\\": 2, \\\"2bqk2r\\\": 2, \\\"r1ppnppp\\\": 1, \\\"p1nb4\\\": 1, \\\"pp4bp\\\": 1, \\\"2qpp2p\\\": 1, \\\"1p1b3b\\\": 1, \\\"1qp2n1p\\\": 1, \\\"1ppq1p2\\\": 1, \\\"d3f5\\\": 1, \\\"2n2np1\\\": 1, \\\"q6n\\\": 1, \\\"a3a8\\\": 1, \\\"p1p1npp1\\\": 2, \\\"1r6\\\": 1, \\\"e7d5\\\": 1, \\\"2b1p1pp\\\": 1, \\\"p1pp1p2\\\": 8, \\\"pppk2pp\\\": 1, \\\"rp3p2\\\": 1, \\\"d7e8\\\": 1, \\\"p1ppp2r\\\": 3, \\\"p1ppbp2\\\": 1, \\\"a4b2\\\": 1, \\\"n4ppn\\\": 1, \\\"pp1k1p1p\\\": 1, \\\"n1pp2p1\\\": 1, \\\"ppp1qppp\\\": 2, \\\"e5d4\\\": 5, \\\"1p1b1p2\\\": 1, \\\"p2pp1kp\\\": 1, \\\"c3d4\\\": 2, \\\"pp1p2p1\\\": 7, \\\"p1n1pn2\\\": 1, \\\"pp1ppn1p\\\": 1, \\\"b5a6\\\": 1, \\\"b4a6\\\": 1, \\\"rn1qkb2\\\": 2, \\\"f4b4\\\": 1, \\\"p1pppr2\\\": 1, \\\"rp1pp3\\\": 3, \\\"rpp1pppp\\\": 3, \\\"2pppkp1\\\": 1, \\\"3p1ppn\\\": 1, \\\"4r3\\\": 1, \\\"2ppkppn\\\": 1, \\\"h1h2\\\": 1, \\\"2p1p2q\\\": 1, \\\"pp1qpppp\\\": 2, \\\"a3c2\\\": 1, \\\"2rpppp1\\\": 1, \\\"2p1pk1p\\\": 1, \\\"rnbq1nnr\\\": 1, \\\"1pnp2pn\\\": 1, \\\"3r2p1\\\": 1, \\\"1p1p1n2\\\": 1, \\\"np1pp1pr\\\": 1, \\\"a8a7\\\": 1, \\\"ppp1b1pp\\\": 1, \\\"3qpp2\\\": 1, \\\"d8d5\\\": 1, \\\"nn1ppp2\\\": 1, \\\"1p3q2\\\": 2, \\\"p2p1b2\\\": 3, \\\"3bppp1\\\": 1, \\\"bp3q2\\\": 1, \\\"2pq1p2\\\": 1, \\\"q1p1p3\\\": 2, \\\"3p2q1\\\": 2, \\\"ppp1bppp\\\": 2, \\\"n4nr1\\\": 1, \\\"p2p3b\\\": 1, \\\"3qkbnr\\\": 3, \\\"g3h1\\\": 1, \\\"r1bq1br1\\\": 1, \\\"p1pkpppp\\\": 4, \\\"np2pp2\\\": 2, \\\"pppq3p\\\": 1, \\\"g2g4\\\": 1, \\\"p2ppp1n\\\": 1, \\\"1pp3pb\\\": 1, \\\"h2h4\\\": 1, \\\"3qp1p1\\\": 1, \\\"pbpp1p1p\\\": 2, \\\"d3d5\\\": 1, \\\"2p2pn1\\\": 1, \\\"rnbqk1r1\\\": 4, \\\"d1e2\\\": 1, \\\"rn1k1bnr\\\": 1, \\\"5bp1\\\": 1, \\\"1r3q2\\\": 1, \\\"1nb1k1nr\\\": 1, \\\"f3f5\\\": 1, \\\"ppppb2p\\\": 1, \\\"pbppppb1\\\": 1, \\\"p1p2ppr\\\": 1, \\\"g5h6\\\": 1, \\\"2n1b1p1\\\": 1, \\\"q1p2p2\\\": 1, \\\"3n1p2\\\": 1, \\\"pp1pk1pr\\\": 1, \\\"1pp1ppbp\\\": 1, \\\"g3g4\\\": 2, \\\"2ppkppp\\\": 1, \\\"b2p4\\\": 1, \\\"3q1n2\\\": 1, \\\"5npp\\\": 2, \\\"ppp1q1pp\\\": 1, \\\"3pqp2\\\": 1, \\\"4q3\\\": 2, \\\"b2pp3\\\": 1, \\\"q6p\\\": 3, \\\"a4c2\\\": 1, \\\"b4p1p\\\": 1, \\\"1p4q1\\\": 2, \\\"nppppp2\\\": 1, \\\"pb4p1\\\": 1, \\\"pp5n\\\": 3, \\\"h5h3\\\": 1, \\\"pppb1p2\\\": 1, \\\"b1np4\\\": 1, \\\"a3f8\\\": 1, \\\"pppppn2\\\": 1, \\\"f2d1\\\": 1, \\\"rnb1k3\\\": 1, \\\"ppppqppr\\\": 1, \\\"2bn4\\\": 1, \\\"1p1qp1p1\\\": 1, \\\"e3\\\": 1, \\\"1n5r\\\": 1, \\\"1p1n3b\\\": 1, \\\"2p2q1n\\\": 1, \\\"rp1p1ppp\\\": 2, \\\"p4p1b\\\": 1, \\\"qn2n3\\\": 1, \\\"r2k1bnr\\\": 1, \\\"a5a4\\\": 1, \\\"npp2np1\\\": 1, \\\"q1p1p1p1\\\": 1, \\\"3p1n1p\\\": 1, \\\"p1pqpp2\\\": 2, \\\"p1pn4\\\": 1, \\\"pp1n1ppp\\\": 1, \\\"1b1n1ppp\\\": 1, \\\"3pp2n\\\": 1, \\\"pq1p1ppp\\\": 1, \\\"2nq4\\\": 2, \\\"1p1pp1bp\\\": 2, \\\"p1p2ppn\\\": 1, \\\"ppppp1b1\\\": 2, \\\"g5e4\\\": 2, \\\"2n2pb1\\\": 1, \\\"rpp1p1pp\\\": 1, \\\"rppp1pp1\\\": 1, \\\"2pn1p1p\\\": 1, \\\"pbnpppp1\\\": 1, \\\"e2h5\\\": 1, \\\"2n3pb\\\": 2, \\\"ppp1ppbp\\\": 2, \\\"n5pp\\\": 1, \\\"a6d3\\\": 1, \\\"pppbkpp1\\\": 1, \\\"rn1q1b1r\\\": 2, \\\"2p3b1\\\": 2, \\\"2np3p\\\": 3, \\\"r1q1kbnr\\\": 1, \\\"bp6\\\": 4, \\\"pbp1pppp\\\": 2, \\\"p2kpppp\\\": 1, \\\"1pn1b3\\\": 1, \\\"1q2p3\\\": 1, \\\"4n2p\\\": 6, \\\"d2e3\\\": 2, \\\"n4bp1\\\": 1, \\\"b4pp1\\\": 1, \\\"r1p2n2\\\": 1, \\\"f7g6\\\": 1, \\\"1n3p1p\\\": 2, \\\"p1b4p\\\": 1, \\\"1bppp1p1\\\": 2, \\\"n4np1\\\": 1, \\\"r2qk2r\\\": 1, \\\"1n3ppp\\\": 1, \\\"1pn4b\\\": 1, \\\"c3d1\\\": 1, \\\"pppp2bp\\\": 1, \\\"1n2p1p1\\\": 1, \\\"p1qp4\\\": 1, \\\"pb1pppp1\\\": 1, \\\"n3b2n\\\": 1, \\\"pq1ppppp\\\": 1, \\\"f3d4\\\": 2, \\\"pppkppp1\\\": 1, \\\"nr5n\\\": 1, \\\"p1ppqp1p\\\": 2, \\\"2b1kb1r\\\": 1, \\\"1pppq2p\\\": 3, \\\"3p2np\\\": 3, \\\"np1qp3\\\": 1, \\\"p1p2pp1\\\": 3, \\\"f2f3\\\": 1, \\\"1p2bp1n\\\": 1, \\\"1pn3pn\\\": 1, \\\"p1qkpp1p\\\": 1, \\\"r1b2b1r\\\": 1, \\\"2n2bpn\\\": 1, \\\"r1bqkr2\\\": 1, \\\"5nn1\\\": 1, \\\"g6h8\\\": 1, \\\"3qp3\\\": 1, \\\"d4h8\\\": 1, \\\"pppppk1p\\\": 2, \\\"n2ppq2\\\": 1, \\\"pp1bpppp\\\": 2, \\\"c4d6\\\": 1, \\\"1pp4n\\\": 5, \\\"c1e3\\\": 1, \\\"p1p2p1n\\\": 2, \\\"4p1r1\\\": 1, \\\"h7f6\\\": 1, \\\"n2p1q1n\\\": 1, \\\"rpppp2r\\\": 1, \\\"f6h4\\\": 1, \\\"3np3\\\": 3, \\\"ppp1pp1q\\\": 1, \\\"1qnp4\\\": 1, \\\"h7h8\\\": 2, \\\"1qp4p\\\": 1, \\\"1bppk1pp\\\": 1, \\\"3ppq2\\\": 1, \\\"p2pp1b1\\\": 1, \\\"2n2p1b\\\": 1, \\\"rn1qkbr1\\\": 4, \\\"3qpn1p\\\": 1, \\\"n1p2pp1\\\": 1, \\\"q2p3p\\\": 1, \\\"r2ppppp\\\": 2, \\\"f1c4\\\": 1, \\\"pq3p1p\\\": 1, \\\"1bppbppp\\\": 1, \\\"q4pp1\\\": 1, \\\"p2ppk1p\\\": 1, \\\"b3a4\\\": 1, \\\"pppbp1pp\\\": 1, \\\"pbpp1pp1\\\": 1, \\\"1p2p1np\\\": 1, \\\"pnp5\\\": 2, \\\"r4p2\\\": 2, \\\"n1p4p\\\": 1, \\\"1p1pkp2\\\": 1, \\\"1bpp1p1p\\\": 1, \\\"r5n1\\\": 1, \\\"pp2p1b1\\\": 1, \\\"d8g5\\\": 1, \\\"nqp5\\\": 2, \\\"2pq3n\\\": 1, \\\"p1bn4\\\": 1, \\\"b5c3\\\": 1, \\\"d8a5\\\": 3, \\\"p1n1pq2\\\": 1, \\\"1ppp1ppr\\\": 1, \\\"rpp2p1p\\\": 1, \\\"p1pnpppp\\\": 2, \\\"d6b4\\\": 1, \\\"p1q1pp1p\\\": 1, \\\"1pppn1p1\\\": 2, \\\"p1ppn2p\\\": 1, \\\"1p2n1p1\\\": 1, \\\"e6d8\\\": 1, \\\"ppnbpp1p\\\": 1, \\\"pp1n1pp1\\\": 1, \\\"rnbk2nr\\\": 3, \\\"2ppn1p1\\\": 1, \\\"1p1b1p1p\\\": 1, \\\"nppp1pp1\\\": 1, \\\"a2c1\\\": 2, \\\"4pq1b\\\": 1, \\\"f3d1\\\": 1, \\\"1r2p3\\\": 1, \\\"r3n3\\\": 1, \\\"a5a7\\\": 1, \\\"1bp1pppp\\\": 1, \\\"3b3n\\\": 4, \\\"p1nq3p\\\": 1, \\\"1pp1np1p\\\": 1, \\\"e5f3\\\": 1, \\\"3pbppp\\\": 3, \\\"h5e2\\\": 1, \\\"1p2p2b\\\": 1, \\\"1q4qp\\\": 1, \\\"g3b3\\\": 1, \\\"2npbp1p\\\": 1, \\\"3ppp1r\\\": 1, \\\"1ppbpp2\\\": 1, \\\"p2p1qpp\\\": 1, \\\"np2p2p\\\": 1, \\\"f5d5\\\": 1, \\\"5p1q\\\": 2, \\\"h4e7\\\": 1, \\\"pppkb1pp\\\": 1, \\\"h1g1\\\": 1, \\\"p3pp1b\\\": 1, \\\"pp1npp2\\\": 1, \\\"g3f4\\\": 2, \\\"2pp3p\\\": 5, \\\"n5q1\\\": 1, \\\"4pp1b\\\": 1, \\\"1pqppp2\\\": 1, \\\"p1ppbpp1\\\": 1, \\\"2n1p2r\\\": 1, \\\"q3pp2\\\": 1, \\\"3r4\\\": 1, \\\"d3g3\\\": 1, \\\"2ppb3\\\": 1, \\\"a2b2\\\": 1, \\\"1r1q1bnr\\\": 1, \\\"h6d2\\\": 1, \\\"pppbpp1p\\\": 2, \\\"p1n2n1b\\\": 1, \\\"1pn2p1b\\\": 1, \\\"g7h6\\\": 2, \\\"pp1pnb2\\\": 1, \\\"r1p1ppp1\\\": 1, \\\"1p2p1n1\\\": 2, \\\"p2pkpp1\\\": 1, \\\"ppppp2n\\\": 1, \\\"n6b\\\": 2, \\\"bp5n\\\": 2, \\\"qpp5\\\": 4, \\\"a6b7\\\": 2, \\\"1pppqpp1\\\": 2, \\\"a6\\\": 1, \\\"1qp5\\\": 3, \\\"b6b4\\\": 2, \\\"5p1r\\\": 1, \\\"1npp2pp\\\": 1, \\\"h5h6\\\": 2, \\\"pp2n3\\\": 1, \\\"1pnp1p2\\\": 1, \\\"ppq1b2p\\\": 1, \\\"1n3pq1\\\": 1, \\\"g4d1\\\": 5, \\\"b2pb3\\\": 1, \\\"c5a6\\\": 1, \\\"p2pp1bp\\\": 2, \\\"d7c6\\\": 1, \\\"np1ppp1p\\\": 1, \\\"1p1nkppp\\\": 1, \\\"1p1p1kpp\\\": 1, \\\"d7c5\\\": 1, \\\"ppppkp1p\\\": 2, \\\"r4np1\\\": 2, \\\"3ppnpp\\\": 1, \\\"c8f5\\\": 1, \\\"2p1pn2\\\": 1, \\\"ppn1qpp1\\\": 1, \\\"ppp1np1p\\\": 1, \\\"1pn4p\\\": 2, \\\"1b1pp3\\\": 1, \\\"3p2bn\\\": 1, \\\"1p2bpp1\\\": 1, \\\"pp1pnpp1\\\": 1, \\\"p1p2pn1\\\": 1, \\\"pp1kpppp\\\": 1, \\\"2pn4\\\": 2, \\\"pp1p2n1\\\": 1, \\\"h3f1\\\": 1, \\\"r1b1k2r\\\": 2, \\\"np2p2n\\\": 1, \\\"1b2p2q\\\": 1, \\\"5n1r\\\": 1, \\\"p2n3r\\\": 1, \\\"r4n2\\\": 2, \\\"pp1pqppp\\\": 1, \\\"pp1pp1qp\\\": 1, \\\"g7h8\\\": 1, \\\"1pn2qp1\\\": 1, \\\"p2pb3\\\": 2, \\\"rpppp1pp\\\": 2, \\\"3p1q2\\\": 3, \\\"2b3p1\\\": 1, \\\"ppp1qp1p\\\": 1, \\\"rnk2bnr\\\": 1, \\\"d4e2\\\": 1, \\\"bp1p2p1\\\": 1, \\\"p2p3q\\\": 1, \\\"2pkp1pp\\\": 1, \\\"p1pq4\\\": 1, \\\"pp2kppp\\\": 2, \\\"pp1qppp1\\\": 1, \\\"pp2p2r\\\": 2, \\\"p1pbp1pp\\\": 4, \\\"2bpp1p1\\\": 1, \\\"f6g4\\\": 3, \\\"pppppkpr\\\": 1, \\\"ppnppppp\\\": 1, \\\"2r5\\\": 1, \\\"npppp3\\\": 1, \\\"2p1pnpb\\\": 1, \\\"qp3p2\\\": 1, \\\"2np2p1\\\": 1, \\\"r1b2qnr\\\": 1, \\\"pbppppp1\\\": 2, \\\"b2e5\\\": 1, \\\"1p1pbppp\\\": 1, \\\"bq2p3\\\": 1, \\\"2q1p3\\\": 1, \\\"1pqp1pbp\\\": 1, \\\"1pp2ppn\\\": 1, \\\"3ppk1p\\\": 1, \\\"e2e1\\\": 1, \\\"npp1pp1p\\\": 1, \\\"ppp2pbp\\\": 1, \\\"3pbn2\\\": 1, \\\"p1b2n1p\\\": 1, \\\"p1pp1k2\\\": 1, \\\"n1pp1pp1\\\": 1, \\\"b5b6\\\": 1, \\\"rn6\\\": 1, \\\"rppppkpp\\\": 1, \\\"2bq1bnr\\\": 1, \\\"b6c8\\\": 1, \\\"pb2p1p1\\\": 1, \\\"2pn3n\\\": 1, \\\"e2d3\\\": 2, \\\"p4pb1\\\": 1, \\\"rqp4p\\\": 1, \\\"g4c8\\\": 1, \\\"1p1k3n\\\": 1, \\\"4ppbp\\\": 1, \\\"1rb1qbnr\\\": 1, \\\"pn3p2\\\": 2, \\\"3ppp1b\\\": 1, \\\"pb1pp2p\\\": 1, \\\"1p3ppb\\\": 1, \\\"ppn1p2p\\\": 1, \\\"r2p1p2\\\": 1, \\\"1pppppb1\\\": 2, \\\"pb1kpppp\\\": 1, \\\"pp1pq2p\\\": 1, \\\"b1n3p1\\\": 1, \\\"n3n2p\\\": 1, \\\"h5h4\\\": 2, \\\"pppbqp1p\\\": 1, \\\"3pp2b\\\": 1, \\\"1rbqkbr1\\\": 1, \\\"p1n3pp\\\": 1, \\\"p1p1pk1p\\\": 1, \\\"d1d4\\\": 1, \\\"1pqkpppp\\\": 1, \\\"rn3bnr\\\": 1, \\\"b4c2\\\": 1, \\\"r6b\\\": 1, \\\"a6h6\\\": 1, \\\"p1pqpkp1\\\": 1, \\\"ppp1pnpp\\\": 1, \\\"p1p1kp2\\\": 1, \\\"e4d3\\\": 1, \\\"3ppppb\\\": 1, \\\"2n3q1\\\": 1, \\\"2np1p1p\\\": 1, \\\"pppb2p1\\\": 1, \\\"1ppqpp1p\\\": 2, \\\"1np3p1\\\": 1, \\\"pp1pppb1\\\": 1, \\\"3qpppp\\\": 1, \\\"2p2b2\\\": 3, \\\"n1p4r\\\": 1, \\\"d7a4\\\": 1, \\\"n2q4\\\": 1, \\\"bp1p3n\\\": 1, \\\"p1p1pnpr\\\": 1, \\\"3bb3\\\": 1, \\\"2p1pp1r\\\": 1, \\\"p6r\\\": 1, \\\"g4g8\\\": 1, \\\"1rbqkbn1\\\": 1, \\\"5r2\\\": 1, \\\"pp1bppp1\\\": 2, \\\"f8h6\\\": 1, \\\"d4f3\\\": 2, \\\"1p1bpppp\\\": 1, \\\"pqpp4\\\": 1, \\\"rp1p1p1p\\\": 1, \\\"2nb1qp1\\\": 1, \\\"pb3ppp\\\": 2, \\\"c4c5\\\": 1, \\\"3n3p\\\": 1, \\\"ppppppr1\\\": 1, \\\"bb6\\\": 1, \\\"np2pq1n\\\": 1, \\\"f3a8\\\": 1, \\\"1nbqk1n1\\\": 1, \\\"rppp1p1r\\\": 1, \\\"pbb1p2p\\\": 1, \\\"1pp1k1pr\\\": 1, \\\"rnbq2n1\\\": 1, \\\"2qp3p\\\": 1, \\\"2pnpp2\\\": 1, \\\"p1p1p1pr\\\": 1, \\\"pp1npp1p\\\": 1, \\\"1bppp3\\\": 1, \\\"a5c4\\\": 1, \\\"1nbq1b1r\\\": 1, \\\"rpp1pkpp\\\": 1, \\\"p2np2p\\\": 1, \\\"bp2pppp\\\": 1, \\\"p1ppn3\\\": 1, \\\"4pn1p\\\": 1, \\\"bp3p2\\\": 1, \\\"1pn2q2\\\": 1, \\\"1qn2p2\\\": 1, \\\"p2b4\\\": 2, \\\"e4d6\\\": 2, \\\"rppppqp1\\\": 1, \\\"e1f2\\\": 2, \\\"b3c4\\\": 1, \\\"1pppb1pp\\\": 2, \\\"n1pp4\\\": 2, \\\"2pbnppp\\\": 1, \\\"pppppk2\\\": 1, \\\"p1p3pb\\\": 1, \\\"2ppp2q\\\": 1, \\\"1p2pn1p\\\": 1, \\\"pp2p1bp\\\": 1, \\\"p1npq3\\\": 1, \\\"5ppb\\\": 2, \\\"p1pk3p\\\": 1, \\\"6nn\\\": 1, \\\"h2g3\\\": 2, \\\"pp1ppnpp\\\": 1, \\\"q1p1p1b1\\\": 1, \\\"g4d7\\\": 1, \\\"rp6\\\": 3, \\\"p2p2b1\\\": 1, \\\"pp3p1n\\\": 1, \\\"2p1pppr\\\": 2, \\\"pp2qpp1\\\": 1, \\\"1pp1pkpp\\\": 2, \\\"r2p1ppp\\\": 1, \\\"p3p2b\\\": 1, \\\"pn3p1p\\\": 1, \\\"1ppppkp1\\\": 1, \\\"pppp1n2\\\": 1, \\\"1np5\\\": 1, \\\"p6q\\\": 1, \\\"n3p1pn\\\": 1, \\\"1nrqkb1r\\\": 1, \\\"2pr4\\\": 1, \\\"1p2ppbp\\\": 1, \\\"4q2p\\\": 1, \\\"p1n3p1\\\": 1, \\\"e5c4\\\": 2, \\\"pppqppbp\\\": 1, \\\"1pnp3p\\\": 1, \\\"a1b1\\\": 1, \\\"1ppkp1pp\\\": 2, \\\"2bqk1nr\\\": 1, \\\"r1pp1ppp\\\": 1, \\\"1p2b3\\\": 2, \\\"1b2p1p1\\\": 1, \\\"rnqk1bnr\\\": 1, \\\"p3ppn1\\\": 1, \\\"e7g5\\\": 1, \\\"5npq\\\": 1, \\\"f5d4\\\": 1, \\\"2pkpppp\\\": 1, \\\"p1pnpkpp\\\": 1, \\\"n4n1p\\\": 1, \\\"a4b4\\\": 1, \\\"pp2nppp\\\": 1, \\\"pbpkpppp\\\": 1, \\\"rp1pnpp1\\\": 1, \\\"p1p1p1n1\\\": 1, \\\"p1pbpp1p\\\": 1, \\\"rppppkp1\\\": 1, \\\"a2a1\\\": 1, \\\"4np2\\\": 1, \\\"e5f7\\\": 1, \\\"pb1pbppp\\\": 1, \\\"n3pq2\\\": 1, \\\"1r5p\\\": 1, \\\"1p1q1p2\\\": 1, \\\"f5f6\\\": 1, \\\"pnpp4\\\": 1, \\\"1ppppk2\\\": 1, \\\"h5e5\\\": 1, \\\"pp1ppp1n\\\": 1, \\\"1qp3pp\\\": 1, \\\"h7g5\\\": 2, \\\"q3p3\\\": 2, \\\"1pppnppp\\\": 1, \\\"5pnp\\\": 1, \\\"2n4r\\\": 1, \\\"d8e7\\\": 2, \\\"p2pn1pp\\\": 1, \\\"2qpp1pp\\\": 1, \\\"2qppp1p\\\": 1, \\\"d3b5\\\": 2, \\\"1p1qn3\\\": 1, \\\"d3e3\\\": 1, \\\"p1pq1p1p\\\": 1, \\\"p1np1n1b\\\": 1, \\\"2rqk1nr\\\": 1, \\\"ppp2npp\\\": 1, \\\"pppn1ppp\\\": 2, \\\"d2f3\\\": 1, \\\"2pnppp1\\\": 1, \\\"p2pb2p\\\": 1, \\\"1nk2p2\\\": 1, \\\"pp1b2pp\\\": 1, \\\"ppnpppp1\\\": 1, \\\"2n2ppp\\\": 1, \\\"rnbqkn1r\\\": 1, \\\"1p3n1p\\\": 3, \\\"h8f8\\\": 1, \\\"1p1p1pb1\\\": 1, \\\"pppp2pr\\\": 1, \\\"p3pppn\\\": 1, \\\"1bn1p3\\\": 1, \\\"r1p5\\\": 2, \\\"1ppbpp1p\\\": 1, \\\"p2np3\\\": 1, \\\"pppkp1p1\\\": 3, \\\"1p1n3p\\\": 1, \\\"p1ppn1pp\\\": 1, \\\"n3p1pb\\\": 1, \\\"pp1bpppr\\\": 1, \\\"3bp1p1\\\": 1, \\\"d3f1\\\": 1, \\\"1pp1p1bp\\\": 1, \\\"2pb3p\\\": 1, \\\"f2g3\\\": 2, \\\"b5pn\\\": 1, \\\"a3f3\\\": 1, \\\"p2b3p\\\": 1, \\\"2p1n2p\\\": 1, \\\"f7d8\\\": 1, \\\"1pp1q3\\\": 1, \\\"1bppp1pp\\\": 2, \\\"b4nn1\\\": 1, \\\"1ppp1n2\\\": 1, \\\"d6f4\\\": 1, \\\"rnb1kbnn\\\": 1, \\\"b4d6\\\": 1, \\\"b1n2p2\\\": 1, \\\"pb3pp1\\\": 1, \\\"pq2b3\\\": 1, \\\"1ppbp1pp\\\": 1, \\\"b2p1p2\\\": 1, \\\"n2qp3\\\": 1, \\\"b7a6\\\": 1, \\\"2nk1p2\\\": 1, \\\"c6d8\\\": 1, \\\"r1p3pp\\\": 1, \\\"2b3pp\\\": 1, \\\"1ppp1p1r\\\": 1, \\\"g4h3\\\": 2, \\\"1rbk1bnr\\\": 1, \\\"1bppkpp1\\\": 1, \\\"r3p3\\\": 1, \\\"b8d7\\\": 1, \\\"1p2npq1\\\": 1, \\\"a8a5\\\": 1, \\\"p2qpp1p\\\": 1, \\\"np1p2p1\\\": 1, \\\"p1pbpp2\\\": 1, \\\"1p4pb\\\": 2, \\\"1p4pq\\\": 1, \\\"c5b3\\\": 1, \\\"pnp2p2\\\": 1, \\\"ppp3bp\\\": 1, \\\"pbpnp1p1\\\": 1, \\\"2np1p1n\\\": 1, \\\"2b1k1nr\\\": 1, \\\"r1nbp3\\\": 1, \\\"qpp2p2\\\": 1, \\\"1qp2p2\\\": 1, \\\"p1np1n2\\\": 1, \\\"2p3qb\\\": 1, \\\"p1pb4\\\": 1, \\\"rnq1kb1r\\\": 1, \\\"p4pbp\\\": 1, \\\"rn2kbr1\\\": 1, \\\"1q1p3p\\\": 1, \\\"2pn1p2\\\": 1, \\\"pbp1pp2\\\": 1, \\\"2p1ppbp\\\": 1, \\\"n5k1\\\": 1, \\\"f5g6\\\": 1, \\\"1p1b3r\\\": 1, \\\"p2p1p1n\\\": 1, \\\"rp2p1pp\\\": 1, \\\"pp1kppbp\\\": 1, \\\"g7d4\\\": 1, \\\"p4npp\\\": 1, \\\"pp2ppb1\\\": 1, \\\"g7a1\\\": 1, \\\"1n3n2\\\": 1, \\\"4k1p1\\\": 1, \\\"5kp1\\\": 1, \\\"ppn2p2\\\": 1, \\\"g6h5\\\": 2, \\\"2pp1pnp\\\": 1, \\\"c4b3\\\": 1, \\\"p2pp1p1\\\": 3, \\\"pbp1ppp1\\\": 1, \\\"ppp1ppb1\\\": 1, \\\"r1bqknnr\\\": 1, \\\"a6g6\\\": 1, \\\"1bp1ppp1\\\": 1, \\\"ppnq4\\\": 1, \\\"p3q1p1\\\": 1, \\\"b6c5\\\": 1, \\\"ppqp2pp\\\": 1, \\\"r2bpppp\\\": 1, \\\"n2q1n2\\\": 1, \\\"p1pppppn\\\": 1, \\\"p1p1p2n\\\": 1, \\\"n2p1ppp\\\": 1, \\\"p1p2n1p\\\": 1, \\\"1ppnpp1p\\\": 1, \\\"pppp1pq1\\\": 1, \\\"b2p1q1n\\\": 1, \\\"ppp1k1pp\\\": 2, \\\"rnb4r\\\": 1, \\\"a3c5\\\": 1, \\\"rp1ppppp\\\": 1, \\\"p1pqp1pp\\\": 1, \\\"d5e5\\\": 1, \\\"pbqppppp\\\": 1, \\\"rnb2k1r\\\": 1, \\\"p2b3n\\\": 1, \\\"1ppb2p1\\\": 1, \\\"1pn1p1p1\\\": 1, \\\"p1pp1kpp\\\": 1, \\\"rnbqnb1r\\\": 1, \\\"p2p1n1p\\\": 1, \\\"rpp1ppp1\\\": 1, \\\"1p1qpppp\\\": 1, \\\"rn1q2nr\\\": 1, \\\"1b2pb2\\\": 1, \\\"p5kp\\\": 1, \\\"2pq2pb\\\": 1, \\\"g4h6\\\": 1, \\\"p3qppp\\\": 1, \\\"2pb1qpp\\\": 1, \\\"pp1pnp2\\\": 1, \\\"p2p1np1\\\": 1, \\\"pp1pp2r\\\": 1, \\\"2p1p2n\\\": 1, \\\"rp1ppk1p\\\": 1, \\\"r1bq1rk1\\\": 1, \\\"p1n1pnp1\\\": 1, \\\"1b1n4\\\": 1, \\\"q1p4p\\\": 1, \\\"2p1pnp1\\\": 1, \\\"a3c4\\\": 1, \\\"2p3np\\\": 1, \\\"bp3n2\\\": 1, \\\"bpn3pn\\\": 1, \\\"ppqp3p\\\": 1, \\\"1p1pq1pp\\\": 1, \\\"b4c3\\\": 1, \\\"pb1ppp2\\\": 1, \\\"1bp4q\\\": 1, \\\"h5c5\\\": 1, \\\"c4b6\\\": 1, \\\"p1n2ppn\\\": 1, \\\"3pn1pp\\\": 1, \\\"p1pb1p2\\\": 1, \\\"r2p2p1\\\": 1, \\\"1p1k1ppp\\\": 1, \\\"1pnb4\\\": 1, \\\"p3bn2\\\": 1, \\\"ppkpppp1\\\": 1, \\\"d4d6\\\": 1, \\\"n5r1\\\": 1, \\\"h4g6\\\": 1, \\\"4n2b\\\": 1, \\\"e3d1\\\": 2, \\\"n1ppp2n\\\": 1, \\\"pppnp2p\\\": 1, \\\"4bp2\\\": 1, \\\"d4e3\\\": 1, \\\"rp2pp1p\\\": 1, \\\"p1p2n2\\\": 1, \\\"rp2p3\\\": 1, \\\"p1n2n2\\\": 1, \\\"p2n1p1p\\\": 1, \\\"ppp1p1kp\\\": 1, \\\"e6d5\\\": 1, \\\"3p1pbp\\\": 1, \\\"c6c5\\\": 1, \\\"ppp4n\\\": 1, \\\"pppppkp1\\\": 1, \\\"h4f4\\\": 1, \\\"p1qp1p1p\\\": 1, \\\"ppp1k2p\\\": 1, \\\"f5g5\\\": 1, \\\"rnb1k1n1\\\": 1, \\\"2b1p2p\\\": 1, \\\"n2qbnp1\\\": 1, \\\"f3g5\\\": 1, \\\"2pp2b1\\\": 1, \\\"bpp4n\\\": 1, \\\"3p1pnn\\\": 1, \\\"r2pp2p\\\": 1, \\\"rnb1kqnr\\\": 1, \\\"bn6\\\": 1, \\\"pppp1p1n\\\": 1, \\\"pb2pp1p\\\": 1, \\\"rp5p\\\": 1, \\\"1pn1pp1p\\\": 1, \\\"p1pq2p1\\\": 1, \\\"pb1p1ppp\\\": 1, \\\"n4q1p\\\": 1, \\\"2b2p2\\\": 1, \\\"h5f6\\\": 1, \\\"pp1kpp1n\\\": 1, \\\"c4d3\\\": 1, \\\"ppb1p1b1\\\": 1, \\\"1n2pp2\\\": 1, \\\"ppp1bnpp\\\": 1, \\\"pb1p1p2\\\": 1, \\\"pppq1p1p\\\": 1, \\\"2n1p1pr\\\": 1, \\\"1p1q1p1b\\\": 1, \\\"p2bpp1p\\\": 1, \\\"1p2ppp1\\\": 1, \\\"2pn2bp\\\": 1, \\\"p2pp2n\\\": 1, \\\"pp1k2pp\\\": 1, \\\"rnbq1br1\\\": 1, \\\"p3k1p1\\\": 1, \\\"qpp3p1\\\": 1, \\\"rn1qkbqr\\\": 1, \\\"g8h8\\\": 1, \\\"f6f5\\\": 1, \\\"e5g6\\\": 1, \\\"nb3p2\\\": 1, \\\"rbbqk1nr\\\": 1, \\\"p1p1pppn\\\": 1, \\\"pppppppr\\\": 1, \\\"p3bp1n\\\": 1, \\\"1p1p2pq\\\": 1, \\\"p1nq3b\\\": 1, \\\"r3k1nr\\\": 1, \\\"g8e7\\\": 1, \\\"np3n2\\\": 1, \\\"1pp1pp1r\\\": 1, \\\"p4b2\\\": 1, \\\"1n4pn\\\": 1, \\\"b6a8\\\": 1, \\\"2n2b2\\\": 1, \\\"r2pppbp\\\": 1}\", \"word_docs\": \"{\\\"e3e4\\\": 5, \\\"6pp\\\": 33, \\\"p3p3\\\": 31, \\\"4p3\\\": 271, \\\"0\\\": 1123, \\\"1ppp2p1\\\": 5, \\\"rnbqk1nr\\\": 127, \\\"5p2\\\": 246, \\\"rnbqkbnr\\\": 924, \\\"w\\\": 884, \\\"pppp1pb1\\\": 1, \\\"6\\\": 263, \\\"kqkq\\\": 1384, \\\"ppppp2p\\\": 32, \\\"5p1p\\\": 50, \\\"n5p1\\\": 17, \\\"r1bqkbnr\\\": 425, \\\"h4h5\\\": 3, \\\"rnbqkb1r\\\": 409, \\\"2\\\": 511, \\\"5n2\\\": 108, \\\"4\\\": 310, \\\"ppppp1p1\\\": 32, \\\"1\\\": 581, \\\"pp1ppppp\\\": 110, \\\"b\\\": 1116, \\\"pppppppp\\\": 250, \\\"2p5\\\": 252, \\\"d7d5\\\": 161, \\\"8\\\": 1360, \\\"pp3p1p\\\": 7, \\\"rnb1kbnr\\\": 177, \\\"3p4\\\": 292, \\\"2p1p3\\\": 36, \\\"c8h3\\\": 5, \\\"3p2pq\\\": 2, \\\"2p2pp1\\\": 12, \\\"pp2p2p\\\": 6, \\\"ppppp1pp\\\": 104, \\\"n7\\\": 105, \\\"7n\\\": 113, \\\"1p6\\\": 237, \\\"p1pppppp\\\": 108, \\\"c2c4\\\": 16, \\\"1p5n\\\": 9, \\\"rn1qkbnr\\\": 156, \\\"g8f6\\\": 53, \\\"rnbqkbr1\\\": 54, \\\"qkq\\\": 82, \\\"p2bp1pp\\\": 1, \\\"p1p1pppp\\\": 34, \\\"7\\\": 263, \\\"1p1p1p2\\\": 9, \\\"r1bqkb1r\\\": 138, \\\"6p1\\\": 224, \\\"b6n\\\": 5, \\\"pp1p1ppp\\\": 35, \\\"b2a3\\\": 3, \\\"pppppp1p\\\": 92, \\\"q2p4\\\": 3, \\\"a5b4\\\": 6, \\\"pp2pppp\\\": 29, \\\"r1bqk2r\\\": 17, \\\"3\\\": 345, \\\"n5pn\\\": 4, \\\"5\\\": 279, \\\"p1ppppbp\\\": 4, \\\"4pp1n\\\": 2, \\\"c7c6\\\": 14, \\\"2p1q1p1\\\": 1, \\\"p1pp2pp\\\": 16, \\\"rnb1kbr1\\\": 10, \\\"pp1ppp2\\\": 13, \\\"5n1p\\\": 13, \\\"b8c6\\\": 24, \\\"pp1p4\\\": 12, \\\"pppp1pbp\\\": 2, \\\"rnbqk2r\\\": 47, \\\"2p1p1p1\\\": 10, \\\"4p1p1\\\": 49, \\\"e2e4\\\": 119, \\\"a6c8\\\": 1, \\\"1ppp1pp1\\\": 5, \\\"r3pn1p\\\": 1, \\\"1nbqk2r\\\": 3, \\\"bp1b1p2\\\": 1, \\\"r1bqk1nr\\\": 40, \\\"kkq\\\": 70, \\\"p1pn2pp\\\": 1, \\\"pp6\\\": 54, \\\"b4b5\\\": 8, \\\"p1pp1pp1\\\": 10, \\\"2pppppr\\\": 1, \\\"rnbqkbn1\\\": 43, \\\"4p2p\\\": 55, \\\"7p\\\": 215, \\\"np6\\\": 24, \\\"1p3p2\\\": 51, \\\"p3p1n1\\\": 1, \\\"p1pp3p\\\": 3, \\\"1ppp2pp\\\": 12, \\\"f3g4\\\": 3, \\\"ppp1pp1p\\\": 35, \\\"3p1bp1\\\": 2, \\\"1ppkpppp\\\": 1, \\\"kq\\\": 238, \\\"p2p4\\\": 32, \\\"rnbq1bnr\\\": 68, \\\"n4p2\\\": 21, \\\"a2a3\\\": 5, \\\"1ppppppp\\\": 94, \\\"p7\\\": 234, \\\"p2pp2p\\\": 9, \\\"1ppk1p2\\\": 1, \\\"1pp1p3\\\": 11, \\\"g5f4\\\": 12, \\\"p2p1ppp\\\": 14, \\\"2pp1p2\\\": 8, \\\"e4d5\\\": 5, \\\"1p2q1pp\\\": 1, \\\"2ppp3\\\": 12, \\\"p4p2\\\": 41, \\\"c1b2\\\": 26, \\\"2pp2p1\\\": 8, \\\"r1b1kb1r\\\": 18, \\\"pb2pppp\\\": 1, \\\"n3qn2\\\": 1, \\\"pppp1p2\\\": 11, \\\"d2d4\\\": 130, \\\"2rqkbnr\\\": 2, \\\"ppp1p1pp\\\": 30, \\\"2p1ppp1\\\": 8, \\\"1p1p2bp\\\": 2, \\\"2np4\\\": 9, \\\"f7f6\\\": 2, \\\"1p1pkppp\\\": 1, \\\"p3pn2\\\": 6, \\\"h4c4\\\": 1, \\\"p1pp1ppp\\\": 39, \\\"1p1bp3\\\": 1, \\\"rnbq1b1r\\\": 27, \\\"rnb1k1nr\\\": 40, \\\"2p4q\\\": 2, \\\"1p1pp1p1\\\": 7, \\\"p1pkpp1p\\\": 2, \\\"b7\\\": 10, \\\"rn1q1bnr\\\": 17, \\\"q\\\": 16, \\\"b4c5\\\": 4, \\\"rnbqkb2\\\": 10, \\\"1p1p1ppr\\\": 1, \\\"p1p4p\\\": 9, \\\"r1b1kbnr\\\": 58, \\\"f3e4\\\": 2, \\\"p1p1n2p\\\": 2, \\\"pp1pp1p1\\\": 11, \\\"1pp2n1b\\\": 1, \\\"1pq1pppp\\\": 1, \\\"kqq\\\": 68, \\\"g7g6\\\": 15, \\\"3p3n\\\": 11, \\\"p2p3p\\\": 9, \\\"e4e5\\\": 9, \\\"2pppppp\\\": 36, \\\"ppppppp1\\\": 92, \\\"e7e5\\\": 191, \\\"5pp1\\\": 42, \\\"pp1pp2p\\\": 15, \\\"7b\\\": 18, \\\"p1pppp1p\\\": 48, \\\"1p4p1\\\": 39, \\\"g4f5\\\": 14, \\\"ppp1pppp\\\": 128, \\\"b2b3\\\": 2, \\\"n2p4\\\": 16, \\\"1ppp1ppp\\\": 34, \\\"pp1ppk1p\\\": 1, \\\"2pp4\\\": 38, \\\"d4c5\\\": 6, \\\"4pppp\\\": 9, \\\"p1p1pp1p\\\": 21, \\\"2n2p1n\\\": 2, \\\"1p1p2p1\\\": 10, \\\"pppp2pp\\\": 19, \\\"2p1q3\\\": 3, \\\"p1p2p1p\\\": 5, \\\"1p1ppqp1\\\": 1, \\\"2b5\\\": 13, \\\"f3f7\\\": 1, \\\"r2qkbnr\\\": 64, \\\"2n5\\\": 98, \\\"pppp1pp1\\\": 34, \\\"g1h3\\\": 6, \\\"3bp2b\\\": 1, \\\"rpp1pp2\\\": 1, \\\"pppk2p1\\\": 1, \\\"3p1p1p\\\": 9, \\\"k\\\": 34, \\\"3p3p\\\": 55, \\\"p5p1\\\": 45, \\\"4p2n\\\": 16, \\\"f1g2\\\": 25, \\\"1nbqkbnr\\\": 55, \\\"2np3r\\\": 1, \\\"f4g5\\\": 7, \\\"1bp1p2p\\\": 1, \\\"1pp1p1p1\\\": 9, \\\"r1bqkbn1\\\": 16, \\\"2p2p2\\\": 38, \\\"p1npp2p\\\": 1, \\\"1pp3pr\\\": 1, \\\"e6e5\\\": 7, \\\"pp1p1bp1\\\": 1, \\\"3pb2p\\\": 1, \\\"ppp2p1p\\\": 15, \\\"n2p1np1\\\": 1, \\\"b6p\\\": 3, \\\"b5a4\\\": 4, \\\"p2qp1p1\\\": 1, \\\"rnbq1k1r\\\": 2, \\\"d2e1\\\": 2, \\\"pp4pp\\\": 3, \\\"2p1pp1n\\\": 2, \\\"pppkpppp\\\": 3, \\\"pp1pnppp\\\": 3, \\\"1pp1pp1p\\\": 8, \\\"p2p2p1\\\": 7, \\\"d4e5\\\": 10, \\\"2p1p1n1\\\": 1, \\\"r1bkqbnr\\\": 1, \\\"4k3\\\": 2, \\\"c7c5\\\": 22, \\\"p4n2\\\": 16, \\\"rpppnppp\\\": 1, \\\"1nbqkb1r\\\": 30, \\\"f5e4\\\": 12, 