"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 1000, \"word_counts\": \"{\\\"rnbqkbnr\\\": 620, \\\"ppppp1p1\\\": 14, \\\"5p1p\\\": 25, \\\"1p6\\\": 115, \\\"8\\\": 1012, \\\"pbpppppp\\\": 5, \\\"rn1qkbnr\\\": 92, \\\"b\\\": 551, \\\"kqkq\\\": 676, \\\"1\\\": 290, \\\"3\\\": 179, \\\"e7e5\\\": 91, \\\"r1bqkb1r\\\": 65, \\\"pppppp1p\\\": 42, \\\"7n\\\": 55, \\\"6p1\\\": 117, \\\"7p\\\": 109, \\\"nn1ppp2\\\": 1, \\\"p1p3p1\\\": 5, \\\"r1bqkbnr\\\": 218, \\\"6\\\": 140, \\\"b3a1\\\": 3, \\\"rnb1kbnr\\\": 88, \\\"p1pp2pp\\\": 6, \\\"1p3q2\\\": 2, \\\"4pp2\\\": 20, \\\"p2p1b2\\\": 3, \\\"2p1pppp\\\": 5, \\\"w\\\": 449, \\\"5\\\": 137, \\\"d4e5\\\": 6, \\\"pp1pp2p\\\": 11, \\\"5p2\\\": 125, \\\"2p3p1\\\": 23, \\\"n6p\\\": 9, \\\"p1ppppp1\\\": 14, \\\"0\\\": 570, \\\"4\\\": 153, \\\"g5g4\\\": 12, \\\"pppb1ppp\\\": 2, \\\"3p4\\\": 152, \\\"4p3\\\": 148, \\\"3bppp1\\\": 1, \\\"pppp3p\\\": 3, \\\"rnbqk1nr\\\": 67, \\\"2\\\": 252, \\\"c2c4\\\": 8, \\\"ppp1pppp\\\": 60, \\\"5n2\\\": 56, \\\"pppppppp\\\": 137, \\\"rnbqkb1r\\\": 219, \\\"d2d4\\\": 60, \\\"rn2kbnr\\\": 17, \\\"p2ppppp\\\": 14, \\\"bp3q2\\\": 1, \\\"p1p5\\\": 21, \\\"3p2p1\\\": 29, \\\"2pq1p2\\\": 1, \\\"1p2p2p\\\": 3, \\\"g4g5\\\": 7, \\\"5np1\\\": 5, \\\"4p2p\\\": 30, \\\"pppp1pp1\\\": 17, \\\"p7\\\": 135, \\\"1ppppppp\\\": 47, \\\"rn1qkb1r\\\": 34, \\\"pbpppp1p\\\": 2, \\\"1p3np1\\\": 1, \\\"np4p1\\\": 1, \\\"p1pppp1p\\\": 22, \\\"kkq\\\": 42, \\\"b7h1\\\": 3, \\\"1p1ppppp\\\": 15, \\\"p1p3b1\\\": 1, \\\"3p1n2\\\": 8, \\\"h7h6\\\": 2, \\\"2n5\\\": 47, \\\"d7d5\\\": 78, \\\"pp1ppppp\\\": 52, \\\"n1p5\\\": 8, \\\"4n3\\\": 5, \\\"p1pppppp\\\": 46, \\\"a6b4\\\": 5, \\\"pp1p1ppp\\\": 18, \\\"q1p1p3\\\": 2, \\\"f3e5\\\": 1, \\\"ppp1ppp1\\\": 15, \\\"5n1p\\\": 8, \\\"pppp2pp\\\": 14, \\\"e4e5\\\": 4, \\\"pp1pp3\\\": 3, \\\"2p1p3\\\": 21, \\\"3p2q1\\\": 2, \\\"ppp1bppp\\\": 2, \\\"rnb1k1nr\\\": 20, \\\"h6h5\\\": 3, \\\"r1bqkb2\\\": 3, \\\"pp1pppp1\\\": 20, \\\"n4nr1\\\": 1, \\\"2p4p\\\": 21, \\\"p2p3b\\\": 1, \\\"rpp1pppp\\\": 2, \\\"3qkbnr\\\": 3, \\\"kq\\\": 117, \\\"pppp2p1\\\": 4, \\\"1p5p\\\": 23, \\\"1nbqkbnr\\\": 29, \\\"rppppppp\\\": 3, \\\"6b1\\\": 8, \\\"kqk\\\": 35, \\\"e2e4\\\": 58, \\\"pp1pqpp1\\\": 1, \\\"2p1p2p\\\": 7, \\\"bp4pn\\\": 1, \\\"7\\\": 130, \\\"a3e7\\\": 3, \\\"3pp3\\\": 20, \\\"ppp2ppp\\\": 22, \\\"c7c6\\\": 10, \\\"1pppp1pp\\\": 14, \\\"p4p2\\\": 20, \\\"1p2p1p1\\\": 5, \\\"6np\\\": 3, \\\"p1pp1p2\\\": 7, \\\"g3h1\\\": 1, \\\"r2qkbnr\\\": 37, \\\"1pp1pp1p\\\": 3, \\\"n5p1\\\": 6, \\\"p1p4p\\\": 3, \\\"7r\\\": 5, \\\"1p1pppp1\\\": 5, \\\"rnbqkbn1\\\": 22, \\\"qkq\\\": 44, \\\"f5h3\\\": 1, \\\"r1bq1br1\\\": 1, \\\"p1pkpppp\\\": 4, \\\"n6n\\\": 9, \\\"1p1p4\\\": 17, \\\"1pn5\\\": 11, \\\"p2p1pp1\\\": 3, \\\"c4e5\\\": 1, \\\"1ppp1ppp\\\": 16, \\\"3p3n\\\": 5, \\\"ppp1pp1p\\\": 19, \\\"2p4n\\\": 9, \\\"1b6\\\": 4, \\\"np2pp2\\\": 2, \\\"r1bqk1nr\\\": 18, \\\"c6b5\\\": 2, \\\"ppppppp1\\\": 47, \\\"2p5\\\": 128, \\\"pp1pp1pp\\\": 22, \\\"b4n2\\\": 1, \\\"c8a6\\\": 1, \\\"pppq3p\\\": 1, \\\"3p1p2\\\": 22, \\\"3p3p\\\": 28, \\\"ppp2pp1\\\": 6, \\\"g2g4\\\": 1, \\\"p1p1pppp\\\": 17, \\\"n2p3n\\\": 1, \\\"4p1q1\\\": 3, \\\"p1pp1pp1\\\": 7, \\\"f1b5\\\": 2, \\\"p2ppp1n\\\": 1, \\\"1pp3pb\\\": 1, \\\"pppk1ppp\\\": 2, \\\"rnbq1b1r\\\": 11, \\\"h2h4\\\": 1, \\\"rnbq1bnr\\\": 33, \\\"1ppp1kpp\\\": 1, \\\"pp6\\\": 22, \\\"3qp1p1\\\": 1, \\\"pbpp1p1p\\\": 2, \\\"d3d5\\\": 1, \\\"pp1p3p\\\": 4, \\\"6pn\\\": 10, \\\"2p2pn1\\\": 1, \\\"2b5\\\": 7, \\\"pppp1ppp\\\": 66, \\\"rnbqk1r1\\\": 4, \\\"d1e2\\\": 1, \\\"4pn2\\\": 6, \\\"2n2n1p\\\": 1, \\\"rn1k1bnr\\\": 1, \\\"pp2pp1p\\\": 7, \\\"1qpp4\\\": 2, \\\"5bp1\\\": 1, \\\"ppb1p3\\\": 1, \\\"1r3q2\\\": 1, \\\"2pp1ppp\\\": 7, \\\"1nb1k1nr\\\": 1, \\\"k\\\": 14, \\\"f3f5\\\": 1, \\\"4pnp1\\\": 2, \\\"ppppb2p\\\": 1, \\\"rnbqk2r\\\": 19, \\\"kqq\\\": 35, \\\"e5f4\\\": 6, \\\"rn1qk1nr\\\": 9, \\\"pbppppb1\\\": 1, \\\"1pbpp1pp\\\": 1, \\\"p1p2ppr\\\": 1, \\\"rnbqk1n1\\\": 3, \\\"c4b5\\\": 3, \\\"ppppbppp\\\": 2, \\\"4p2n\\\": 9, \\\"7b\\\": 8, \\\"pppp1p1p\\\": 25, \\\"g5h6\\\": 1, \\\"ppp1p2p\\\": 8, \\\"2n1b1p1\\\": 1, \\\"q1p2p2\\\": 1, \\\"r1b1k1nr\\\": 6, \\\"c8e6\\\": 2, \\\"pp1ppp1p\\\": 13, \\\"3ppppp\\\": 13, \\\"r7\\\": 6, \\\"ppp5\\\": 7, \\\"p2bpppp\\\": 1, \\\"g7g6\\\": 8, \\\"ppp1p1pp\\\": 12, \\\"ppppp2p\\\": 18, \\\"q7\\\": 5, \\\"2p3pn\\\": 2, \\\"rnb1kb1r\\\": 23, \\\"3n1p2\\\": 1, \\\"p6n\\\": 6, \\\"r1bqkbr1\\\": 13, \\\"pppnppp1\\\": 1, \\\"2p1pp1n\\\": 1, \\\"pp1pk1pr\\\": 1, \\\"rnbq1b2\\\": 1, \\\"q\\\": 7, \\\"c3d4\\\": 1, \\\"pp1ppp2\\\": 5, \\\"p5p1\\\": 21, \\\"1pp1ppbp\\\": 1, \\\"g3g4\\\": 2, \\\"p1pp1p1p\\\": 8, \\\"b5p1\\\": 1, \\\"1p2p3\\\": 13, \\\"p3p3\\\": 10, \\\"2ppkppp\\\": 1, \\\"r1bq1bnr\\\": 13, \\\"b5b4\\\": 4, \\\"p1ppp1p1\\\": 9, \\\"b2p4\\\": 1, \\\"rnbq1knr\\\": 3, \\\"b8a6\\\": 3, \\\"r3kbnr\\\": 6, \\\"3q1n2\\\": 1, \\\"6pb\\\": 10, \\\"pp2p2p\\\": 3, \\\"e7e6\\\": 17, \\\"1p1pp3\\\": 10, \\\"5npp\\\": 2, \\\"2p2p2\\\": 21, \\\"p3pp2\\\": 6, \\\"2np4\\\": 3, \\\"ppp1q1pp\\\": 1, \\\"r1b1kbnr\\\": 34, \\\"r1bqkbn1\\\": 6, \\\"ppp1p1pr\\\": 1, \\\"2n4p\\\": 8, \\\"g6h7\\\": 1, \\\"ppp1pp2\\\": 8, \\\"3pqp2\\\": 1, \\\"f4e3\\\": 3, \\\"ppppp1pp\\\": 51, \\\"g8f6\\\": 21, \\\"rnbqkbr1\\\": 28, \\\"4q3\\\": 2, \\\"b2pp3\\\": 1, \\\"p1p2ppp\\\": 4, \\\"f8e7\\\": 1, \\\"p2ppkpp\\\": 2, \\\"1p3p2\\\": 25, \\\"q6p\\\": 3, \\\"a4c2\\\": 1, \\\"p1ppp2r\\\": 2, \\\"1p1p1p1p\\\": 7, \\\"b4p1p\\\": 1, \\\"p1p1p1p1\\\": 3, \\\"p1pp1ppp\\\": 18, \\\"1p4q1\\\": 2, \\\"h4g5\\\": 5, \\\"nppppp2\\\": 1, \\\"6pp\\\": 12, \\\"p1n4n\\\": 1, \\\"2ppppp1\\\": 3, \\\"2bp4\\\": 3, \\\"1p1ppp1p\\\": 10, \\\"1ppppp1p\\\": 12, \\\"pb4p1\\\": 1, \\\"1qp1p3\\\": 2, \\\"pp5n\\\": 3, \\\"2pppppp\\\": 20, \\\"e6e5\\\": 3, \\\"1pp1p1pp\\\": 7, \\\"ppp2p1p\\\": 11, \\\"h2h3\\\": 3, \\\"2p2n2\\\": 10, \\\"7q\\\": 5, \\\"1ppp2pp\\\": 6, \\\"h5h3\\\": 1, \\\"1pp1pppp\\\": 21, \\\"p2p4\\\": 13, \\\"1p2pppp\\\": 8, \\\"c4d5\\\": 8, \\\"f7f6\\\": 1, \\\"pppb1p2\\\": 1, \\\"n3p2p\\\": 1, \\\"1p1p2p1\\\": 4, \\\"b1np4\\\": 1, \\\"1r1qkbnr\\\": 1, \\\"a3f8\\\": 1, \\\"5pp1\\\": 20, \\\"p1n5\\\": 10, \\\"5b2\\\": 3, \\\"3p2pp\\\": 8, \\\"2n2p2\\\": 5, \\\"pppppn2\\\": 1, \\\"1rbqkbnr\\\": 15, \\\"f2d1\\\": 1, \\\"rnb1k3\\\": 1, \\\"ppppqppr\\\": 1, \\\"2bn4\\\": 1, \\\"1p1qp1p1\\\": 1, \\\"c5b4\\\": 5, \\\"pppppkpp\\\": 5, \\\"1n6\\\": 6, \\\"2p1pp2\\\": 4, \\\"pp1p2pp\\\": 8, \\\"c3b4\\\": 4, \\\"n3p3\\\": 7, \\\"p6p\\\": 16, \\\"1pppppp1\\\": 19, \\\"3pppp1\\\": 1, \\\"n7\\\": 51, \\\"e3\\\": 1, \\\"pp2p1p1\\\": 3, \\\"1pp2p1p\\\": 3, \\\"1n5r\\\": 1, \\\"rnbqkb2\\\": 5, \\\"1p1n3b\\\": 1, \\\"n4p2\\\": 9, \\\"pbppp1pp\\\": 4, \\\"b2h8\\\": 5, \\\"3b4\\\": 2, \\\"p1p1p3\\\": 4, \\\"2p2q1n\\\": 1, \\\"rp1p1ppp\\\": 2, \\\"1nbqkb1r\\\": 16, \\\"f3e4\\\": 1, \\\"r1bk1bnr\\\": 2, \\\"1p1pp1pp\\\": 5, \\\"p4p1b\\\": 1, \\\"q1p5\\\": 3, \\\"qn2n3\\\": 1, \\\"pp2pppp\\\": 14, \\\"r2k1bnr\\\": 1, \\\"a5a4\\\": 1, \\\"2ppp1p1\\\": 6, \\\"d1h5\\\": 8, \\\"1ppp1pp1\\\": 2, \\\"2n2n2\\\": 8, \\\"p3p2p\\\": 6, \\\"1p3ppp\\\": 2, \\\"npp2np1\\\": 1, \\\"c1g5\\\": 1, \\\"1rb1kbnr\\\": 2, \\\"1p1p3p\\\": 9, \\\"q1p1p1p1\\\": 1, \\\"1p4p1\\\": 20, \\\"3p1n1p\\\": 1, \\\"p1pqpp2\\\": 2, \\\"rn2kb1r\\\": 1, \\\"p2p3n\\\": 1, \\\"1ppbpppp\\\": 1, \\\"rp1pppp1\\\": 1, \\\"p1pn4\\\": 1, \\\"pp1n1ppp\\\": 1, \\\"1b1n1ppp\\\": 1, \\\"3pp2n\\\": 1, \\\"1pp5\\\": 19, \\\"pq1p1ppp\\\": 1, \\\"c8b7\\\": 10, \\\"2nq4\\\": 2, \\\"e2e3\\\": 12, \\\"1p1pp1bp\\\": 2, \\\"p1p2ppn\\\": 1, \\\"6n1\\\": 4, \\\"ppppp1b1\\\": 2, \\\"g5e4\\\": 2, \\\"p5pp\\\": 9, \\\"1p2pp2\\\": 6, \\\"2n2pb1\\\": 1, \\\"rpp1p1pp\\\": 1, \\\"n2p4\\\": 7, \\\"1n1p4\\\": 1, \\\"rppp1pp1\\\": 1, \\\"h3g4\\\": 3, \\\"2pn1p1p\\\": 1, \\\"3pp2p\\\": 2, \\\"pp1p2p1\\\": 6, \\\"p1p1pp1p\\\": 9, \\\"h7h5\\\": 2, \\\"pbnpppp1\\\": 1, \\\"1p3n2\\\": 9, \\\"d8c7\\\": 1, \\\"1ppp3p\\\": 2, \\\"p4p1n\\\": 2, \\\"4p1p1\\\": 28, \\\"ppppqp1p\\\": 2, \\\"e2h5\\\": 1, \\\"2n3pb\\\": 2, \\\"c1b2\\\": 11, \\\"6pq\\\": 1, \\\"ppp1ppbp\\\": 2, \\\"g8h6\\\": 3, \\\"pp3pp1\\\": 3, \\\"n5pp\\\": 1, \\\"2pppp2\\\": 2, \\\"g1f3\\\": 21, \\\"rnbk1bnr\\\": 5, \\\"pp3p1p\\\": 5, \\\"rp1pp3\\\": 2, \\\"f1g2\\\": 15, \\\"bpp5\\\": 1, \\\"3b1pp1\\\": 1, \\\"a6d3\\\": 1, \\\"ppp3pp\\\": 3, \\\"3ppb2\\\": 1, \\\"pppp1ppr\\\": 2, \\\"p1p1npp1\\\": 1, \\\"b6p\\\": 2, \\\"pppbkpp1\\\": 1, \\\"rn1q1b1r\\\": 2, \\\"f4h5\\\": 1, \\\"p1p1p1pp\\\": 4, \\\"p1p4n\\\": 1, \\\"b5c4\\\": 13, \\\"pppp1p2\\\": 8, \\\"p2p2pp\\\": 2, \\\"2p3b1\\\": 2, \\\"2np3p\\\": 3, \\\"r1q1kbnr\\\": 1, \\\"f6g5\\\": 4, \\\"p4ppp\\\": 1, \\\"bp6\\\": 4, \\\"1pp3p1\\\": 3, \\\"c2c3\\\": 5, \\\"1pppp1p1\\\": 6, \\\"pbp1pppp\\\": 2, \\\"r2q1bnr\\\": 4, \\\"p2kpppp\\\": 1, \\\"1pn1b3\\\": 1, \\\"1q2p3\\\": 1, \\\"1p1p2pp\\\": 2, \\\"pp3p2\\\": 5, \\\"4n2p\\\": 6, \\\"d2e3\\\": 2, \\\"n4bp1\\\": 1, \\\"p1ppp2p\\\": 7, \\\"b4pp1\\\": 1, \\\"r1p2n2\\\": 1, \\\"1p1ppp2\\\": 5, \\\"f7g6\\\": 1, \\\"p2pppp1\\\": 5, \\\"ppppqppp\\\": 3, \\\"b8c6\\\": 10, \\\"p1ppp1pp\\\": 16, \\\"1n3p1p\\\": 2, \\\"1p4pn\\\": 2, \\\"p1ppp3\\\": 2, \\\"2bqk2r\\\": 1, \\\"rppp1ppp\\\": 1, \\\"2n1p2n\\\": 2, \\\"p1b4p\\\": 1, \\\"1bppp1p1\\\": 2, \\\"f8g7\\\": 12, \\\"2p2ppp\\\": 4, \\\"pp1p4\\\": 5, \\\"1n1p1p2\\\": 1, \\\"n4np1\\\": 1, \\\"r2qk2r\\\": 1, \\\"a8b8\\\": 1, \\\"2pppp1p\\\": 5, \\\"b1c3\\\": 10, \\\"pp1ppppr\\\": 4, \\\"2p4q\\\": 1, \\\"4pp1p\\\": 4, \\\"f6h5\\\": 1, \\\"g5f4\\\": 6, \\\"ppppp3\\\": 4, \\\"1n3ppp\\\": 1, \\\"1pn4b\\\": 1, \\\"c3d1\\\": 1, \\\"r1bqk2r\\\": 12, \\\"pppp2bp\\\": 1, \\\"5p1n\\\": 8, \\\"1n2p1p1\\\": 1, \\\"2p2p1p\\\": 4, \\\"p1qp4\\\": 1, \\\"p1pnppp1\\\": 2, \\\"4b3\\\": 3, \\\"pb1pppp1\\\": 1, \\\"2p1pp1p\\\": 5, \\\"ppppn1p1\\\": 1, \\\"1pp1p1p1\\\": 4, \\\"3p1p1p\\\": 5, \\\"3p2pb\\\": 2, \\\"r2qkb1r\\\": 6, \\\"n3b2n\\\": 1, \\\"2pp4\\\": 19, \\\"pq1ppppp\\\": 1, \\\"f3d4\\\": 2, \\\"pppkppp1\\\": 1, \\\"c7c5\\\": 10, \\\"1p1p1p2\\\": 3, \\\"nr5n\\\": 1, \\\"p1ppqp1p\\\": 2, \\\"2b1kb1r\\\": 1, \\\"f5g4\\\": 5, \\\"1pppq2p\\\": 3, \\\"p3p1p1\\\": 8, \\\"3p2np\\\": 3, \\\"np1qp3\\\": 1, \\\"p1p2pp1\\\": 3, \\\"f2f3\\\": 1, \\\"pn6\\\": 1, \\\"p1p3pp\\\": 5, \\\"1p2bp1n\\\": 1, \\\"1pn3pn\\\": 1, \\\"p1qkpp1p\\\": 1, \\\"r1b2b1r\\\": 1, \\\"e6f5\\\": 2, \\\"g4f5\\\": 7, \\\"2n2bpn\\\": 1, \\\"r1bqkr2\\\": 1, \\\"1pp1ppp1\\\": 8, \\\"5nn1\\\": 1, \\\"p2p3p\\\": 5, \\\"g6h8\\\": 1, \\\"2bqkbnr\\\": 8, \\\"rp1ppp1p\\\": 1, \\\"p1pp2p1\\\": 2, \\\"3qp3\\\": 1, \\\"d4h8\\\": 1, \\\"pppppk1p\\\": 2, \\\"pp2p3\\\": 5, \\\"5ppp\\\": 5, \\\"p1pp4\\\": 7, \\\"n2ppq2\\\": 1, \\\"f6e5\\\": 1, \\\"pp1bpppp\\\": 2, \\\"2np3n\\\": 2, \\\"1q6\\\": 5, \\\"c4d6\\\": 1, \\\"1pp4n\\\": 5, \\\"pppp4\\\": 5, \\\"4pppp\\\": 5, \\\"c1e3\\\": 1, \\\"p1p2p1n\\\": 2, \\\"2n2p1p\\\": 4, \\\"4p1r1\\\": 1, \\\"pppp1kp1\\\": 3, \\\"r1bq1bn1\\\": 1, \\\"h7f6\\\": 1, \\\"3p1b2\\\": 6, \\\"pp1p1pp1\\\": 7, \\\"d5e4\\\": 2, \\\"1rb1kb1r\\\": 1, \\\"n2p1q1n\\\": 1, \\\"p4pp1\\\": 3, \\\"rpppp2r\\\": 1, \\\"1nbqkbn1\\\": 1, \\\"f6h4\\\": 1, \\\"3np3\\\": 3, \\\"3b1p2\\\": 1, \\\"e4d5\\\": 2, \\\"ppp1pp1q\\\": 1, \\\"1qnp4\\\": 1, \\\"h7h8\\\": 2, \\\"1qp4p\\\": 1, \\\"p2ppp1p\\\": 7, \\\"1bppk1pp\\\": 1, \\\"rn1q1bnr\\\": 9, \\\"a3b5\\\": 4, \\\"pppqppp1\\\": 1, \\\"3ppq2\\\": 1, \\\"h5g4\\\": 3, \\\"pppn1p1p\\\": 1, \\\"5q2\\\": 3, \\\"p2pp1b1\\\": 1, \\\"2n2p1b\\\": 1, \\\"rn1qkbr1\\\": 4, \\\"3qpn1p\\\": 1, \\\"n4p1b\\\": 1, \\\"ppp3p1\\\": 4, \\\"r1b1kb1r\\\": 11, \\\"h3g2\\\": 4, \\\"n1p2pp1\\\": 1, \\\"q2p3p\\\": 1, \\\"1pp1p2p\\\": 3, \\\"f5e4\\\": 5, \\\"p1pppp2\\\": 5, \\\"p2p1p2\\\": 6, \\\"r2ppppp\\\": 2, \\\"2np1p2\\\": 4, \\\"2n4n\\\": 5, \\\"p3p2n\\\": 4, \\\"f1c4\\\": 1, \\\"1p1pp1p1\\\": 3, \\\"pq3p1p\\\": 1, \\\"1bppbppp\\\": 1, \\\"q4pp1\\\": 1, \\\"p2ppk1p\\\": 1, \\\"b3a4\\\": 1, \\\"pppbp1pp\\\": 1, \\\"pbpp1pp1\\\": 1, \\\"1p2p1np\\\": 1, \\\"pp1pp1p1\\\": 4, \\\"pnp5\\\": 2, \\\"r1bq2nr\\\": 1, \\\"ppppkpp1\\\": 1, \\\"2n1p3\\\": 9, \\\"1b2p2p\\\": 1, \\\"1pppp2p\\\": 6, \\\"r4p2\\\": 2, \\\"1b1ppppp\\\": 5, \\\"n4n2\\\": 6, \\\"1ppp1p1p\\\": 4, \\\"n1p4p\\\": 1, \\\"1p1pkp2\\\": 1, \\\"p2pp1pp\\\": 5, \\\"1n3p2\\\": 3, \\\"1bpp1p1p\\\": 1, \\\"a4b5\\\": 5, \\\"r5n1\\\": 1, \\\"pp2p1b1\\\": 1, \\\"1pp1p3\\\": 3, \\\"d8g5\\\": 1, \\\"p1qppppp\\\": 2, \\\"3p1pp1\\\": 7, \\\"nqp5\\\": 2, \\\"p4n2\\\": 9, \\\"2p2pp1\\\": 6, \\\"d8h4\\\": 3, \\\"2pq3n\\\": 1, \\\"p1bn4\\\": 1, \\\"d5c4\\\": 5, \\\"rnbq1bn1\\\": 4, \\\"1ppkppp1\\\": 1, \\\"3p3r\\\": 1, \\\"pp1ppk2\\\": 1, \\\"p2pp2p\\\": 4, \\\"b5c3\\\": 1, \\\"pp2p1pp\\\": 8, \\\"1p2np2\\\": 2, \\\"1pp1pnp1\\\": 1, \\\"d8a5\\\": 3, \\\"3p1ppp\\\": 3, \\\"1n5p\\\": 2, \\\"p1n1pq2\\\": 1, \\\"1ppp1ppr\\\": 1, \\\"r1b1kbn1\\\": 4, \\\"qk\\\": 4, \\\"a3b4\\\": 2, \\\"d2d3\\\": 2, \\\"rpp2p1p\\\": 1, \\\"qp6\\\": 3, \\\"1p2p2n\\\": 1, \\\"2pp2pp\\\": 5, \\\"3b3p\\\": 2, \\\"1p4b1\\\": 2, \\\"p1pnpppp\\\": 2, \\\"d6b4\\\": 1, \\\"pp4pp\\\": 1, \\\"2ppp3\\\": 4, \\\"p1q1pp1p\\\": 1, \\\"b7\\\": 4, \\\"1pppn1p1\\\": 2, \\\"p1ppn2p\\\": 1, \\\"1p2n1p1\\\": 1, \\\"e6d8\\\": 1, \\\"2pp2p1\\\": 4, \\\"ppnbpp1p\\\": 1, \\\"pp1n1pp1\\\": 1, \\\"2pqp2p\\\": 1, \\\"p2pp3\\\": 3, \\\"1pp2ppp\\\": 4, \\\"rnbk2nr\\\": 3, \\\"f8d6\\\": 1, \\\"2ppn1p1\\\": 1, \\\"1p1b1p1p\\\": 1, \\\"c1d2\\\": 2, \\\"1rbqkb1r\\\": 8, \\\"p3n2p\\\": 1, \\\"nppp1pp1\\\": 1, \\\"a2c1\\\": 2, \\\"1pb5\\\": 1, \\\"4pq1b\\\": 1, \\\"f3d1\\\": 1, \\\"1p2n3\\\": 2, \\\"n1p3p1\\\": 3, \\\"1r2p3\\\": 1, \\\"f8c5\\\": 2, \\\"p1pp3p\\\": 2, \\\"r3n3\\\": 1, \\\"2bqkb1r\\\": 3, \\\"a5a7\\\": 1, \\\"1bp1pppp\\\": 1, \\\"n2p2p1\\\": 1, \\\"3b3n\\\": 4, \\\"2pnpp1p\\\": 2, \\\"1p5n\\\": 1, \\\"2ppp1pp\\\": 5, \\\"p1nq3p\\\": 1, \\\"2pp1p2\\\": 4, \\\"pp1np1pp\\\": 1, \\\"c6d4\\\": 1, \\\"c6b4\\\": 4, \\\"pp1npppp\\\": 1, \\\"p3p1pp\\\": 1, \\\"1pp1np1p\\\": 1, \\\"e5f3\\\": 1, \\\"1p2pn2\\\": 4, \\\"ppppp1pr\\\": 1, \\\"rnbq1k1r\\\": 1, \\\"3pbppp\\\": 3, \\\"p1pp1n2\\\": 1, \\\"2pp1p1p\\\": 2, \\\"f6e4\\\": 5, \\\"np6\\\": 13, \\\"h5e2\\\": 1, \\\"2p1p1p1\\\": 6, \\\"4pb2\\\": 2, \\\"p1p2p1p\\\": 3, \\\"1p2p2b\\\": 1, \\\"p1n2p2\\\": 3, \\\"3pp1pp\\\": 4, \\\"1q4qp\\\": 1, \\\"pp1p1p2\\\": 4, \\\"g3b3\\\": 1, \\\"ppp1p1p1\\\": 10, \\\"2npbp1p\\\": 1, \\\"3ppp1r\\\": 1, \\\"1p4pp\\\": 3, \\\"p4p1p\\\": 5, \\\"1ppbpp2\\\": 1, \\\"p2p1qpp\\\": 1, \\\"np2p2p\\\": 1, \\\"p1pp1ppr\\\": 2, \\\"f5d5\\\": 1, \\\"pn5p\\\": 1, \\\"1p1p1pp1\\\": 2, \\\"b4c6\\\": 1, \\\"5p1q\\\": 2, \\\"2ppp2p\\\": 3, \\\"h4e7\\\": 1, \\\"d4c5\\\": 2, \\\"rnbq2nr\\\": 4, \\\"pppkb1pp\\\": 1, \\\"3pp1p1\\\": 4, \\\"g5f6\\\": 1, \\\"h1g1\\\": 1, \\\"p3pp1b\\\": 1, \\\"pp1npp2\\\": 1, \\\"g3f4\\\": 2, \\\"2pp3p\\\": 5, \\\"n5q1\\\": 1, \\\"p3pppp\\\": 5, \\\"ppp4p\\\": 3, \\\"4pp1b\\\": 1, \\\"1pqppp2\\\": 1, \\\"r1bqk1n1\\\": 1, \\\"p1ppbpp1\\\": 1, \\\"2n1p2r\\\": 1, \\\"qq\\\": 8, \\\"q3pp2\\\": 1, \\\"b1p5\\\": 1, \\\"3r4\\\": 1, \\\"d3g3\\\": 1, \\\"pppbpppp\\\": 4, \\\"h6g4\\\": 5, \\\"1p2p1pp\\\": 3, \\\"2ppb3\\\": 1, \\\"r1pppp1p\\\": 5, \\\"a2b2\\\": 1, \\\"1ppppp2\\\": 6, \\\"f8a3\\\": 1, \\\"a5b4\\\": 2, \\\"2pp3n\\\": 1, \\\"d7g4\\\": 2, \\\"p1ppbppp\\\": 1, \\\"d7d6\\\": 3, \\\"4p2b\\\": 2, \\\"3q4\\\": 4, \\\"1pnp4\\\": 4, \\\"1r1q1bnr\\\": 1, \\\"d3d4\\\": 3, \\\"f8b4\\\": 2, \\\"1p5b\\\": 1, \\\"h6d2\\\": 1, \\\"pppbpp1p\\\": 2, \\\"3p2pn\\\": 3, \\\"p1n2n1b\\\": 1, \\\"1pn2p1b\\\": 1, \\\"pp2ppp1\\\": 6, \\\"g7h6\\\": 2, \\\"pppppp2\\\": 7, \\\"pp3ppp\\\": 2, \\\"pp1pnb2\\\": 1, \\\"r1p1ppp1\\\": 1, \\\"1n1qkbnr\\\": 4, \\\"f4e5\\\": 5, \\\"2rqkbnr\\\": 1, \\\"p2p1ppp\\\": 6, \\\"g5d8\\\": 2, \\\"pb6\\\": 3, \\\"1p2p1n1\\\": 2, \\\"d1g4\\\": 2, \\\"p2p1p1p\\\": 3, \\\"g4e2\\\": 1, \\\"p1pbpppp\\\": 1, \\\"3p2n1\\\": 2, \\\"np2pppp\\\": 1, \\\"3ppp2\\\": 7, \\\"p2pkpp1\\\": 1, \\\"1b4pp\\\": 1, \\\"1pp2p2\\\": 4, \\\"1ppppk1p\\\": 1, \\\"ppppp2n\\\": 1, \\\"pppqpppp\\\": 2, \\\"3p3q\\\": 2, \\\"b3p3\\\": 2, \\\"n6b\\\": 2, \\\"g1h3\\\": 2, \\\"bp5n\\\": 2, \\\"qpp5\\\": 4, \\\"a6b7\\\": 2, \\\"1pppqpp1\\\": 2, \\\"a6\\\": 1, \\\"b5c6\\\": 1, \\\"1qp5\\\": 3, \\\"b6b4\\\": 2, \\\"5p1r\\\": 1, \\\"1npp2pp\\\": 1, \\\"h5h6\\\": 2, \\\"ppp1nppp\\\": 1, \\\"1q4p1\\\": 1, \\\"pppp1kpp\\\": 4, \\\"pp2n3\\\": 1, \\\"1p1p2bp\\\": 1, \\\"1pnp1p2\\\": 1, \\\"1p1pb3\\\": 1, \\\"ppq1b2p\\\": 1, \\\"p1p1pp2\\\": 3, \\\"1ppnpp2\\\": 1, \\\"1n3pq1\\\": 1, \\\"g4d1\\\": 5, \\\"b2pb3\\\": 1, \\\"c4a3\\\": 1, \\\"c5a6\\\": 1, \\\"p4np1\\\": 2, \\\"p2pp1bp\\\": 2, \\\"1ppp4\\\": 6, \\\"d7c6\\\": 1, \\\"p1p2p2\\\": 3, \\\"1q4pn\\\": 1, \\\"np1ppp1p\\\": 1, \\\"1p1nkppp\\\": 1, \\\"1p1p1kpp\\\": 1, \\\"d7c5\\\": 1, \\\"ppppkp1p\\\": 2, \\\"r4np1\\\": 2, \\\"e7e8\\\": 2, \\\"3ppnpp\\\": 1, \\\"c8f5\\\": 1, \\\"6bp\\\": 2, \\\"2n2p1n\\\": 1, \\\"n3pp2\\\": 3, \\\"5n1b\\\": 1, \\\"2p1pn2\\\": 1, \\\"2n3p1\\\": 4, \\\"ppn1qpp1\\\": 1, \\\"bp2p3\\\": 2, \\\"ppp1np1p\\\": 1, \\\"p1pkppp1\\\": 1, \\\"1pn4p\\\": 2, \\\"1b1pp3\\\": 1, \\\"5pbp\\\": 1, \\\"3p2bn\\\": 1, \\\"1p2bpp1\\\": 1, \\\"p1ppppbp\\\": 1, \\\"n5pn\\\": 2, \\\"ppppppbp\\\": 1, \\\"pp1pnpp1\\\": 1, \\\"pp1p1p1p\\\": 7, \\\"p1p2pn1\\\": 1, \\\"rppppp1p\\\": 2, \\\"p1p1ppp1\\\": 3, \\\"h4h5\\\": 2, \\\"pp1kpppp\\\": 1, \\\"2pn4\\\": 2, \\\"pp1p2n1\\\": 1, \\\"2pqpp1p\\\": 1, \\\"h3f1\\\": 1, \\\"a2a3\\\": 2, \\\"a3a1\\\": 2, \\\"r1b1k2r\\\": 2, \\\"np2p2n\\\": 1, \\\"1b2p2q\\\": 1, \\\"h4e4\\\": 1, \\\"1ppp1pbp\\\": 2, \\\"b4b5\\\": 5, \\\"5n1r\\\": 1, \\\"p2n3r\\\": 1, \\\"r4n2\\\": 2, \\\"pp1pqppp\\\": 1, \\\"g2g3\\\": 1, \\\"2p1ppp1\\\": 2, \\\"pp1pp1qp\\\": 1, \\\"g7h8\\\": 1, \\\"1pn2qp1\\\": 1, \\\"p1ppbp1p\\\": 1, \\\"b1a3\\\": 3, \\\"pppnpppp\\\": 2, \\\"p2pb3\\\": 2, \\\"e3d4\\\": 1, \\\"rpppp1pp\\\": 2, \\\"kk\\\": 5, \\\"3p1q2\\\": 3, \\\"2b3p1\\\": 1, \\\"ppp1qp1p\\\": 1, \\\"rnk2bnr\\\": 1, \\\"d4e2\\\": 1, \\\"n2p1n2\\\": 3, \\\"bp1p2p1\\\": 1, \\\"1rbqk1nr\\\": 1, \\\"1b1p1ppp\\\": 1, \\\"p2p3q\\\": 1, \\\"2pkp1pp\\\": 1, \\\"p1pq4\\\": 1, \\\"1p1p2n1\\\": 1, \\\"r1b2bnr\\\": 1, \\\"pp2kppp\\\": 2, \\\"3pq2p\\\": 1, \\\"pp1qppp1\\\": 1, \\\"pp2p2r\\\": 2, \\\"p1pbp1pp\\\": 4, \\\"2bpp1p1\\\": 1, \\\"f6g4\\\": 3, \\\"pppppkpr\\\": 1, \\\"ppnppppp\\\": 1, \\\"2r5\\\": 1, \\\"2b4p\\\": 1, \\\"c5d6\\\": 2, \\\"npppp3\\\": 1, \\\"2p1pnpb\\\": 1, \\\"qp3p2\\\": 1, \\\"2np2p1\\\": 1, \\\"d3c4\\\": 1, \\\"r1b2qnr\\\": 1, \\\"pp1pkppp\\\": 2, \\\"b6n\\\": 2, \\\"4p1pp\\\": 2, \\\"1pppnp2\\\": 2, \\\"ppppnp1p\\\": 1, \\\"pbppppp1\\\": 2, \\\"b2e5\\\": 1, \\\"1p1pbppp\\\": 1, \\\"bq2p3\\\": 1, \\\"3n4\\\": 6, \\\"rnb1k2r\\\": 3, \\\"rnbk1b1r\\\": 4, \\\"pp1pnppp\\\": 1, \\\"2q1p3\\\": 1, \\\"p3pn2\\\": 2, \\\"1pqp1pbp\\\": 1, \\\"d8e8\\\": 1, \\\"1pp2pp1\\\": 3, \\\"1pp2ppn\\\": 1, \\\"3ppk1p\\\": 1, \\\"ppppkppp\\\": 2, \\\"e2e1\\\": 1, \\\"npp1pp1p\\\": 1, \\\"ppp2pbp\\\": 1, \\\"3pbn2\\\": 1, \\\"p1b2n1p\\\": 1, \\\"1pp1pp2\\\": 4, \\\"d1d3\\\": 1, \\\"p1pp1k2\\\": 1, \\\"p3pppr\\\": 1, \\\"1q1p4\\\": 1, \\\"pp3n2\\\": 1, \\\"n1pp1pp1\\\": 1, \\\"b5b6\\\": 1, \\\"rn6\\\": 1, \\\"rppppkpp\\\": 1, \\\"2bq1bnr\\\": 1, \\\"b6c8\\\": 1, \\\"pb2p1p1\\\": 1, \\\"2pn3n\\\": 1, \\\"e2d3\\\": 2, \\\"pp2pp2\\\": 2, \\\"p4pb1\\\": 1, \\\"rqp4p\\\": 1, \\\"1nb1kbnr\\\": 2, \\\"g4c8\\\": 1, \\\"1n4p1\\\": 1, \\\"1p1k3n\\\": 1, \\\"4ppbp\\\": 1, \\\"r1bq1b1r\\\": 6, \\\"ppp1pk1p\\\": 2, \\\"p1pppkp1\\\": 1, \\\"1rb1qbnr\\\": 1, \\\"pn3p2\\\": 2, \\\"3ppp1b\\\": 1, \\\"1pb1p3\\\": 1, \\\"1ppp2p1\\\": 3, \\\"f1e2\\\": 1, \\\"pb1pp2p\\\": 1, \\\"1p3ppb\\\": 1, \\\"ppn1p2p\\\": 1, \\\"r2p1p2\\\": 1, \\\"n1p2p1p\\\": 1, \\\"1nbqk1nr\\\": 4, \\\"1pppppb1\\\": 2, \\\"r6p\\\": 1, \\\"pb1kpppp\\\": 1, \\\"d2e1\\\": 1, \\\"pp1pq2p\\\": 1, \\\"ppq1pppp\\\": 1, \\\"pp4b1\\\": 1, \\\"n2p3p\\\": 2, \\\"b1n3p1\\\": 1, \\\"1p1pp2p\\\": 3, \\\"1p3pp1\\\": 2, \\\"n3n2p\\\": 1, \\\"h5h4\\\": 2, \\\"d6e5\\\": 1, \\\"rn2k1nr\\\": 1, \\\"pppbqp1p\\\": 1, \\\"3pp2b\\\": 1, \\\"1rbqkbr1\\\": 1, \\\"g5h4\\\": 3, \\\"p1n3pp\\\": 1, \\\"1pppp3\\\": 3, \\\"1p1ppk1p\\\": 1, \\\"n5pb\\\": 1, \\\"4pq2\\\": 2, \\\"3b2p1\\\": 3, \\\"p1p1pk1p\\\": 1, \\\"d1d4\\\": 1, \\\"1ppp1p2\\\": 2, \\\"p3b3\\\": 1, \\\"1pqkpppp\\\": 1, \\\"rn3bnr\\\": 1, \\\"b4c2\\\": 1, \\\"r6b\\\": 1, \\\"a6h6\\\": 1, \\\"rnb2bnr\\\": 3, \\\"p1pqpkp1\\\": 1, \\\"g4h5\\\": 2, \\\"ppp1pnpp\\\": 1, \\\"1pnp2p1\\\": 1, \\\"p1p1kp2\\\": 1, \\\"e4d3\\\": 1, \\\"pppkpppp\\\": 1, \\\"3ppppb\\\": 1, \\\"2n3q1\\\": 1, \\\"d4d5\\\": 5, \\\"2np1p1p\\\": 1, \\\"pppb2p1\\\": 1, \\\"h6c1\\\": 2, \\\"1ppqpp1p\\\": 2, \\\"p2p2p1\\\": 1, \\\"1q5p\\\": 1, \\\"1np3p1\\\": 1, \\\"2p3pp\\\": 2, \\\"pp1pppb1\\\": 1, \\\"3qpppp\\\": 1, \\\"2p2b2\\\": 3, \\\"n1p4r\\\": 1, \\\"d7a4\\\": 1, \\\"n2q4\\\": 1, \\\"e5e4\\\": 4, \\\"bp1p3n\\\": 1, \\\"p1p1pnpr\\\": 1, \\\"rn1qkb2\\\": 1, \\\"h3f2\\\": 3, \\\"3bb3\\\": 1, \\\"2p1pp1r\\\": 1, \\\"3pp1qp\\\": 1, \\\"p6r\\\": 1, \\\"rnb1kbn1\\\": 1, \\\"g4g8\\\": 1, \\\"1rbqkbn1\\\": 1, \\\"5r2\\\": 1, \\\"q5pp\\\": 1, \\\"pp1bppp1\\\": 2, \\\"5p1b\\\": 1, \\\"f8h6\\\": 1, \\\"npp5\\\": 2, \\\"1p1n4\\\": 1, \\\"d4f3\\\": 2, \\\"3p3b\\\": 2, \\\"1p1bpppp\\\": 1, \\\"pqpp4\\\": 1, \\\"b5e2\\\": 1, \\\"rp1p1p1p\\\": 1, \\\"2p3q1\\\": 1, \\\"2n3pp\\\": 1, \\\"2nb1qp1\\\": 1, \\\"pb3ppp\\\": 2, \\\"c4c5\\\": 1, \\\"2ppbn2\\\": 1, \\\"rnb1kbr1\\\": 3, \\\"3n3p\\\": 1, \\\"ppppppr1\\\": 1, \\\"r1bq1knr\\\": 1, \\\"bb6\\\": 1, \\\"np2pq1n\\\": 1, \\\"f3a8\\\": 1, \\\"1nbqk1n1\\\": 1, \\\"rppp1p1r\\\": 1, \\\"pbb1p2p\\\": 1, \\\"1pp1k1pr\\\": 1, \\\"rnbq2n1\\\": 1, \\\"e5d4\\\": 4, \\\"2qp3p\\\": 1, \\\"2pnpp2\\\": 1, \\\"p1p1p1pr\\\": 1, \\\"pp1npp1p\\\": 1, \\\"1bppp3\\\": 1, \\\"a5c4\\\": 1, \\\"1nbq1b1r\\\": 1, \\\"rpp1pkpp\\\": 1, \\\"p2np2p\\\": 1, \\\"bp2pppp\\\": 1, \\\"p1ppn3\\\": 1, \\\"d8f6\\\": 1, \\\"pppkp1pp\\\": 2, \\\"2n1p2p\\\": 2, \\\"4pn1p\\\": 1, \\\"h8h6\\\": 1, \\\"p1pkp1pp\\\": 1, \\\"bp3p2\\\": 1, \\\"1pn2q2\\\": 1, \\\"1qn2p2\\\": 1, \\\"p2b4\\\": 2, \\\"b4p2\\\": 3, \\\"rq2kbnr\\\": 1, \\\"e4d6\\\": 2, \\\"ppppnpp1\\\": 1, \\\"3pb3\\\": 2, \\\"pp4p1\\\": 5, \\\"3ppp1p\\\": 1, \\\"e6d7\\\": 1, \\\"rppppqp1\\\": 1, \\\"e1f2\\\": 2, \\\"p1b5\\\": 1, \\\"1pn4n\\\": 1, \\\"b3c4\\\": 1, \\\"1pppb1pp\\\": 2, \\\"4p1pn\\\": 2, \\\"3p2pq\\\": 1, \\\"n1pp4\\\": 2, \\\"2pbnppp\\\": 1, \\\"pp1pn1pp\\\": 1, \\\"pppppk2\\\": 1, \\\"p1p3pb\\\": 1, \\\"h6f8\\\": 3, \\\"2ppp2q\\\": 1, \\\"1p2pn1p\\\": 1, \\\"g4f3\\\": 2, \\\"n3b3\\\": 1, \\\"f1a6\\\": 2, \\\"1b2p3\\\": 1, \\\"b4e7\\\": 1, \\\"pp2p1bp\\\": 1, \\\"ppp1qppp\\\": 1, \\\"f4g5\\\": 2, \\\"p1npq3\\\": 1, \\\"5ppb\\\": 2, \\\"p1pk3p\\\": 1, \\\"6nn\\\": 1, \\\"h2g3\\\": 2, \\\"pp1ppnpp\\\": 1, \\\"b2b4\\\": 1, \\\"q1p1p1b1\\\": 1, \\\"g4d7\\\": 1, \\\"rp6\\\": 3, \\\"p2p2b1\\\": 1, \\\"pp3p1n\\\": 1, \\\"2p1pppr\\\": 2, \\\"2p4r\\\": 1, \\\"h3h1\\\": 1, \\\"2n3pn\\\": 1, \\\"3ppn2\\\": 2, \\\"pp2qpp1\\\": 1, \\\"1nbqk2r\\\": 1, \\\"1pp1pkpp\\\": 2, \\\"1nb1kb1r\\\": 1, \\\"r2p1ppp\\\": 1, \\\"p3p2b\\\": 1, \\\"h6e3\\\": 1, \\\"n1p3pp\\\": 1, \\\"pn3p1p\\\": 1, \\\"p2ppp1r\\\": 1, \\\"1ppppkp1\\\": 1, \\\"pppp1n2\\\": 1, \\\"1np5\\\": 1, \\\"e8f7\\\": 1, \\\"p6q\\\": 1, \\\"n3p1pn\\\": 1, \\\"1nrqkb1r\\\": 1, \\\"2pr4\\\": 1, \\\"1p2ppbp\\\": 1, \\\"g2h1\\\": 1, \\\"4q2p\\\": 1, \\\"p1n3p1\\\": 1, \\\"e5c4\\\": 2, \\\"pppqppbp\\\": 1, \\\"1pnp3p\\\": 1, \\\"a1b1\\\": 1, \\\"1ppkp1pp\\\": 2, \\\"2b1p3\\\": 2, \\\"2bqk1nr\\\": 1, \\\"r1pp1ppp\\\": 1, \\\"1p2b3\\\": 2, \\\"1b2p1p1\\\": 1, \\\"rnqk1bnr\\\": 1, \\\"c6e5\\\": 2, \\\"1p2pp1p\\\": 2, \\\"p3ppn1\\\": 1, \\\"e7g5\\\": 1, \\\"5npq\\\": 1, \\\"f5d4\\\": 1, \\\"2pkpppp\\\": 1, \\\"rnb1qbnr\\\": 1, \\\"p1pnpkpp\\\": 1, \\\"n4n1p\\\": 1, \\\"a4b4\\\": 1, \\\"pp2nppp\\\": 1, \\\"pbpkpppp\\\": 1, \\\"p1pkpp1p\\\": 1, \\\"c8g4\\\": 1, \\\"rp1pnpp1\\\": 1, \\\"p1p1p1n1\\\": 1, \\\"p1pbpp1p\\\": 1, \\\"h6g5\\\": 1, \\\"pp5p\\\": 3, \\\"rppppkp1\\\": 1, \\\"1nbq1bnr\\\": 2, \\\"a2a1\\\": 1, \\\"pppppnpp\\\": 2, \\\"4np2\\\": 1, \\\"e5f7\\\": 1, \\\"pb1pbppp\\\": 1, \\\"1pn3p1\\\": 1, \\\"n3pq2\\\": 1, \\\"2pb4\\\": 2, \\\"f6g6\\\": 1, \\\"pp1pppbp\\\": 1, \\\"1r5p\\\": 1, \\\"1p1q1p2\\\": 1, \\\"f5f6\\\": 1, \\\"pnpp4\\\": 1, \\\"5pb1\\\": 2, \\\"p4n1p\\\": 1, \\\"1ppppk2\\\": 1, \\\"4p2q\\\": 3, \\\"h5e5\\\": 1, \\\"pp1ppp1n\\\": 1, \\\"1qp3pp\\\": 1, \\\"p2p1n2\\\": 1, \\\"h7g5\\\": 2, \\\"p1p3pn\\\": 2, \\\"q3p3\\\": 2, \\\"d1a4\\\": 1, \\\"1pppnppp\\\": 1, \\\"5pnp\\\": 1, \\\"p3p2q\\\": 1, \\\"2n4r\\\": 1, \\\"ppp2p2\\\": 2, \\\"d8e7\\\": 2, \\\"p2pn1pp\\\": 1, \\\"d8b6\\\": 1, \\\"2qpp1pp\\\": 1, \\\"2qppp1p\\\": 1, \\\"a7a6\\\": 2, \\\"d3b5\\\": 2, \\\"1p1qn3\\\": 1, \\\"d3e3\\\": 1, \\\"np2p3\\\": 1, \\\"p1pq1p1p\\\": 1, \\\"1pq1ppp1\\\": 1, \\\"p1np1n1b\\\": 1, \\\"2rqk1nr\\\": 1, \\\"ppp2npp\\\": 1, \\\"pppn1ppp\\\": 2, \\\"d2f3\\\": 1, \\\"2pnppp1\\\": 1, \\\"p2pb2p\\\": 1, \\\"1nk2p2\\\": 1, \\\"pp1b2pp\\\": 1, \\\"b2a3\\\": 2, \\\"ppnpppp1\\\": 1, \\\"2n2ppp\\\": 1, \\\"rnbqkn1r\\\": 1, \\\"1p3n1p\\\": 3, \\\"h8f8\\\": 1, \\\"1p1p1pb1\\\": 1, \\\"pp1ppkpp\\\": 1, \\\"pppp2pr\\\": 1, \\\"p3pppn\\\": 1, \\\"p1ppkppp\\\": 1, \\\"1bn1p3\\\": 1, \\\"r1p5\\\": 2, \\\"n4p1p\\\": 2, \\\"n1p2n2\\\": 1, \\\"1ppbpp1p\\\": 1, \\\"p2np3\\\": 1, \\\"pppkp1p1\\\": 3, \\\"pppnpp1p\\\": 1, \\\"b4c5\\\": 1, \\\"1p1n3p\\\": 1, \\\"p1ppn1pp\\\": 1, \\\"n3p1pb\\\": 1, \\\"pp1bpppr\\\": 1, \\\"r2qkbn1\\\": 1, \\\"3bp1p1\\\": 1, \\\"d3f1\\\": 1, \\\"1pp1p1bp\\\": 1, \\\"1p3p1p\\\": 3, \\\"2pb3p\\\": 1, \\\"f2g3\\\": 2, \\\"b5pn\\\": 1, \\\"r6n\\\": 1, \\\"a3f3\\\": 1, \\\"p2b3p\\\": 1, \\\"r1ppppp1\\\": 1, \\\"2p1n2p\\\": 1, \\\"f7d8\\\": 1, \\\"pp1pbppp\\\": 1, \\\"2p3n1\\\": 3, \\\"f3g4\\\": 1, \\\"1pp1q3\\\": 1, \\\"1bppp1pp\\\": 2, \\\"p2n4\\\": 1, \\\"b4nn1\\\": 1, \\\"p3pp1p\\\": 3, \\\"1ppp1n2\\\": 1, \\\"d6f4\\\": 1, \\\"c5e4\\\": 1, \\\"rnb1kbnn\\\": 1, \\\"pq6\\\": 2, \\\"b4d6\\\": 1, \\\"b1n2p2\\\": 1, \\\"pb3pp1\\\": 1, \\\"ppp1p3\\\": 1, \\\"pq2b3\\\": 1, \\\"b5a4\\\": 1, \\\"1ppbp1pp\\\": 1, \\\"b2p1p2\\\": 1, \\\"n2qp3\\\": 1, \\\"b7a6\\\": 1, \\\"2nk1p2\\\": 1, \\\"ppppb1pp\\\": 1, \\\"c6d8\\\": 1, \\\"r1p3pp\\\": 1, \\\"d6d5\\\": 3, \\\"2b3pp\\\": 1, \\\"1ppp1p1r\\\": 1, \\\"rnbqk3\\\": 1, \\\"g4h3\\\": 2, \\\"3q3p\\\": 2, \\\"1rbk1bnr\\\": 1, \\\"1bppkpp1\\\": 1, \\\"r3p3\\\": 1, \\\"b8d7\\\": 1, \\\"1p2npq1\\\": 1, \\\"e4c3\\\": 1, \\\"2p4b\\\": 1, \\\"a8a5\\\": 1, \\\"p2qpp1p\\\": 1, \\\"np1p2p1\\\": 1, \\\"p6b\\\": 2, \\\"h3f4\\\": 1, \\\"p1pbpp2\\\": 1, \\\"1p4pb\\\": 2, \\\"ppp1pkpp\\\": 2, \\\"1p4pq\\\": 1, \\\"c5b3\\\": 1, \\\"1p1p1ppp\\\": 2, \\\"pnp2p2\\\": 1, \\\"ppp3bp\\\": 1, \\\"pbpnp1p1\\\": 1, \\\"2np1p1n\\\": 1, \\\"n2p1p2\\\": 1, \\\"2b1k1nr\\\": 1, \\\"1pppqppp\\\": 1, \\\"r1nbp3\\\": 1, \\\"qpp2p2\\\": 1, \\\"2q5\\\": 1, \\\"1qp2p2\\\": 1, \\\"p1np1n2\\\": 1, \\\"rnq1kbnr\\\": 1, \\\"2p3qb\\\": 1, \\\"p1pb4\\\": 1, \\\"rnq1kb1r\\\": 1, \\\"p4pbp\\\": 1, \\\"3q3n\\\": 1, \\\"rn2kbr1\\\": 1, \\\"1q1p3p\\\": 1, \\\"2pn1p2\\\": 1, \\\"pbp1pp2\\\": 1, \\\"2n2pp1\\\": 2, \\\"2p1ppbp\\\": 1, \\\"n5k1\\\": 1, \\\"f5g6\\\": 1, \\\"1p1b3r\\\": 1, \\\"p2p1p1n\\\": 1, \\\"rp2p1pp\\\": 1, \\\"1n1qkb1r\\\": 1, \\\"pp1kppbp\\\": 1, \\\"g7d4\\\": 1, \\\"ppppqpp1\\\": 1, \\\"pbpp2pp\\\": 1, \\\"p4npp\\\": 1, \\\"pp2ppb1\\\": 1, \\\"g7a1\\\": 1, \\\"p4pn1\\\": 1, \\\"1n3n2\\\": 1, \\\"1n2p3\\\": 1, \\\"4k1p1\\\": 1, \\\"5kp1\\\": 1, \\\"rnbq3r\\\": 2, \\\"a6e2\\\": 1, \\\"2p1p1pp\\\": 2, \\\"ppn2p2\\\": 1, \\\"g6h5\\\": 2, \\\"2pp1pnp\\\": 1, \\\"c4b3\\\": 1, \\\"p2pp1p1\\\": 3, \\\"1pp4p\\\": 1, \\\"pbp1ppp1\\\": 1, \\\"ppp1ppb1\\\": 1, \\\"r1bqknnr\\\": 1, \\\"ppqppppp\\\": 2, \\\"1b2p1pp\\\": 1, \\\"a6g6\\\": 1, \\\"1bp1ppp1\\\": 1, \\\"ppnq4\\\": 1, \\\"p3q1p1\\\": 1, \\\"b6c5\\\": 1, \\\"ppqp2pp\\\": 1, \\\"5ppn\\\": 1, \\\"1pppppbp\\\": 1, \\\"r2bpppp\\\": 1, \\\"n2q1n2\\\": 1, \\\"p1pppppn\\\": 1, \\\"1b1p4\\\": 1, \\\"p1p1p2n\\\": 1, \\\"n2p1ppp\\\": 1, \\\"p1p2n1p\\\": 1, \\\"1ppnpp1p\\\": 1, \\\"4p1b1\\\": 1, \\\"pppp1pq1\\\": 1, \\\"b5pp\\\": 1, \\\"b2p1q1n\\\": 1, \\\"ppp1k1pp\\\": 2, \\\"rnb4r\\\": 1, \\\"a3c5\\\": 1, \\\"4p1n1\\\": 1, \\\"pp1n4\\\": 1, \\\"r1b1qbnr\\\": 1, \\\"rp1ppppp\\\": 1, \\\"p1pqp1pp\\\": 1, \\\"d5e5\\\": 1, \\\"pbqppppp\\\": 1, \\\"rnb2k1r\\\": 1, \\\"p2b3n\\\": 1, \\\"1ppb2p1\\\": 1, \\\"q2p4\\\": 2, \\\"1pn2n2\\\": 1, \\\"1pn1p1p1\\\": 1, \\\"p1pp1kpp\\\": 1, \\\"rnbqnb1r\\\": 1, \\\"p2p1n1p\\\": 1, \\\"rpp1ppp1\\\": 1, \\\"1nbqkbr1\\\": 1, \\\"1p1qpppp\\\": 1, \\\"rn1q2nr\\\": 1, \\\"1b2pb2\\\": 1, \\\"p5kp\\\": 1, \\\"2pq2pb\\\": 1, \\\"p1np3b\\\": 1, \\\"g4h6\\\": 1, \\\"p3qppp\\\": 1, \\\"2pb1qpp\\\": 1, \\\"pp1pnp2\\\": 1, \\\"p2p1np1\\\": 1, \\\"pp1pp2r\\\": 1, \\\"2p1p2n\\\": 1, \\\"rp1ppk1p\\\": 1, \\\"r1bq1rk1\\\": 1, \\\"p1n1pnp1\\\": 1, \\\"1b1n4\\\": 1, \\\"q1p4p\\\": 1, \\\"d4c6\\\": 2, \\\"2p1pnp1\\\": 1, \\\"a3c4\\\": 1, \\\"p5n1\\\": 1, \\\"2p3np\\\": 1, \\\"1n1p3p\\\": 1, \\\"bp3n2\\\": 1, \\\"bpn3pn\\\": 1, \\\"a3c1\\\": 1, \\\"4k3\\\": 1, \\\"e3e4\\\": 1, \\\"ppqp3p\\\": 1, \\\"1p1pq1pp\\\": 1, \\\"p5pn\\\": 2, \\\"b4c3\\\": 1, \\\"pb1ppp2\\\": 1, \\\"1bp4q\\\": 1, \\\"rnb3nr\\\": 1, \\\"h5c5\\\": 1, \\\"1q3p1p\\\": 1, \\\"c4b6\\\": 1, \\\"p1n2ppn\\\": 1, \\\"3pn1pp\\\": 1, \\\"p1pb1p2\\\": 1, \\\"r2p2p1\\\": 1, \\\"1p1k1ppp\\\": 1, \\\"1pnb4\\\": 1, \\\"d5c6\\\": 1, \\\"p3bn2\\\": 1, \\\"ppkpppp1\\\": 1, \\\"d4d6\\\": 1, \\\"n5r1\\\": 1, \\\"3p1p1n\\\": 1, \\\"h4g6\\\": 1, \\\"4n2b\\\": 1, \\\"e3d1\\\": 2, \\\"n1ppp2n\\\": 1, \\\"pppnp2p\\\": 1, \\\"4bp2\\\": 1, \\\"n3pn2\\\": 1, \\\"d4e3\\\": 1, \\\"rp2pp1p\\\": 1, \\\"p1p2n2\\\": 1, \\\"4b2p\\\": 1, \\\"2npp3\\\": 1, \\\"rp2p3\\\": 1, \\\"p1n2n2\\\": 1, \\\"p2n1p1p\\\": 1, \\\"ppp1p1kp\\\": 1, \\\"e6d5\\\": 1, \\\"3p1pbp\\\": 1, \\\"p1n2pp1\\\": 1, \\\"d1c2\\\": 1, \\\"c6c5\\\": 1, \\\"ppp4n\\\": 1, \\\"pppppkp1\\\": 1, \\\"p2pbp1p\\\": 1, \\\"2n1pn2\\\": 1, \\\"h4f4\\\": 1, \\\"p1qp1p1p\\\": 1, \\\"ppp1k2p\\\": 1, \\\"f5g5\\\": 1, \\\"rnb1k1n1\\\": 1, \\\"2b1p2p\\\": 1, \\\"n2qbnp1\\\": 1, \\\"r3kb1r\\\": 1, \\\"f3g5\\\": 1, \\\"2pp2b1\\\": 1, \\\"pp1k1ppp\\\": 1, \\\"bpp4n\\\": 1, \\\"1p1n1p2\\\": 1, \\\"3p1pnn\\\": 1, \\\"r2pp2p\\\": 1, \\\"rnb1kqnr\\\": 1, \\\"bn6\\\": 1, \\\"pppp1p1n\\\": 1, \\\"1p1pn3\\\": 1, \\\"pb2pp1p\\\": 1, \\\"rp5p\\\": 1, \\\"1bppppp1\\\": 1, \\\"p1pp1kp1\\\": 1, \\\"1pn1pp1p\\\": 1, \\\"p1pq2p1\\\": 1, \\\"pb1p1ppp\\\": 1, \\\"n4q1p\\\": 1, \\\"2b2p2\\\": 1, \\\"2p1b3\\\": 1, \\\"rn1qkbn1\\\": 2, \\\"h5f6\\\": 1, \\\"pp1kpp1n\\\": 1, \\\"c4d3\\\": 1, \\\"6q1\\\": 2, \\\"ppb1p1b1\\\": 1, \\\"1n2pp2\\\": 1, \\\"ppp1bnpp\\\": 1, \\\"pb1p1p2\\\": 1, \\\"pppq1p1p\\\": 1, \\\"2n1p1pr\\\": 1, \\\"1p1q1p1b\\\": 1, \\\"p2bpp1p\\\": 1, \\\"ppppp1bp\\\": 1, \\\"1p2ppp1\\\": 1, \\\"2pn2bp\\\": 1, \\\"p2pp2n\\\": 1, \\\"1pp3pp\\\": 1, \\\"c8h3\\\": 1, \\\"4pp1r\\\": 1, \\\"4pp1n\\\": 1, \\\"pp1k2pp\\\": 1, \\\"rnbq1br1\\\": 1, \\\"p3k1p1\\\": 1, \\\"qpp3p1\\\": 1, \\\"rn1qkbqr\\\": 1, \\\"g8h8\\\": 1, \\\"f6f5\\\": 1, \\\"e5g6\\\": 1, \\\"nb3p2\\\": 1, \\\"rbbqk1nr\\\": 1, \\\"rnq2bnr\\\": 1, \\\"p1p1pppn\\\": 1, \\\"pppppppr\\\": 1, \\\"p3bp1n\\\": 1, \\\"1p1p2pq\\\": 1, \\\"p1nq3b\\\": 1, \\\"r3k1nr\\\": 1, \\\"g8e7\\\": 1, \\\"p5b1\\\": 1, \\\"np3n2\\\": 1, \\\"1b5p\\\": 1, \\\"2np1np1\\\": 1, \\\"1pp1pp1r\\\": 1, \\\"p4b2\\\": 1, \\\"1ppnpppp\\\": 1, \\\"1n4pn\\\": 1, \\\"r1pppppp\\\": 1, \\\"b6a8\\\": 1, \\\"1qp1p1p1\\\": 1, \\\"2n2b2\\\": 1, \\\"r2pppbp\\\": 1}\", \"word_docs\": \"{\\\"ppppp1p1\\\": 14, \\\"5p1p\\\": 25, \\\"pbpppppp\\\": 5, \\\"1p6\\\": 112, \\\"3\\\": 178, \\\"1\\\": 275, \\\"8\\\": 679, \\\"e7e5\\\": 91, \\\"rn1qkbnr\\\": 91, \\\"rnbqkbnr\\\": 450, \\\"kqkq\\\": 676, \\\"b\\\": 551, \\\"r1bqkbnr\\\": 206, \\\"r1bqkb1r\\\": 63, \\\"7n\\\": 55, \\\"6\\\": 138, \\\"b3a1\\\": 3, \\\"p1p3p1\\\": 5, \\\"7p\\\": 107, \\\"nn1ppp2\\\": 1, \\\"pppppp1p\\\": 39, \\\"6p1\\\": 113, \\\"4pp2\\\": 20, \\\"w\\\": 449, \\\"5\\\": 136, \\\"p2p1b2\\\": 3, \\\"1p3q2\\\": 2, \\\"p1pp2pp\\\": 6, \\\"2p1pppp\\\": 5, \\\"d4e5\\\": 6, \\\"rnb1kbnr\\\": 86, \\\"p1ppppp1\\\": 14, \\\"4\\\": 151, \\\"n6p\\\": 9, \\\"5p2\\\": 121, \\\"2p3p1\\\": 23, \\\"0\\\": 570, \\\"pp1pp2p\\\": 11, \\\"g5g4\\\": 12, \\\"pppb1ppp\\\": 2, \\\"4p3\\\": 141, \\\"3bppp1\\\": 1, \\\"rnbqk1nr\\\": 67, \\\"c2c4\\\": 8, \\\"2\\\": 246, \\\"3p4\\\": 149, \\\"pppp3p\\\": 3, \\\"5n2\\\": 56, \\\"pppppppp\\\": 120, \\\"d2d4\\\": 60, \\\"ppp1pppp\\\": 59, \\\"rnbqkb1r\\\": 211, \\\"p2ppppp\\\": 14, \\\"g4g5\\\": 7, \\\"p1p5\\\": 21, \\\"3p2p1\\\": 29, \\\"1p2p2p\\\": 3, \\\"rn2kbnr\\\": 16, \\\"2pq1p2\\\": 1, \\\"bp3q2\\\": 1, \\\"5np1\\\": 5, \\\"pppp1pp1\\\": 17, \\\"4p2p\\\": 30, \\\"p7\\\": 128, \\\"1ppppppp\\\": 46, \\\"kkq\\\": 42, \\\"b7h1\\\": 3, \\\"1p3np1\\\": 1, \\\"p1pppp1p\\\": 22, \\\"pbpppp1p\\\": 2, \\\"rn1qkb1r\\\": 34, \\\"np4p1\\\": 1, \\\"h7h6\\\": 2, \\\"3p1n2\\\": 8, \\\"1p1ppppp\\\": 15, \\\"p1p3b1\\\": 1, \\\"d7d5\\\": 78, \\\"2n5\\\": 46, \\\"pp1ppppp\\\": 49, \\\"n1p5\\\": 7, \\\"p1pppppp\\\": 44, \\\"4n3\\\": 5, \\\"a6b4\\\": 5, \\\"pp1p1ppp\\\": 18, \\\"q1p1p3\\\": 2, \\\"f3e5\\\": 1, \\\"5n1p\\\": 8, \\\"ppp1ppp1\\\": 15, \\\"pppp2pp\\\": 14, \\\"e4e5\\\": 4, \\\"pp1pp3\\\": 3, \\\"rnb1k1nr\\\": 20, \\\"2p1p3\\\": 21, \\\"3p2q1\\\": 2, \\\"h6h5\\\": 3, \\\"ppp1bppp\\\": 2, \\\"3qkbnr\\\": 3, \\\"kq\\\": 117, \\\"rpp1pppp\\\": 2, \\\"2p4p\\\": 21, \\\"p2p3b\\\": 1, \\\"pp1pppp1\\\": 20, \\\"n4nr1\\\": 1, \\\"r1bqkb2\\\": 3, \\\"1p5p\\\": 23, \\\"pppp2p1\\\": 4, \\\"rppppppp\\\": 3, \\\"kqk\\\": 35, \\\"e2e4\\\": 58, \\\"6b1\\\": 8, \\\"1nbqkbnr\\\": 29, \\\"2p1p2p\\\": 7, \\\"7\\\": 129, \\\"bp4pn\\\": 1, \\\"a3e7\\\": 3, \\\"pp1pqpp1\\\": 1, \\\"c7c6\\\": 10, \\\"3pp3\\\": 20, \\\"ppp2ppp\\\": 22, \\\"1pppp1pp\\\": 14, \\\"6np\\\": 3, \\\"p4p2\\\": 19, \\\"p1pp1p2\\\": 7, \\\"1p2p1p1\\\": 5, \\\"g3h1\\\": 1, \\\"p1p4p\\\": 3, \\\"7r\\\": 5, \\\"qkq\\\": 44, \\\"n5p1\\\": 6, \\\"1p1pppp1\\\": 5, \\\"rnbqkbn1\\\": 21, \\\"r2qkbnr\\\": 37, \\\"1pp1pp1p\\\": 3, \\\"f5h3\\\": 1, \\\"p1pkpppp\\\": 4, \\\"c4e5\\\": 1, \\\"1pn5\\\": 11, \\\"n6n\\\": 9, \\\"r1bq1br1\\\": 1, \\\"1p1p4\\\": 17, \\\"p2p1pp1\\\": 3, \\\"ppp1pp1p\\\": 19, \\\"1ppp1ppp\\\": 16, \\\"3p3n\\\": 5, \\\"2p4n\\\": 9, \\\"c6b5\\\": 2, \\\"1b6\\\": 4, \\\"np2pp2\\\": 2, \\\"r1bqk1nr\\\": 18, \\\"2p5\\\": 119, \\\"pp1pp1pp\\\": 21, \\\"ppppppp1\\\": 46, \\\"c8a6\\\": 1, \\\"b4n2\\\": 1, \\\"g2g4\\\": 1, \\\"3p3p\\\": 28, \\\"3p1p2\\\": 22, \\\"pppq3p\\\": 1, \\\"ppp2pp1\\\": 6, \\\"4p1q1\\\": 3, \\\"n2p3n\\\": 1, \\\"p1p1pppp\\\": 17, \\\"f1b5\\\": 2, \\\"p1pp1pp1\\\": 7, \\\"h2h4\\\": 1, \\\"p2ppp1n\\\": 1, \\\"rnbq1b1r\\\": 11, \\\"pppk1ppp\\\": 2, \\\"1pp3pb\\\": 1, \\\"pp6\\\": 22, \\\"pbpp1p1p\\\": 2, \\\"rnbq1bnr\\\": 33, \\\"1ppp1kpp\\\": 1, \\\"3qp1p1\\\": 1, \\\"d3d5\\\": 1, \\\"6pn\\\": 10, \\\"2b5\\\": 7, \\\"pp1p3p\\\": 4, \\\"rnbqk1r1\\\": 4, \\\"d1e2\\\": 1, \\\"2p2pn1\\\": 1, \\\"pppp1ppp\\\": 61, \\\"2n2n1p\\\": 1, \\\"4pn2\\\": 6, \\\"ppb1p3\\\": 1, \\\"1nb1k1nr\\\": 1, \\\"1qpp4\\\": 2, \\\"2pp1ppp\\\": 7, \\\"5bp1\\\": 1, \\\"1r3q2\\\": 1, \\\"k\\\": 14, \\\"pp2pp1p\\\": 7, \\\"f3f5\\\": 1, \\\"rn1k1bnr\\\": 1, \\\"rnbqk2r\\\": 18, \\\"kqq\\\": 35, \\\"4pnp1\\\": 2, \\\"e5f4\\\": 6, \\\"ppppb2p\\\": 1, \\\"rn1qk1nr\\\": 9, \\\"rnbqk1n1\\\": 3, \\\"pbppppb1\\\": 1, \\\"p1p2ppr\\\": 1, \\\"c4b5\\\": 3, \\\"1pbpp1pp\\\": 1, \\\"pppp1p1p\\\": 25, \\\"4p2n\\\": 9, \\\"7b\\\": 8, \\\"ppppbppp\\\": 2, \\\"g5h6\\\": 1, \\\"q1p2p2\\\": 1, \\\"ppp1p2p\\\": 8, \\\"c8e6\\\": 2, \\\"2n1b1p1\\\": 1, \\\"r1b1k1nr\\\": 6, \\\"pp1ppp1p\\\": 13, \\\"p2bpppp\\\": 1, \\\"g7g6\\\": 8, \\\"3ppppp\\\": 13, \\\"r7\\\": 6, \\\"ppp5\\\": 7, \\\"ppp1p1pp\\\": 12, \\\"rnb1kb1r\\\": 23, \\\"q7\\\": 5, \\\"ppppp2p\\\": 18, \\\"2p3pn\\\": 2, \\\"p6n\\\": 6, \\\"3n1p2\\\": 1, \\\"rnbq1b2\\\": 1, \\\"pp1pk1pr\\\": 1, \\\"q\\\": 7, \\\"pppnppp1\\\": 1, \\\"c3d4\\\": 1, \\\"2p1pp1n\\\": 1, \\\"r1bqkbr1\\\": 13, \\\"1pp1ppbp\\\": 1, \\\"g3g4\\\": 2, \\\"p5p1\\\": 21, \\\"pp1ppp2\\\": 5, \\\"p3p3\\\": 10, \\\"p1pp1p1p\\\": 8, \\\"r1bq1bnr\\\": 13, \\\"b5b4\\\": 4, \\\"b5p1\\\": 1, \\\"2ppkppp\\\": 1, \\\"1p2p3\\\": 13, \\\"p1ppp1p1\\\": 9, \\\"rnbq1knr\\\": 3, \\\"b8a6\\\": 3, \\\"b2p4\\\": 1, \\\"3q1n2\\\": 1, \\\"6pb\\\": 10, \\\"pp2p2p\\\": 3, \\\"e7e6\\\": 17, \\\"r3kbnr\\\": 6, \\\"ppp1q1pp\\\": 1, \\\"2np4\\\": 3, \\\"2p2p2\\\": 21, \\\"1p1pp3\\\": 10, \\\"p3pp2\\\": 6, \\\"r1b1kbnr\\\": 33, \\\"5npp\\\": 2, \\\"ppp1p1pr\\\": 1, \\\"2n4p\\\": 8, \\\"r1bqkbn1\\\": 6, \\\"g6h7\\\": 1, \\\"3pqp2\\\": 1, \\\"f4e3\\\": 3, \\\"ppp1pp2\\\": 8, \\\"g8f6\\\": 21, \\\"ppppp1pp\\\": 51, \\\"rnbqkbr1\\\": 28, \\\"p1p2ppp\\\": 4, \\\"f8e7\\\": 1, \\\"4q3\\\": 2, \\\"b2pp3\\\": 1, \\\"a4c2\\\": 1, \\\"1p3p2\\\": 25, \\\"p2ppkpp\\\": 2, \\\"q6p\\\": 3, \\\"p1p1p1p1\\\": 3, \\\"p1ppp2r\\\": 2, \\\"1p1p1p1p\\\": 7, \\\"b4p1p\\\": 1, \\\"1p4q1\\\": 2, \\\"h4g5\\\": 5, \\\"p1pp1ppp\\\": 17, \\\"p1n4n\\\": 1, \\\"nppppp2\\\": 1, \\\"2ppppp1\\\": 3, \\\"6pp\\\": 12, \\\"1p1ppp1p\\\": 10, \\\"2bp4\\\": 3, \\\"pb4p1\\\": 1, \\\"1qp1p3\\\": 2, \\\"1ppppp1p\\\": 12, \\\"e6e5\\\": 3, \\\"2pppppp\\\": 20, \\\"pp5n\\\": 3, \\\"ppp2p1p\\\": 11, \\\"1pp1p1pp\\\": 7, \\\"h2h3\\\": 3, \\\"1ppp2pp\\\": 6, \\\"2p2n2\\\": 10, \\\"h5h3\\\": 1, \\\"7q\\\": 5, \\\"1p2pppp\\\": 8, \\\"c4d5\\\": 8, \\\"1pp1pppp\\\": 20, \\\"p2p4\\\": 12, \\\"f7f6\\\": 1, \\\"a3f8\\\": 1, \\\"b1np4\\\": 1, \\\"pppb1p2\\\": 1, \\\"n3p2p\\\": 1, \\\"1p1p2p1\\\": 4, \\\"1r1qkbnr\\\": 1, \\\"5pp1\\\": 20, \\\"p1n5\\\": 10, \\\"pppppn2\\\": 1, \\\"f2d1\\\": 1, \\\"5b2\\\": 3, \\\"2n2p2\\\": 5, \\\"1rbqkbnr\\\": 15, \\\"3p2pp\\\": 8, \\\"c5b4\\\": 5, \\\"rnb1k3\\\": 1, \\\"2bn4\\\": 1, \\\"1p1qp1p1\\\": 1, \\\"ppppqppr\\\": 1, \\\"pppppkpp\\\": 5, \\\"pp1p2pp\\\": 8, \\\"2p1pp2\\\": 4, \\\"1n6\\\": 6, \\\"c3b4\\\": 4, \\\"1pppppp1\\\": 19, \\\"n3p3\\\": 7, \\\"p6p\\\": 16, \\\"e3\\\": 1, \\\"3pppp1\\\": 1, \\\"n7\\\": 50, \\\"1pp2p1p\\\": 3, \\\"pp2p1p1\\\": 3, \\\"rnbqkb2\\\": 5, \\\"1n5r\\\": 1, \\\"1p1n3b\\\": 1, \\\"n4p2\\\": 9, \\\"b2h8\\\": 5, \\\"pbppp1pp\\\": 4, \\\"p1p1p3\\\": 4, \\\"3b4\\\": 2, \\\"2p2q1n\\\": 1, \\\"1nbqkb1r\\\": 16, \\\"rp1p1ppp\\\": 2, \\\"f3e4\\\": 1, \\\"p4p1b\\\": 1, \\\"qn2n3\\\": 1, \\\"r1bk1bnr\\\": 2, \\\"r2k1bnr\\\": 1, \\\"a5a4\\\": 1, \\\"1p1pp1pp\\\": 5, \\\"pp2pppp\\\": 14, \\\"q1p5\\\": 3, \\\"d1h5\\\": 8, \\\"2ppp1p1\\\": 6, \\\"1p3ppp\\\": 2, \\\"1ppp1pp1\\\": 2, \\\"p3p2p\\\": 6, \\\"2n2n2\\\": 8, \\\"c1g5\\\": 1, \\\"npp2np1\\\": 1, \\\"q1p1p1p1\\\": 1, \\\"1rb1kbnr\\\": 2, \\\"rn2kb1r\\\": 1, \\\"1p4p1\\\": 20, \\\"p1pqpp2\\\": 2, \\\"1p1p3p\\\": 9, \\\"3p1n1p\\\": 1, \\\"1ppbpppp\\\": 1, \\\"p2p3n\\\": 1, \\\"p1pn4\\\": 1, \\\"rp1pppp1\\\": 1, \\\"pp1n1ppp\\\": 1, \\\"1b1n1ppp\\\": 1, \\\"3pp2n\\\": 1, \\\"pq1p1ppp\\\": 1, \\\"1pp5\\\": 18, \\\"c8b7\\\": 10, \\\"e2e3\\\": 12, \\\"2nq4\\\": 2, \\\"p1p2ppn\\\": 1, \\\"g5e4\\\": 2, \\\"ppppp1b1\\\": 2, \\\"1p1pp1bp\\\": 2, \\\"6n1\\\": 4, \\\"rpp1p1pp\\\": 1, \\\"2n2pb1\\\": 1, \\\"p5pp\\\": 9, \\\"1p2pp2\\\": 6, \\\"n2p4\\\": 7, \\\"rppp1pp1\\\": 1, \\\"h3g4\\\": 3, \\\"1n1p4\\\": 1, \\\"pp1p2p1\\\": 6, \\\"p1p1pp1p\\\": 9, \\\"3pp2p\\\": 2, \\\"2pn1p1p\\\": 1, \\\"h7h5\\\": 2, \\\"pbnpppp1\\\": 1, \\\"1p3n2\\\": 9, \\\"d8c7\\\": 1, \\\"ppppqp1p\\\": 2, \\\"4p1p1\\\": 28, \\\"p4p1n\\\": 2, \\\"1ppp3p\\\": 2, \\\"e2h5\\\": 1, \\\"c1b2\\\": 11, \\\"2n3pb\\\": 2, \\\"ppp1ppbp\\\": 2, \\\"6pq\\\": 1, \\\"g8h6\\\": 3, \\\"g1f3\\\": 21, \\\"2pppp2\\\": 2, \\\"pp3pp1\\\": 3, \\\"n5pp\\\": 1, \\\"rnbk1bnr\\\": 5, \\\"rp1pp3\\\": 2, \\\"f1g2\\\": 15, \\\"pp3p1p\\\": 5, \\\"a6d3\\\": 1, \\\"bpp5\\\": 1, \\\"3b1pp1\\\": 1, \\\"ppp3pp\\\": 3, \\\"3ppb2\\\": 1, \\\"pppp1ppr\\\": 2, \\\"f4h5\\\": 1, \\\"pppbkpp1\\\": 1, \\\"rn1q1b1r\\\": 2, \\\"p1p1npp1\\\": 1, \\\"b6p\\\": 2, \\\"b5c4\\\": 13, \\\"p1p4n\\\": 1, \\\"p1p1p1pp\\\": 4, \\\"pppp1p2\\\": 8, \\\"2p3b1\\\": 2, \\\"f6g5\\\": 4, \\\"r1q1kbnr\\\": 1, \\\"p2p2pp\\\": 2, \\\"2np3p\\\": 3, \\\"p4ppp\\\": 1, \\\"c2c3\\\": 5, \\\"1pp3p1\\\": 3, \\\"bp6\\\": 4, \\\"pbp1pppp\\\": 2, \\\"1pppp1p1\\\": 6, \\\"1q2p3\\\": 1, \\\"1p1p2pp\\\": 2, \\\"p2kpppp\\\": 1, \\\"1pn1b3\\\": 1, \\\"r2q1bnr\\\": 4, \\\"pp3p2\\\": 5, \\\"d2e3\\\": 2, \\\"4n2p\\\": 6, \\\"n4bp1\\\": 1, \\\"1p1ppp2\\\": 5, \\\"b4pp1\\\": 1, \\\"p1ppp2p\\\": 7, \\\"r1p2n2\\\": 1, \\\"f7g6\\\": 1, \\\"p2pppp1\\\": 5, \\\"b8c6\\\": 10, \\\"ppppqppp\\\": 3, \\\"p1ppp3\\\": 2, \\\"1n3p1p\\\": 2, \\\"1p4pn\\\": 2, \\\"p1ppp1pp\\\": 16, \\\"rppp1ppp\\\": 1, \\\"2n1p2n\\\": 2, \\\"2bqk2r\\\": 1, \\\"p1b4p\\\": 1, \\\"1bppp1p1\\\": 2, \\\"f8g7\\\": 12, \\\"a8b8\\\": 1, \\\"2p2ppp\\\": 4, \\\"n4np1\\\": 1, \\\"r2qk2r\\\": 1, \\\"pp1p4\\\": 5, \\\"1n1p1p2\\\": 1, \\\"2pppp1p\\\": 5, \\\"b1c3\\\": 10, \\\"f6h5\\\": 1, \\\"2p4q\\\": 1, \\\"pp1ppppr\\\": 4, \\\"4pp1p\\\": 4, \\\"g5f4\\\": 6, \\\"1pn4b\\\": 1, \\\"c3d1\\\": 1, \\\"1n3ppp\\\": 1, \\\"ppppp3\\\": 4, \\\"2p2p1p\\\": 4, \\\"r1bqk2r\\\": 12, \\\"pppp2bp\\\": 1, \\\"p1qp4\\\": 1, \\\"1n2p1p1\\\": 1, \\\"5p1n\\\": 8, \\\"4b3\\\": 3, \\\"p1pnppp1\\\": 2, \\\"2p1pp1p\\\": 5, \\\"ppppn1p1\\\": 1, \\\"pb1pppp1\\\": 1, \\\"3p1p1p\\\": 5, \\\"1pp1p1p1\\\": 4, \\\"3p2pb\\\": 2, \\\"f3d4\\\": 2, \\\"r2qkb1r\\\": 6, \\\"pq1ppppp\\\": 1, \\\"2pp4\\\": 19, \\\"n3b2n\\\": 1, \\\"c7c5\\\": 10, \\\"pppkppp1\\\": 1, \\\"1p1p1p2\\\": 3, \\\"2b1kb1r\\\": 1, \\\"nr5n\\\": 1, \\\"f5g4\\\": 5, \\\"p1ppqp1p\\\": 2, \\\"p1p2pp1\\\": 3, \\\"np1qp3\\\": 1, \\\"1pppq2p\\\": 3, \\\"p3p1p1\\\": 8, \\\"3p2np\\\": 3, \\\"f2f3\\\": 1, \\\"pn6\\\": 1, \\\"1p2bp1n\\\": 1, \\\"p1qkpp1p\\\": 1, \\\"e6f5\\\": 2, \\\"1pn3pn\\\": 1, \\\"p1p3pp\\\": 5, \\\"r1b2b1r\\\": 1, \\\"g4f5\\\": 7, \\\"2n2bpn\\\": 1, \\\"r1bqkr2\\\": 1, \\\"p2p3p\\\": 5, \\\"1pp1ppp1\\\": 8, \\\"g6h8\\\": 1, \\\"5nn1\\\": 1, \\\"2bqkbnr\\\": 8, \\\"p1pp2p1\\\": 2, \\\"d4h8\\\": 1, \\\"3qp3\\\": 1, \\\"rp1ppp1p\\\": 1, \\\"pppppk1p\\\": 2, \\\"p1pp4\\\": 7, \\\"pp2p3\\\": 5, \\\"5ppp\\\": 5, \\\"n2ppq2\\\": 1, \\\"f6e5\\\": 1, \\\"pp1bpppp\\\": 2, \\\"1q6\\\": 5, \\\"2np3n\\\": 2, \\\"c4d6\\\": 1, \\\"c1e3\\\": 1, \\\"pppp4\\\": 5, \\\"4pppp\\\": 5, \\\"1pp4n\\\": 5, \\\"2n2p1p\\\": 4, \\\"p1p2p1n\\\": 2, \\\"h7f6\\\": 1, \\\"pppp1kp1\\\": 3, \\\"r1bq1bn1\\\": 1, \\\"4p1r1\\\": 1, \\\"d5e4\\\": 2, \\\"3p1b2\\\": 6, \\\"pp1p1pp1\\\": 7, \\\"rpppp2r\\\": 1, \\\"1rb1kb1r\\\": 1, \\\"p4pp1\\\": 3, \\\"1nbqkbn1\\\": 1, \\\"n2p1q1n\\\": 1, \\\"f6h4\\\": 1, \\\"e4d5\\\": 2, \\\"3np3\\\": 3, \\\"3b1p2\\\": 1, \\\"h7h8\\\": 2, \\\"ppp1pp1q\\\": 1, \\\"1qnp4\\\": 1, \\\"1qp4p\\\": 1, \\\"rn1q1bnr\\\": 9, \\\"1bppk1pp\\\": 1, \\\"p2ppp1p\\\": 7, \\\"a3b5\\\": 4, \\\"h5g4\\\": 3, \\\"pppqppp1\\\": 1, \\\"3ppq2\\\": 1, \\\"pppn1p1p\\\": 1, \\\"2n2p1b\\\": 1, \\\"p2pp1b1\\\": 1, \\\"5q2\\\": 3, \\\"3qpn1p\\\": 1, \\\"n4p1b\\\": 1, \\\"rn1qkbr1\\\": 4, \\\"h3g2\\\": 4, \\\"r1b1kb1r\\\": 11, \\\"ppp3p1\\\": 4, \\\"n1p2pp1\\\": 1, \\\"1pp1p2p\\\": 3, \\\"q2p3p\\\": 1, \\\"f5e4\\\": 5, \\\"p2p1p2\\\": 6, \\\"p1pppp2\\\": 5, \\\"r2ppppp\\\": 2, \\\"2np1p2\\\": 4, \\\"2n4n\\\": 5, \\\"p3p2n\\\": 4, \\\"f1c4\\\": 1, \\\"1bppbppp\\\": 1, \\\"pq3p1p\\\": 1, \\\"1p1pp1p1\\\": 3, \\\"p2ppk1p\\\": 1, \\\"b3a4\\\": 1, \\\"q4pp1\\\": 1, \\\"pppbp1pp\\\": 1, \\\"pbpp1pp1\\\": 1, \\\"1p2p1np\\\": 1, \\\"pp1pp1p1\\\": 4, \\\"pnp5\\\": 2, \\\"1b2p2p\\\": 1, \\\"r1bq2nr\\\": 1, \\\"2n1p3\\\": 9, \\\"ppppkpp1\\\": 1, \\\"1pppp2p\\\": 6, \\\"1b1ppppp\\\": 5, \\\"r4p2\\\": 2, \\\"n4n2\\\": 6, \\\"1ppp1p1p\\\": 4, \\\"n1p4p\\\": 1, \\\"1p1pkp2\\\": 1, \\\"p2pp1pp\\\": 5, \\\"1bpp1p1p\\\": 1, \\\"a4b5\\\": 5, \\\"1n3p2\\\": 3, \\\"pp2p1b1\\\": 1, \\\"r5n1\\\": 1, \\\"d8g5\\\": 1, \\\"1pp1p3\\\": 3, \\\"3p1pp1\\\": 7, \\\"p1qppppp\\\": 2, \\\"p4n2\\\": 9, \\\"nqp5\\\": 2, \\\"d8h4\\\": 3, \\\"2p2pp1\\\": 6, \\\"d5c4\\\": 5, \\\"p1bn4\\\": 1, \\\"2pq3n\\\": 1, \\\"rnbq1bn1\\\": 4, \\\"pp1ppk2\\\": 1, \\\"3p3r\\\": 1, \\\"1ppkppp1\\\": 1, \\\"b5c3\\\": 1, \\\"p2pp2p\\\": 4, \\\"1p2np2\\\": 2, \\\"pp2p1pp\\\": 8, \\\"d8a5\\\": 3, \\\"1pp1pnp1\\\": 1, \\\"1ppp1ppr\\\": 1, \\\"a3b4\\\": 2, \\\"p1n1pq2\\\": 1, \\\"3p1ppp\\\": 3, \\\"qk\\\": 4, \\\"r1b1kbn1\\\": 4, \\\"1n5p\\\": 2, \\\"d2d3\\\": 2, \\\"qp6\\\": 3, \\\"rpp2p1p\\\": 1, \\\"1p2p2n\\\": 1, \\\"2pp2pp\\\": 5, \\\"1p4b1\\\": 2, \\\"d6b4\\\": 1, \\\"3b3p\\\": 2, \\\"p1pnpppp\\\": 2, \\\"p1q1pp1p\\\": 1, \\\"2ppp3\\\": 4, \\\"1pppn1p1\\\": 2, \\\"b7\\\": 4, \\\"pp4pp\\\": 1, \\\"1p2n1p1\\\": 1, \\\"p1ppn2p\\\": 1, \\\"e6d8\\\": 1, \\\"2pp2p1\\\": 4, \\\"ppnbpp1p\\\": 1, \\\"rnbk2nr\\\": 3, \\\"pp1n1pp1\\\": 1, \\\"p2pp3\\\": 3, \\\"f8d6\\\": 1, \\\"2pqp2p\\\": 1, \\\"1pp2ppp\\\": 4, \\\"1p1b1p1p\\\": 1, \\\"c1d2\\\": 2, \\\"2ppn1p1\\\": 1, \\\"a2c1\\\": 2, \\\"nppp1pp1\\\": 1, \\\"p3n2p\\\": 1, \\\"1rbqkb1r\\\": 8, \\\"4pq1b\\\": 1, \\\"1pb5\\\": 1, \\\"f3d1\\\": 1, \\\"1p2n3\\\": 2, \\\"n1p3p1\\\": 3, \\\"f8c5\\\": 2, \\\"1r2p3\\\": 1, \\\"r3n3\\\": 1, \\\"a5a7\\\": 1, \\\"2bqkb1r\\\": 3, \\\"p1pp3p\\\": 2, \\\"n2p2p1\\\": 1, \\\"1bp1pppp\\\": 1, \\\"3b3n\\\": 4, \\\"2pnpp1p\\\": 2, \\\"2ppp1pp\\\": 5, \\\"1p5n\\\": 1, \\\"pp1np1pp\\\": 1, \\\"2pp1p2\\\": 4, \\\"p1nq3p\\\": 1, \\\"c6d4\\\": 1, \\\"c6b4\\\": 4, \\\"pp1npppp\\\": 1, \\\"p3p1pp\\\": 1, \\\"1pp1np1p\\\": 1, \\\"e5f3\\\": 1, \\\"1p2pn2\\\": 4, \\\"ppppp1pr\\\": 1, \\\"f6e4\\\": 5, \\\"p1pp1n2\\\": 1, \\\"rnbq1k1r\\\": 1, \\\"2pp1p1p\\\": 2, \\\"3pbppp\\\": 3, \\\"np6\\\": 13, \\\"h5e2\\\": 1, \\\"4pb2\\\": 2, \\\"2p1p1p1\\\": 6, \\\"1p2p2b\\\": 1, \\\"3pp1pp\\\": 4, \\\"p1n2p2\\\": 3, \\\"p1p2p1p\\\": 3, \\\"pp1p1p2\\\": 4, \\\"g3b3\\\": 1, \\\"1q4qp\\\": 1, \\\"ppp1p1p1\\\": 10, \\\"2npbp1p\\\": 1, \\\"p4p1p\\\": 5, \\\"1p4pp\\\": 3, \\\"3ppp1r\\\": 1, \\\"f5d5\\\": 1, \\\"p1pp1ppr\\\": 2, \\\"p2p1qpp\\\": 1, \\\"np2p2p\\\": 1, \\\"1ppbpp2\\\": 1, \\\"1p1p1pp1\\\": 2, \\\"pn5p\\\": 1, \\\"b4c6\\\": 1, \\\"5p1q\\\": 2, \\\"2ppp2p\\\": 3, \\\"h4e7\\\": 1, \\\"d4c5\\\": 2, \\\"g5f6\\\": 1, \\\"3pp1p1\\\": 4, \\\"rnbq2nr\\\": 4, \\\"pppkb1pp\\\": 1, \\\"h1g1\\\": 1, \\\"p3pp1b\\\": 1, \\\"g3f4\\\": 2, \\\"pp1npp2\\\": 1, \\\"n5q1\\\": 1, \\\"2pp3p\\\": 5, \\\"p3pppp\\\": 5, \\\"1pqppp2\\\": 1, \\\"ppp4p\\\": 3, \\\"4pp1b\\\": 1, \\\"2n1p2r\\\": 1, \\\"qq\\\": 8, \\\"r1bqk1n1\\\": 1, \\\"p1ppbpp1\\\": 1, \\\"q3pp2\\\": 1, \\\"b1p5\\\": 1, \\\"3r4\\\": 1, \\\"d3g3\\\": 1, \\\"pppbpppp\\\": 4, \\\"h6g4\\\": 5, \\\"r1pppp1p\\\": 5, \\\"a2b2\\\": 1, \\\"1p2p1pp\\\": 3, \\\"2ppb3\\\": 1, \\\"1ppppp2\\\": 6, \\\"f8a3\\\": 1, \\\"a5b4\\\": 2, \\\"d7g4\\\": 2, \\\"2pp3n\\\": 1, \\\"p1ppbppp\\\": 1, \\\"d7d6\\\": 3, \\\"3q4\\\": 4, \\\"1r1q1bnr\\\": 1, \\\"4p2b\\\": 2, \\\"1pnp4\\\": 4, \\\"d3d4\\\": 3, \\\"f8b4\\\": 2, \\\"1p5b\\\": 1, \\\"h6d2\\\": 1, \\\"p1n2n1b\\\": 1, \\\"3p2pn\\\": 3, \\\"pppbpp1p\\\": 2, \\\"g7h6\\\": 2, \\\"1pn2p1b\\\": 1, \\\"pp2ppp1\\\": 6, \\\"pppppp2\\\": 7, \\\"pp1pnb2\\\": 1, \\\"r1p1ppp1\\\": 1, \\\"1n1qkbnr\\\": 4, \\\"pp3ppp\\\": 2, \\\"f4e5\\\": 5, \\\"2rqkbnr\\\": 1, \\\"g5d8\\\": 2, \\\"p2p1ppp\\\": 6, \\\"pb6\\\": 3, \\\"1p2p1n1\\\": 2, \\\"d1g4\\\": 2, \\\"p2p1p1p\\\": 3, \\\"g4e2\\\": 1, \\\"p1pbpppp\\\": 1, \\\"np2pppp\\\": 1, \\\"3p2n1\\\": 2, \\\"p2pkpp1\\\": 1, \\\"3ppp2\\\": 7, \\\"1b4pp\\\": 1, \\\"1pp2p2\\\": 4, \\\"ppppp2n\\\": 1, \\\"1ppppk1p\\\": 1, \\\"pppqpppp\\\": 2, \\\"3p3q\\\": 2, \\\"b3p3\\\": 2, \\\"n6b\\\": 2, \\\"g1h3\\\": 2, \\\"qpp5\\\": 4, \\\"bp5n\\\": 2, \\\"a6b7\\\": 2, \\\"a6\\\": 1, \\\"1pppqpp1\\\": 2, \\\"b5c6\\\": 1, \\\"1qp5\\\": 3, \\\"b6b4\\\": 2, \\\"h5h6\\\": 2, \\\"1npp2pp\\\": 1, \\\"5p1r\\\": 1, \\\"ppp1nppp\\\": 1, \\\"1q4p1\\\": 1, \\\"pp2n3\\\": 1, \\\"pppp1kpp\\\": 4, \\\"1p1p2bp\\\": 1, \\\"1pnp1p2\\\": 1, \\\"1p1pb3\\\": 1, \\\"1ppnpp2\\\": 1, \\\"ppq1b2p\\\": 1, \\\"p1p1pp2\\\": 3, \\\"g4d1\\\": 5, \\\"1n3pq1\\\": 1, \\\"c4a3\\\": 1, \\\"b2pb3\\\": 1, \\\"c5a6\\\": 1, \\\"p4np1\\\": 2, \\\"d7c6\\\": 1, \\\"1ppp4\\\": 6, \\\"p2pp1bp\\\": 2, \\\"np1ppp1p\\\": 1, \\\"p1p2p2\\\": 3, \\\"1q4pn\\\": 1, \\\"1p1p1kpp\\\": 1, \\\"d7c5\\\": 1, \\\"1p1nkppp\\\": 1, \\\"e7e8\\\": 2, \\\"r4np1\\\": 2, \\\"ppppkp1p\\\": 2, \\\"c8f5\\\": 1, \\\"3ppnpp\\\": 1, \\\"6bp\\\": 2, \\\"n3pp2\\\": 3, \\\"2n2p1n\\\": 1, \\\"2p1pn2\\\": 1, \\\"5n1b\\\": 1, \\\"2n3p1\\\": 4, \\\"ppn1qpp1\\\": 1, \\\"bp2p3\\\": 2, \\\"ppp1np1p\\\": 1, \\\"p1pkppp1\\\": 1, \\\"5pbp\\\": 1, \\\"1b1pp3\\\": 1, \\\"1pn4p\\\": 2, \\\"3p2bn\\\": 1, \\\"1p2bpp1\\\": 1, \\\"p1ppppbp\\\": 1, \\\"n5pn\\\": 2, \\\"ppppppbp\\\": 1, \\\"pp1pnpp1\\\": 1, \\\"pp1p1p1p\\\": 7, \\\"p1p2pn1\\\": 1, \\\"p1p1ppp1\\\": 3, \\\"rppppp1p\\\": 2, \\\"h4h5\\\": 2, \\\"pp1kpppp\\\": 1, \\\"h3f1\\\": 1, \\\"2pqpp1p\\\": 1, \\\"pp1p2n1\\\": 1, \\\"2pn4\\\": 2, \\\"a2a3\\\": 2, \\\"a3a1\\\": 2, \\\"r1b1k2r\\\": 2, \\\"1b2p2q\\\": 1, \\\"h4e4\\\": 1, \\\"np2p2n\\\": 1, \\\"b4b5\\\": 5, \\\"1ppp1pbp\\\": 2, \\\"5n1r\\\": 1, \\\"p2n3r\\\": 1, \\\"r4n2\\\": 2, \\\"pp1pqppp\\\": 1, \\\"g2g3\\\": 1, \\\"2p1ppp1\\\": 2, \\\"g7h8\\\": 1, \\\"pp1pp1qp\\\": 1, \\\"b1a3\\\": 3, \\\"p1ppbp1p\\\": 1, \\\"1pn2qp1\\\": 1, \\\"p2pb3\\\": 2, \\\"pppnpppp\\\": 2, \\\"e3d4\\\": 1, \\\"rpppp1pp\\\": 2, \\\"kk\\\": 5, \\\"rnk2bnr\\\": 1, \\\"ppp1qp1p\\\": 1, \\\"2b3p1\\\": 1, \\\"d4e2\\\": 1, \\\"3p1q2\\\": 3, \\\"bp1p2p1\\\": 1, \\\"n2p1n2\\\": 3, \\\"1rbqk1nr\\\": 1, \\\"2pkp1pp\\\": 1, \\\"1b1p1ppp\\\": 1, \\\"p2p3q\\\": 1, \\\"p1pq4\\\": 1, \\\"1p1p2n1\\\": 1, \\\"pp1qppp1\\\": 1, \\\"r1b2bnr\\\": 1, \\\"pp2kppp\\\": 2, \\\"3pq2p\\\": 1, \\\"pp2p2r\\\": 2, \\\"p1pbp1pp\\\": 4, \\\"2bpp1p1\\\": 1, \\\"f6g4\\\": 3, \\\"pppppkpr\\\": 1, \\\"ppnppppp\\\": 1, \\\"2r5\\\": 1, \\\"2b4p\\\": 1, \\\"c5d6\\\": 2, \\\"2p1pnpb\\\": 1, \\\"npppp3\\\": 1, \\\"qp3p2\\\": 1, \\\"2np2p1\\\": 1, \\\"d3c4\\\": 1, \\\"b6n\\\": 2, \\\"r1b2qnr\\\": 1, \\\"pp1pkppp\\\": 2, \\\"4p1pp\\\": 2, \\\"1pppnp2\\\": 2, \\\"ppppnp1p\\\": 1, \\\"b2e5\\\": 1, \\\"pbppppp1\\\": 2, \\\"3n4\\\": 6, \\\"1p1pbppp\\\": 1, \\\"bq2p3\\\": 1, \\\"rnb1k2r\\\": 3, \\\"2q1p3\\\": 1, \\\"d8e8\\\": 1, \\\"1pqp1pbp\\\": 1, \\\"pp1pnppp\\\": 1, \\\"p3pn2\\\": 2, \\\"rnbk1b1r\\\": 4, 